betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_tmr.c
/**
  *
  * @file    apm32f4xx_dal_tmr.c
  * @brief   TMR DAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the Timer (TMR) peripheral:
  *           + TMR Time Base Initialization
  *           + TMR Time Base Start
  *           + TMR Time Base Start Interruption
  *           + TMR Time Base Start DMA
  *           + TMR Output Compare/PWM Initialization
  *           + TMR Output Compare/PWM Channel Configuration
  *           + TMR Output Compare/PWM  Start
  *           + TMR Output Compare/PWM  Start Interruption
  *           + TMR Output Compare/PWM Start DMA
  *           + TMR Input Capture Initialization
  *           + TMR Input Capture Channel Configuration
  *           + TMR Input Capture Start
  *           + TMR Input Capture Start Interruption
  *           + TMR Input Capture Start DMA
  *           + TMR One Pulse Initialization
  *           + TMR One Pulse Channel Configuration
  *           + TMR One Pulse Start
  *           + TMR Encoder Interface Initialization
  *           + TMR Encoder Interface Start
  *           + TMR Encoder Interface Start Interruption
  *           + TMR Encoder Interface Start DMA
  *           + Commutation Event configuration with Interruption and DMA
  *           + TMR OCRef clear configuration
  *           + TMR External Clock configuration
  *
  * @attention
  *
  * Redistribution and use in source and binary forms, with or without modification, 
  * are permitted provided that the following conditions are met:
  *
  * 1. Redistributions of source code must retain the above copyright notice,
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of the copyright holder nor the names of its contributors
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
  * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
  * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
  * IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
  * INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
  * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE
  * OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
  * OF THE POSSIBILITY OF SUCH DAMAGE.
  * The original code has been modified by Geehy Semiconductor.
  * Copyright (c) 2016 STMicroelectronics. Copyright (C) 2023-2025 Geehy Semiconductor.
  * All rights reserved.
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  *
  @verbatim
  ==============================================================================
                      ##### TMRER Generic features #####
  ==============================================================================
  [..] The Timer features include:
       (#) 16-bit up, down, up/down auto-reload counter.
       (#) 16-bit programmable prescaler allowing dividing (also on the fly) the
           counter clock frequency either by any factor between 1 and 65536.
       (#) Up to 4 independent channels for:
           (++) Input Capture
           (++) Output Compare
           (++) PWM generation (Edge and Center-aligned Mode)
           (++) One-pulse mode output
       (#) Synchronization circuit to control the timer with external signals and to interconnect
            several timers together.
       (#) Supports incremental encoder for positioning purposes

            ##### How to use this driver #####
  ==============================================================================
    [..]
     (#) Initialize the TMR low level resources by implementing the following functions
         depending on the selected feature:
           (++) Time Base : DAL_TMR_Base_MspInit()
           (++) Input Capture : DAL_TMR_IC_MspInit()
           (++) Output Compare : DAL_TMR_OC_MspInit()
           (++) PWM generation : DAL_TMR_PWM_MspInit()
           (++) One-pulse mode output : DAL_TMR_OnePulse_MspInit()
           (++) Encoder mode output : DAL_TMR_Encoder_MspInit()

     (#) Initialize the TMR low level resources :
        (##) Enable the TMR interface clock using __DAL_RCM_TMRx_CLK_ENABLE();
        (##) TMR pins configuration
            (+++) Enable the clock for the TMR GPIOs using the following function:
             __DAL_RCM_GPIOx_CLK_ENABLE();
            (+++) Configure these TMR pins in Alternate function mode using DAL_GPIO_Init();

     (#) The external Clock can be configured, if needed (the default clock is the
         internal clock from the APBx), using the following function:
         DAL_TMR_ConfigClockSource, the clock configuration should be done before
         any start function.

     (#) Configure the TMR in the desired functioning mode using one of the
       Initialization function of this driver:
       (++) DAL_TMR_Base_Init: to use the Timer to generate a simple time base
       (++) DAL_TMR_OC_Init and DAL_TMR_OC_ConfigChannel: to use the Timer to generate an
            Output Compare signal.
       (++) DAL_TMR_PWM_Init and DAL_TMR_PWM_ConfigChannel: to use the Timer to generate a
            PWM signal.
       (++) DAL_TMR_IC_Init and DAL_TMR_IC_ConfigChannel: to use the Timer to measure an
            external signal.
       (++) DAL_TMR_OnePulse_Init and DAL_TMR_OnePulse_ConfigChannel: to use the Timer
            in One Pulse Mode.
       (++) DAL_TMR_Encoder_Init: to use the Timer Encoder Interface.

     (#) Activate the TMR peripheral using one of the start functions depending from the feature used:
           (++) Time Base : DAL_TMR_Base_Start(), DAL_TMR_Base_Start_DMA(), DAL_TMR_Base_Start_IT()
           (++) Input Capture :  DAL_TMR_IC_Start(), DAL_TMR_IC_Start_DMA(), DAL_TMR_IC_Start_IT()
           (++) Output Compare : DAL_TMR_OC_Start(), DAL_TMR_OC_Start_DMA(), DAL_TMR_OC_Start_IT()
           (++) PWM generation : DAL_TMR_PWM_Start(), DAL_TMR_PWM_Start_DMA(), DAL_TMR_PWM_Start_IT()
           (++) One-pulse mode output : DAL_TMR_OnePulse_Start(), DAL_TMR_OnePulse_Start_IT()
           (++) Encoder mode output : DAL_TMR_Encoder_Start(), DAL_TMR_Encoder_Start_DMA(), DAL_TMR_Encoder_Start_IT().

     (#) The DMA Burst is managed with the two following functions:
         DAL_TMR_DMABurst_WriteStart()
         DAL_TMR_DMABurst_ReadStart()

