betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_tmr.c
    *** Callback registration ***
  =============================================

  [..]
  The compilation define  USE_DAL_TMR_REGISTER_CALLBACKS when set to 1
  allows the user to configure dynamically the driver callbacks.

  [..]
  Use Function DAL_TMR_RegisterCallback() to register a callback.
  DAL_TMR_RegisterCallback() takes as parameters the DAL peripheral handle,
  the Callback ID and a pointer to the user callback function.

  [..]
  Use function DAL_TMR_UnRegisterCallback() to reset a callback to the default
  weak function.
  DAL_TMR_UnRegisterCallback takes as parameters the DAL peripheral handle,
  and the Callback ID.

  [..]
  These functions allow to register/unregister following callbacks:
    (+) Base_MspInitCallback              : TMR Base Msp Init Callback.
    (+) Base_MspDeInitCallback            : TMR Base Msp DeInit Callback.
    (+) IC_MspInitCallback                : TMR IC Msp Init Callback.
    (+) IC_MspDeInitCallback              : TMR IC Msp DeInit Callback.
    (+) OC_MspInitCallback                : TMR OC Msp Init Callback.
    (+) OC_MspDeInitCallback              : TMR OC Msp DeInit Callback.
    (+) PWM_MspInitCallback               : TMR PWM Msp Init Callback.
    (+) PWM_MspDeInitCallback             : TMR PWM Msp DeInit Callback.
    (+) OnePulse_MspInitCallback          : TMR One Pulse Msp Init Callback.
    (+) OnePulse_MspDeInitCallback        : TMR One Pulse Msp DeInit Callback.
    (+) Encoder_MspInitCallback           : TMR Encoder Msp Init Callback.
    (+) Encoder_MspDeInitCallback         : TMR Encoder Msp DeInit Callback.
    (+) HallSensor_MspInitCallback        : TMR Hall Sensor Msp Init Callback.
    (+) HallSensor_MspDeInitCallback      : TMR Hall Sensor Msp DeInit Callback.
    (+) PeriodElapsedCallback             : TMR Period Elapsed Callback.
    (+) PeriodElapsedHalfCpltCallback     : TMR Period Elapsed half complete Callback.
    (+) TriggerCallback                   : TMR Trigger Callback.
    (+) TriggerHalfCpltCallback           : TMR Trigger half complete Callback.
    (+) IC_CaptureCallback                : TMR Input Capture Callback.
    (+) IC_CaptureHalfCpltCallback        : TMR Input Capture half complete Callback.
    (+) OC_DelayElapsedCallback           : TMR Output Compare Delay Elapsed Callback.
    (+) PWM_PulseFinishedCallback         : TMR PWM Pulse Finished Callback.
    (+) PWM_PulseFinishedHalfCpltCallback : TMR PWM Pulse Finished half complete Callback.
    (+) ErrorCallback                     : TMR Error Callback.
    (+) CommutationCallback               : TMR Commutation Callback.
    (+) CommutationHalfCpltCallback       : TMR Commutation half complete Callback.
    (+) BreakCallback                     : TMR Break Callback.

  [..]
By default, after the Init and when the state is DAL_TMR_STATE_RESET
all interrupt callbacks are set to the corresponding weak functions:
  examples DAL_TMR_TriggerCallback(), DAL_TMR_ErrorCallback().

  [..]
  Exception done for MspInit and MspDeInit functions that are reset to the legacy weak
  functionalities in the Init / DeInit only when these callbacks are null
  (not registered beforehand). If not, MspInit or MspDeInit are not null, the Init / DeInit
    keep and use the user MspInit / MspDeInit callbacks(registered beforehand)

  [..]
    Callbacks can be registered / unregistered in DAL_TMR_STATE_READY state only.
    Exception done MspInit / MspDeInit that can be registered / unregistered
    in DAL_TMR_STATE_READY or DAL_TMR_STATE_RESET state,
    thus registered(user) MspInit / DeInit callbacks can be used during the Init / DeInit.
  In that case first register the MspInit/MspDeInit user callbacks
      using DAL_TMR_RegisterCallback() before calling DeInit or Init function.

  [..]
      When The compilation define USE_DAL_TMR_REGISTER_CALLBACKS is set to 0 or
      not defined, the callback registration feature is not available and all callbacks
      are set to the corresponding weak functions.

  @endverbatim
  *
  */

/* Includes ------------------------------------------------------------------*/
#include "apm32f4xx_dal.h"

/** @addtogroup APM32F4xx_DAL_Driver
  * @{
  */

/** @defgroup TMR TMR
  * @brief TMR DAL module driver
  * @{
  */

#ifdef DAL_TMR_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/** @addtogroup TMR_Private_Functions
  * @{
  */
static void TMR_OC1_SetConfig(TMR_TypeDef *TMRx, TMR_OC_InitTypeDef *OC_Config);
static void TMR_OC3_SetConfig(TMR_TypeDef *TMRx, TMR_OC_InitTypeDef *OC_Config);
static void TMR_OC4_SetConfig(TMR_TypeDef *TMRx, TMR_OC_InitTypeDef *OC_Config);
static void TMR_TI1_ConfigInputStage(TMR_TypeDef *TMRx, uint32_t TMR_ICPolarity, uint32_t TMR_ICFilter);
static void TMR_TI2_SetConfig(TMR_TypeDef *TMRx, uint32_t TMR_ICPolarity, uint32_t TMR_ICSelection,
                              uint32_t TMR_ICFilter);
static void TMR_TI2_ConfigInputStage(TMR_TypeDef *TMRx, uint32_t TMR_ICPolarity, uint32_t TMR_ICFilter);
static void TMR_TI3_SetConfig(TMR_TypeDef *TMRx, uint32_t TMR_ICPolarity, uint32_t TMR_ICSelection,
                              uint32_t TMR_ICFilter);
static void TMR_TI4_SetConfig(TMR_TypeDef *TMRx, uint32_t TMR_ICPolarity, uint32_t TMR_ICSelection,
                              uint32_t TMR_ICFilter);
static void TMR_ITRx_SetConfig(TMR_TypeDef *TMRx, uint32_t InputTriggerSource);
static void TMR_DMAPeriodElapsedCplt(DMA_HandleTypeDef *hdma);
static void TMR_DMAPeriodElapsedHalfCplt(DMA_HandleTypeDef *hdma);
static void TMR_DMATriggerCplt(DMA_HandleTypeDef *hdma);
static void TMR_DMATriggerHalfCplt(DMA_HandleTypeDef *hdma);
static DAL_StatusTypeDef TMR_SlaveTimer_SetConfig(TMR_HandleTypeDef *htmr,
                                                  TMR_SlaveConfigTypeDef *sSlaveConfig);
/**
  * @}
  */
/* Exported functions --------------------------------------------------------*/

/** @defgroup TMR_Exported_Functions TMR Exported Functions
  * @{
  */

/** @defgroup TMR_Exported_Functions_Group1 TMR Time Base functions
  *  @brief    Time Base functions
  *
@verbatim
  ==============================================================================
              ##### Time Base functions #####
  ==============================================================================
  [..]
    This section provides functions allowing to:
    (+) Initialize and configure the TMR base.
    (+) De-initialize the TMR base.
    (+) Start the Time Base.
    (+) Stop the Time Base.
    (+) Start the Time Base and enable interrupt.
    (+) Stop the Time Base and disable interrupt.
    (+) Start the Time Base and enable DMA transfer.
    (+) Stop the Time Base and disable DMA transfer.

@endverbatim
  * @{
  */
/**
  * @brief  Initializes the TMR Time base Unit according to the specified
  *         parameters in the TMR_HandleTypeDef and initialize the associated handle.
  * @note   Switching from Center Aligned counter mode to Edge counter mode (or reverse)
  *         requires a timer reset to avoid unexpected direction
  *         due to DIR bit readonly in center aligned mode.
  *         Ex: call @ref DAL_TMR_Base_DeInit() before DAL_TMR_Base_Init()
  * @param  htmr TMR Base handle
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_Base_Init(TMR_HandleTypeDef *htmr)
{
  /* Check the TMR handle allocation */
  if (htmr == NULL)
  {
    return DAL_ERROR;
  }

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_INSTANCE(htmr->Instance));
  ASSERT_PARAM(IS_TMR_COUNTER_MODE(htmr->Init.CounterMode));
  ASSERT_PARAM(IS_TMR_CLOCKDIVISION_DIV(htmr->Init.ClockDivision));
  ASSERT_PARAM(IS_TMR_AUTORELOAD_PRELOAD(htmr->Init.AutoReloadPreload));

  if (htmr->State == DAL_TMR_STATE_RESET)
  {
    /* Allocate lock resource and initialize it */
    htmr->Lock = DAL_UNLOCKED;

#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
    /* Reset interrupt callbacks to legacy weak callbacks */
    TMR_ResetCallback(htmr);

    if (htmr->Base_MspInitCallback == NULL)
    {
      htmr->Base_MspInitCallback = DAL_TMR_Base_MspInit;
    }
    /* Init the low level hardware : GPIO, CLOCK, NVIC */
    htmr->Base_MspInitCallback(htmr);
#else
    /* Init the low level hardware : GPIO, CLOCK, NVIC */
    DAL_TMR_Base_MspInit(htmr);
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */
  }

  /* Set the TMR state */
  htmr->State = DAL_TMR_STATE_BUSY;

  /* Set the Time Base configuration */
  TMR_Base_SetConfig(htmr->Instance, &htmr->Init);

  /* Initialize the DMA burst operation state */
  htmr->DMABurstState = DAL_DMA_BURST_STATE_READY;

  /* Initialize the TMR channels state */
  TMR_CHANNEL_STATE_SET_ALL(htmr, DAL_TMR_CHANNEL_STATE_READY);
  TMR_CHANNEL_N_STATE_SET_ALL(htmr, DAL_TMR_CHANNEL_STATE_READY);

  /* Initialize the TMR state*/
  htmr->State = DAL_TMR_STATE_READY;

  return DAL_OK;
}

/**
  * @brief  DeInitializes the TMR Base peripheral
  * @param  htmr TMR Base handle
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_Base_DeInit(TMR_HandleTypeDef *htmr)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_INSTANCE(htmr->Instance));

  htmr->State = DAL_TMR_STATE_BUSY;

