betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_tmr.c
  /* Disable the TMR Peripheral Clock */
  __DAL_TMR_DISABLE(htmr);

#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
  if (htmr->Base_MspDeInitCallback == NULL)
  {
    htmr->Base_MspDeInitCallback = DAL_TMR_Base_MspDeInit;
  }
  /* DeInit the low level hardware */
  htmr->Base_MspDeInitCallback(htmr);
#else
  /* DeInit the low level hardware: GPIO, CLOCK, NVIC */
  DAL_TMR_Base_MspDeInit(htmr);
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */

  /* Change the DMA burst operation state */
  htmr->DMABurstState = DAL_DMA_BURST_STATE_RESET;

  /* Change the TMR channels state */
  TMR_CHANNEL_STATE_SET_ALL(htmr, DAL_TMR_CHANNEL_STATE_RESET);
  TMR_CHANNEL_N_STATE_SET_ALL(htmr, DAL_TMR_CHANNEL_STATE_RESET);

  /* Change TMR state */
  htmr->State = DAL_TMR_STATE_RESET;

  /* Release Lock */
  __DAL_UNLOCK(htmr);

  return DAL_OK;
}

/**
  * @brief  Initializes the TMR Base MSP.
  * @param  htmr TMR Base handle
  * @retval None
  */
__weak void DAL_TMR_Base_MspInit(TMR_HandleTypeDef *htmr)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(htmr);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_TMR_Base_MspInit could be implemented in the user file
   */
}

/**
  * @brief  DeInitializes TMR Base MSP.
  * @param  htmr TMR Base handle
  * @retval None
  */
__weak void DAL_TMR_Base_MspDeInit(TMR_HandleTypeDef *htmr)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(htmr);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_TMR_Base_MspDeInit could be implemented in the user file
   */
}


/**
  * @brief  Starts the TMR Base generation.
  * @param  htmr TMR Base handle
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_Base_Start(TMR_HandleTypeDef *htmr)
{
  uint32_t tmpsmcr;

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_INSTANCE(htmr->Instance));

  /* Check the TMR state */
  if (htmr->State != DAL_TMR_STATE_READY)
  {
    return DAL_ERROR;
  }

  /* Set the TMR state */
  htmr->State = DAL_TMR_STATE_BUSY;

  /* Enable the Peripheral, except in trigger mode where enable is automatically done with trigger */
  if (IS_TMR_SLAVE_INSTANCE(htmr->Instance))
  {
    tmpsmcr = htmr->Instance->SMCTRL & TMR_SMCTRL_SMFSEL;
    if (!IS_TMR_SLAVEMODE_TRIGGER_ENABLED(tmpsmcr))
    {
      __DAL_TMR_ENABLE(htmr);
    }
  }
  else
  {
    __DAL_TMR_ENABLE(htmr);
  }

  /* Return function status */
  return DAL_OK;
}

/**
  * @brief  Stops the TMR Base generation.
  * @param  htmr TMR Base handle
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_Base_Stop(TMR_HandleTypeDef *htmr)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_INSTANCE(htmr->Instance));

  /* Disable the Peripheral */
  __DAL_TMR_DISABLE(htmr);

  /* Set the TMR state */
  htmr->State = DAL_TMR_STATE_READY;

  /* Return function status */
  return DAL_OK;
}

/**
  * @brief  Starts the TMR Base generation in interrupt mode.
  * @param  htmr TMR Base handle
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_Base_Start_IT(TMR_HandleTypeDef *htmr)
{
  uint32_t tmpsmcr;

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_INSTANCE(htmr->Instance));

  /* Check the TMR state */
  if (htmr->State != DAL_TMR_STATE_READY)
  {
    return DAL_ERROR;
  }

  /* Set the TMR state */
  htmr->State = DAL_TMR_STATE_BUSY;

  /* Enable the TMR Update interrupt */
  __DAL_TMR_ENABLE_IT(htmr, TMR_IT_UPDATE);

  /* Enable the Peripheral, except in trigger mode where enable is automatically done with trigger */
  if (IS_TMR_SLAVE_INSTANCE(htmr->Instance))
  {
    tmpsmcr = htmr->Instance->SMCTRL & TMR_SMCTRL_SMFSEL;
    if (!IS_TMR_SLAVEMODE_TRIGGER_ENABLED(tmpsmcr))
    {
      __DAL_TMR_ENABLE(htmr);
    }
  }
  else
  {
    __DAL_TMR_ENABLE(htmr);
  }

  /* Return function status */
  return DAL_OK;
}

/**
  * @brief  Stops the TMR Base generation in interrupt mode.
  * @param  htmr TMR Base handle
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_Base_Stop_IT(TMR_HandleTypeDef *htmr)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_INSTANCE(htmr->Instance));

  /* Disable the TMR Update interrupt */
  __DAL_TMR_DISABLE_IT(htmr, TMR_IT_UPDATE);

  /* Disable the Peripheral */
  __DAL_TMR_DISABLE(htmr);

  /* Set the TMR state */
  htmr->State = DAL_TMR_STATE_READY;

  /* Return function status */
  return DAL_OK;
}

/**
  * @brief  Starts the TMR Base generation in DMA mode.
  * @param  htmr TMR Base handle
  * @param  pData The source Buffer address.
  * @param  Length The length of data to be transferred from memory to peripheral.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_Base_Start_DMA(TMR_HandleTypeDef *htmr, uint32_t *pData, uint16_t Length)
{
  uint32_t tmpsmcr;

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_DMA_INSTANCE(htmr->Instance));

  /* Set the TMR state */
  if (htmr->State == DAL_TMR_STATE_BUSY)
  {
    return DAL_BUSY;
  }
  else if (htmr->State == DAL_TMR_STATE_READY)
  {
    if ((pData == NULL) || (Length == 0U))
    {
      return DAL_ERROR;
    }
    else
    {
      htmr->State = DAL_TMR_STATE_BUSY;
    }
  }
  else
  {
    return DAL_ERROR;
  }

  /* Set the DMA Period elapsed callbacks */
  htmr->hdma[TMR_DMA_ID_UPDATE]->XferCpltCallback = TMR_DMAPeriodElapsedCplt;
  htmr->hdma[TMR_DMA_ID_UPDATE]->XferHalfCpltCallback = TMR_DMAPeriodElapsedHalfCplt;

  /* Set the DMA error callback */
  htmr->hdma[TMR_DMA_ID_UPDATE]->XferErrorCallback = TMR_DMAError ;

  /* Enable the DMA stream */
  if (DAL_DMA_Start_IT(htmr->hdma[TMR_DMA_ID_UPDATE], (uint32_t)pData, (uint32_t)&htmr->Instance->AUTORLD,
                       Length) != DAL_OK)
  {
    /* Return error status */
    return DAL_ERROR;
  }

  /* Enable the TMR Update DMA request */
  __DAL_TMR_ENABLE_DMA(htmr, TMR_DMA_UPDATE);

  /* Enable the Peripheral, except in trigger mode where enable is automatically done with trigger */
  if (IS_TMR_SLAVE_INSTANCE(htmr->Instance))
  {
    tmpsmcr = htmr->Instance->SMCTRL & TMR_SMCTRL_SMFSEL;
    if (!IS_TMR_SLAVEMODE_TRIGGER_ENABLED(tmpsmcr))
    {
      __DAL_TMR_ENABLE(htmr);
    }
  }
  else
  {
    __DAL_TMR_ENABLE(htmr);
  }

  /* Return function status */
  return DAL_OK;
}

/**
  * @brief  Stops the TMR Base generation in DMA mode.
  * @param  htmr TMR Base handle
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_Base_Stop_DMA(TMR_HandleTypeDef *htmr)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_DMA_INSTANCE(htmr->Instance));

  /* Disable the TMR Update DMA request */
  __DAL_TMR_DISABLE_DMA(htmr, TMR_DMA_UPDATE);

  (void)DAL_DMA_Abort_IT(htmr->hdma[TMR_DMA_ID_UPDATE]);

  /* Disable the Peripheral */
  __DAL_TMR_DISABLE(htmr);

  /* Set the TMR state */
  htmr->State = DAL_TMR_STATE_READY;

  /* Return function status */
  return DAL_OK;
}

/**
  * @}
  */

/** @defgroup TMR_Exported_Functions_Group2 TMR Output Compare functions
  *  @brief    TMR Output Compare functions
  *
@verbatim
  ==============================================================================
                  ##### TMR Output Compare functions #####
  ==============================================================================
  [..]
    This section provides functions allowing to:
    (+) Initialize and configure the TMR Output Compare.
    (+) De-initialize the TMR Output Compare.
    (+) Start the TMR Output Compare.
    (+) Stop the TMR Output Compare.
    (+) Start the TMR Output Compare and enable interrupt.
    (+) Stop the TMR Output Compare and disable interrupt.
    (+) Start the TMR Output Compare and enable DMA transfer.
    (+) Stop the TMR Output Compare and disable DMA transfer.

@endverbatim
  * @{
  */
/**
  * @brief  Initializes the TMR Output Compare according to the specified
  *         parameters in the TMR_HandleTypeDef and initializes the associated handle.
  * @note   Switching from Center Aligned counter mode to Edge counter mode (or reverse)
  *         requires a timer reset to avoid unexpected direction
  *         due to DIR bit readonly in center aligned mode.
  *         Ex: call @ref DAL_TMR_OC_DeInit() before DAL_TMR_OC_Init()
  * @param  htmr TMR Output Compare handle
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_OC_Init(TMR_HandleTypeDef *htmr)
{
  /* Check the TMR handle allocation */
  if (htmr == NULL)
  {
    return DAL_ERROR;
  }

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_INSTANCE(htmr->Instance));
  ASSERT_PARAM(IS_TMR_COUNTER_MODE(htmr->Init.CounterMode));
  ASSERT_PARAM(IS_TMR_CLOCKDIVISION_DIV(htmr->Init.ClockDivision));
  ASSERT_PARAM(IS_TMR_PERIOD(htmr, htmr->Init.Period));
  ASSERT_PARAM(IS_TMR_AUTORELOAD_PRELOAD(htmr->Init.AutoReloadPreload));

  if (htmr->State == DAL_TMR_STATE_RESET)
  {
    /* Allocate lock resource and initialize it */
    htmr->Lock = DAL_UNLOCKED;

#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
    /* Reset interrupt callbacks to legacy weak callbacks */
    TMR_ResetCallback(htmr);

    if (htmr->OC_MspInitCallback == NULL)
    {
      htmr->OC_MspInitCallback = DAL_TMR_OC_MspInit;
    }
    /* Init the low level hardware : GPIO, CLOCK, NVIC */
    htmr->OC_MspInitCallback(htmr);
#else
    /* Init the low level hardware : GPIO, CLOCK, NVIC and DMA */
    DAL_TMR_OC_MspInit(htmr);
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */
  }

  /* Set the TMR state */
  htmr->State = DAL_TMR_STATE_BUSY;

  /* Init the base time for the Output Compare */
  TMR_Base_SetConfig(htmr->Instance,  &htmr->Init);

  /* Initialize the DMA burst operation state */
  htmr->DMABurstState = DAL_DMA_BURST_STATE_READY;

  /* Initialize the TMR channels state */
  TMR_CHANNEL_STATE_SET_ALL(htmr, DAL_TMR_CHANNEL_STATE_READY);
  TMR_CHANNEL_N_STATE_SET_ALL(htmr, DAL_TMR_CHANNEL_STATE_READY);

  /* Initialize the TMR state*/
  htmr->State = DAL_TMR_STATE_READY;

  return DAL_OK;
}

/**
  * @brief  DeInitializes the TMR peripheral
  * @param  htmr TMR Output Compare handle
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_OC_DeInit(TMR_HandleTypeDef *htmr)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_INSTANCE(htmr->Instance));

  htmr->State = DAL_TMR_STATE_BUSY;

