betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_tmr.c
  /* Disable the TMR Peripheral Clock */
  __DAL_TMR_DISABLE(htmr);

#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
  if (htmr->OC_MspDeInitCallback == NULL)
  {
    htmr->OC_MspDeInitCallback = DAL_TMR_OC_MspDeInit;
  }
  /* DeInit the low level hardware */
  htmr->OC_MspDeInitCallback(htmr);
#else
  /* DeInit the low level hardware: GPIO, CLOCK, NVIC and DMA */
  DAL_TMR_OC_MspDeInit(htmr);
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */

  /* Change the DMA burst operation state */
  htmr->DMABurstState = DAL_DMA_BURST_STATE_RESET;

  /* Change the TMR channels state */
  TMR_CHANNEL_STATE_SET_ALL(htmr, DAL_TMR_CHANNEL_STATE_RESET);
  TMR_CHANNEL_N_STATE_SET_ALL(htmr, DAL_TMR_CHANNEL_STATE_RESET);

  /* Change TMR state */
  htmr->State = DAL_TMR_STATE_RESET;

  /* Release Lock */
  __DAL_UNLOCK(htmr);

  return DAL_OK;
}

/**
  * @brief  Initializes the TMR Output Compare MSP.
  * @param  htmr TMR Output Compare handle
  * @retval None
  */
__weak void DAL_TMR_OC_MspInit(TMR_HandleTypeDef *htmr)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(htmr);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_TMR_OC_MspInit could be implemented in the user file
   */
}

/**
  * @brief  DeInitializes TMR Output Compare MSP.
  * @param  htmr TMR Output Compare handle
  * @retval None
  */
__weak void DAL_TMR_OC_MspDeInit(TMR_HandleTypeDef *htmr)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(htmr);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_TMR_OC_MspDeInit could be implemented in the user file
   */
}

/**
  * @brief  Starts the TMR Output Compare signal generation.
  * @param  htmr TMR Output Compare handle
  * @param  Channel TMR Channel to be enabled
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1 selected
  *            @arg TMR_CHANNEL_2: TMR Channel 2 selected
  *            @arg TMR_CHANNEL_3: TMR Channel 3 selected
  *            @arg TMR_CHANNEL_4: TMR Channel 4 selected
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_OC_Start(TMR_HandleTypeDef *htmr, uint32_t Channel)
{
  uint32_t tmpsmcr;

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_CCX_INSTANCE(htmr->Instance, Channel));

  /* Check the TMR channel state */
  if (TMR_CHANNEL_STATE_GET(htmr, Channel) != DAL_TMR_CHANNEL_STATE_READY)
  {
    return DAL_ERROR;
  }

  /* Set the TMR channel state */
  TMR_CHANNEL_STATE_SET(htmr, Channel, DAL_TMR_CHANNEL_STATE_BUSY);

  /* Enable the Output compare channel */
  TMR_CCxChannelCmd(htmr->Instance, Channel, TMR_CCx_ENABLE);

  if (IS_TMR_BREAK_INSTANCE(htmr->Instance) != RESET)
  {
    /* Enable the main output */
    __DAL_TMR_MOE_ENABLE(htmr);
  }

  /* Enable the Peripheral, except in trigger mode where enable is automatically done with trigger */
  if (IS_TMR_SLAVE_INSTANCE(htmr->Instance))
  {
    tmpsmcr = htmr->Instance->SMCTRL & TMR_SMCTRL_SMFSEL;
    if (!IS_TMR_SLAVEMODE_TRIGGER_ENABLED(tmpsmcr))
    {
      __DAL_TMR_ENABLE(htmr);
    }
  }
  else
  {
    __DAL_TMR_ENABLE(htmr);
  }

  /* Return function status */
  return DAL_OK;
}

/**
  * @brief  Stops the TMR Output Compare signal generation.
  * @param  htmr TMR Output Compare handle
  * @param  Channel TMR Channel to be disabled
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1 selected
  *            @arg TMR_CHANNEL_2: TMR Channel 2 selected
  *            @arg TMR_CHANNEL_3: TMR Channel 3 selected
  *            @arg TMR_CHANNEL_4: TMR Channel 4 selected
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_OC_Stop(TMR_HandleTypeDef *htmr, uint32_t Channel)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_CCX_INSTANCE(htmr->Instance, Channel));

  /* Disable the Output compare channel */
  TMR_CCxChannelCmd(htmr->Instance, Channel, TMR_CCx_DISABLE);

  if (IS_TMR_BREAK_INSTANCE(htmr->Instance) != RESET)
  {
    /* Disable the Main Output */
    __DAL_TMR_MOE_DISABLE(htmr);
  }

  /* Disable the Peripheral */
  __DAL_TMR_DISABLE(htmr);

  /* Set the TMR channel state */
  TMR_CHANNEL_STATE_SET(htmr, Channel, DAL_TMR_CHANNEL_STATE_READY);

  /* Return function status */
  return DAL_OK;
}

/**
  * @brief  Starts the TMR Output Compare signal generation in interrupt mode.
  * @param  htmr TMR Output Compare handle
  * @param  Channel TMR Channel to be enabled
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1 selected
  *            @arg TMR_CHANNEL_2: TMR Channel 2 selected
  *            @arg TMR_CHANNEL_3: TMR Channel 3 selected
  *            @arg TMR_CHANNEL_4: TMR Channel 4 selected
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_OC_Start_IT(TMR_HandleTypeDef *htmr, uint32_t Channel)
{
  DAL_StatusTypeDef status = DAL_OK;
  uint32_t tmpsmcr;

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_CCX_INSTANCE(htmr->Instance, Channel));

  /* Check the TMR channel state */
  if (TMR_CHANNEL_STATE_GET(htmr, Channel) != DAL_TMR_CHANNEL_STATE_READY)
  {
    return DAL_ERROR;
  }

  /* Set the TMR channel state */
  TMR_CHANNEL_STATE_SET(htmr, Channel, DAL_TMR_CHANNEL_STATE_BUSY);

  switch (Channel)
  {
    case TMR_CHANNEL_1:
    {
      /* Enable the TMR Capture/Compare 1 interrupt */
      __DAL_TMR_ENABLE_IT(htmr, TMR_IT_CC1);
      break;
    }

    case TMR_CHANNEL_2:
    {
      /* Enable the TMR Capture/Compare 2 interrupt */
      __DAL_TMR_ENABLE_IT(htmr, TMR_IT_CC2);
      break;
    }

    case TMR_CHANNEL_3:
    {
      /* Enable the TMR Capture/Compare 3 interrupt */
      __DAL_TMR_ENABLE_IT(htmr, TMR_IT_CC3);
      break;
    }

    case TMR_CHANNEL_4:
    {
      /* Enable the TMR Capture/Compare 4 interrupt */
      __DAL_TMR_ENABLE_IT(htmr, TMR_IT_CC4);
      break;
    }

    default:
      status = DAL_ERROR;
      break;
  }

  if (status == DAL_OK)
  {
    /* Enable the Output compare channel */
    TMR_CCxChannelCmd(htmr->Instance, Channel, TMR_CCx_ENABLE);

