betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_tmr.c
    if (IS_TMR_BREAK_INSTANCE(htmr->Instance) != RESET)
    {
      /* Enable the main output */
      __DAL_TMR_MOE_ENABLE(htmr);
    }

    /* Enable the Peripheral, except in trigger mode where enable is automatically done with trigger */
    if (IS_TMR_SLAVE_INSTANCE(htmr->Instance))
    {
      tmpsmcr = htmr->Instance->SMCTRL & TMR_SMCTRL_SMFSEL;
      if (!IS_TMR_SLAVEMODE_TRIGGER_ENABLED(tmpsmcr))
      {
        __DAL_TMR_ENABLE(htmr);
      }
    }
    else
    {
      __DAL_TMR_ENABLE(htmr);
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  Stops the TMR Output Compare signal generation in DMA mode.
  * @param  htmr TMR Output Compare handle
  * @param  Channel TMR Channel to be disabled
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1 selected
  *            @arg TMR_CHANNEL_2: TMR Channel 2 selected
  *            @arg TMR_CHANNEL_3: TMR Channel 3 selected
  *            @arg TMR_CHANNEL_4: TMR Channel 4 selected
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_OC_Stop_DMA(TMR_HandleTypeDef *htmr, uint32_t Channel)
{
  DAL_StatusTypeDef status = DAL_OK;

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_CCX_INSTANCE(htmr->Instance, Channel));

  switch (Channel)
  {
    case TMR_CHANNEL_1:
    {
      /* Disable the TMR Capture/Compare 1 DMA request */
      __DAL_TMR_DISABLE_DMA(htmr, TMR_DMA_CC1);
      (void)DAL_DMA_Abort_IT(htmr->hdma[TMR_DMA_ID_CC1]);
      break;
    }

    case TMR_CHANNEL_2:
    {
      /* Disable the TMR Capture/Compare 2 DMA request */
      __DAL_TMR_DISABLE_DMA(htmr, TMR_DMA_CC2);
      (void)DAL_DMA_Abort_IT(htmr->hdma[TMR_DMA_ID_CC2]);
      break;
    }

    case TMR_CHANNEL_3:
    {
      /* Disable the TMR Capture/Compare 3 DMA request */
      __DAL_TMR_DISABLE_DMA(htmr, TMR_DMA_CC3);
      (void)DAL_DMA_Abort_IT(htmr->hdma[TMR_DMA_ID_CC3]);
      break;
    }

    case TMR_CHANNEL_4:
    {
      /* Disable the TMR Capture/Compare 4 interrupt */
      __DAL_TMR_DISABLE_DMA(htmr, TMR_DMA_CC4);
      (void)DAL_DMA_Abort_IT(htmr->hdma[TMR_DMA_ID_CC4]);
      break;
    }

    default:
      status = DAL_ERROR;
      break;
  }

  if (status == DAL_OK)
  {
    /* Disable the Output compare channel */
    TMR_CCxChannelCmd(htmr->Instance, Channel, TMR_CCx_DISABLE);

    if (IS_TMR_BREAK_INSTANCE(htmr->Instance) != RESET)
    {
      /* Disable the Main Output */
      __DAL_TMR_MOE_DISABLE(htmr);
    }

    /* Disable the Peripheral */
    __DAL_TMR_DISABLE(htmr);

    /* Set the TMR channel state */
    TMR_CHANNEL_STATE_SET(htmr, Channel, DAL_TMR_CHANNEL_STATE_READY);
  }

  /* Return function status */
  return status;
}

/**
  * @}
  */

/** @defgroup TMR_Exported_Functions_Group3 TMR PWM functions
  *  @brief    TMR PWM functions
  *
@verbatim
  ==============================================================================
                          ##### TMR PWM functions #####
  ==============================================================================
  [..]
    This section provides functions allowing to:
    (+) Initialize and configure the TMR PWM.
    (+) De-initialize the TMR PWM.
    (+) Start the TMR PWM.
    (+) Stop the TMR PWM.
    (+) Start the TMR PWM and enable interrupt.
    (+) Stop the TMR PWM and disable interrupt.
    (+) Start the TMR PWM and enable DMA transfer.
    (+) Stop the TMR PWM and disable DMA transfer.

@endverbatim
  * @{
  */
/**
  * @brief  Initializes the TMR PWM Time Base according to the specified
  *         parameters in the TMR_HandleTypeDef and initializes the associated handle.
  * @note   Switching from Center Aligned counter mode to Edge counter mode (or reverse)
  *         requires a timer reset to avoid unexpected direction
  *         due to DIR bit readonly in center aligned mode.
  *         Ex: call @ref DAL_TMR_PWM_DeInit() before DAL_TMR_PWM_Init()
  * @param  htmr TMR PWM handle
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_PWM_Init(TMR_HandleTypeDef *htmr)
{
  /* Check the TMR handle allocation */
  if (htmr == NULL)
  {
    return DAL_ERROR;
  }

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_INSTANCE(htmr->Instance));
  ASSERT_PARAM(IS_TMR_COUNTER_MODE(htmr->Init.CounterMode));
  ASSERT_PARAM(IS_TMR_CLOCKDIVISION_DIV(htmr->Init.ClockDivision));
  ASSERT_PARAM(IS_TMR_PERIOD(htmr, htmr->Init.Period));
  ASSERT_PARAM(IS_TMR_AUTORELOAD_PRELOAD(htmr->Init.AutoReloadPreload));

  if (htmr->State == DAL_TMR_STATE_RESET)
  {
    /* Allocate lock resource and initialize it */
    htmr->Lock = DAL_UNLOCKED;

#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
    /* Reset interrupt callbacks to legacy weak callbacks */
    TMR_ResetCallback(htmr);

    if (htmr->PWM_MspInitCallback == NULL)
    {
      htmr->PWM_MspInitCallback = DAL_TMR_PWM_MspInit;
    }
    /* Init the low level hardware : GPIO, CLOCK, NVIC */
    htmr->PWM_MspInitCallback(htmr);
#else
    /* Init the low level hardware : GPIO, CLOCK, NVIC and DMA */
    DAL_TMR_PWM_MspInit(htmr);
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */
  }

  /* Set the TMR state */
  htmr->State = DAL_TMR_STATE_BUSY;

  /* Init the base time for the PWM */
  TMR_Base_SetConfig(htmr->Instance, &htmr->Init);

  /* Initialize the DMA burst operation state */
  htmr->DMABurstState = DAL_DMA_BURST_STATE_READY;

  /* Initialize the TMR channels state */
  TMR_CHANNEL_STATE_SET_ALL(htmr, DAL_TMR_CHANNEL_STATE_READY);
  TMR_CHANNEL_N_STATE_SET_ALL(htmr, DAL_TMR_CHANNEL_STATE_READY);

  /* Initialize the TMR state*/
  htmr->State = DAL_TMR_STATE_READY;

  return DAL_OK;
}

/**
  * @brief  DeInitializes the TMR peripheral
  * @param  htmr TMR PWM handle
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_PWM_DeInit(TMR_HandleTypeDef *htmr)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_INSTANCE(htmr->Instance));

  htmr->State = DAL_TMR_STATE_BUSY;

  /* Disable the TMR Peripheral Clock */
  __DAL_TMR_DISABLE(htmr);

#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
  if (htmr->PWM_MspDeInitCallback == NULL)
  {
    htmr->PWM_MspDeInitCallback = DAL_TMR_PWM_MspDeInit;
  }
  /* DeInit the low level hardware */
  htmr->PWM_MspDeInitCallback(htmr);
#else
  /* DeInit the low level hardware: GPIO, CLOCK, NVIC and DMA */
  DAL_TMR_PWM_MspDeInit(htmr);
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */

  /* Change the DMA burst operation state */
  htmr->DMABurstState = DAL_DMA_BURST_STATE_RESET;

  /* Change the TMR channels state */
  TMR_CHANNEL_STATE_SET_ALL(htmr, DAL_TMR_CHANNEL_STATE_RESET);
  TMR_CHANNEL_N_STATE_SET_ALL(htmr, DAL_TMR_CHANNEL_STATE_RESET);

  /* Change TMR state */
  htmr->State = DAL_TMR_STATE_RESET;

  /* Release Lock */
  __DAL_UNLOCK(htmr);

  return DAL_OK;
}

/**
  * @brief  Initializes the TMR PWM MSP.
  * @param  htmr TMR PWM handle
  * @retval None
  */
__weak void DAL_TMR_PWM_MspInit(TMR_HandleTypeDef *htmr)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(htmr);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_TMR_PWM_MspInit could be implemented in the user file
   */
}

/**
  * @brief  DeInitializes TMR PWM MSP.
  * @param  htmr TMR PWM handle
  * @retval None
  */
__weak void DAL_TMR_PWM_MspDeInit(TMR_HandleTypeDef *htmr)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(htmr);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_TMR_PWM_MspDeInit could be implemented in the user file
   */
}

/**
  * @brief  Starts the PWM signal generation.
  * @param  htmr TMR handle
  * @param  Channel TMR Channels to be enabled
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1 selected
  *            @arg TMR_CHANNEL_2: TMR Channel 2 selected
  *            @arg TMR_CHANNEL_3: TMR Channel 3 selected
  *            @arg TMR_CHANNEL_4: TMR Channel 4 selected
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_PWM_Start(TMR_HandleTypeDef *htmr, uint32_t Channel)
{
  uint32_t tmpsmcr;

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_CCX_INSTANCE(htmr->Instance, Channel));

  /* Check the TMR channel state */
  if (TMR_CHANNEL_STATE_GET(htmr, Channel) != DAL_TMR_CHANNEL_STATE_READY)
  {
    return DAL_ERROR;
  }

  /* Set the TMR channel state */
  TMR_CHANNEL_STATE_SET(htmr, Channel, DAL_TMR_CHANNEL_STATE_BUSY);

  /* Enable the Capture compare channel */
  TMR_CCxChannelCmd(htmr->Instance, Channel, TMR_CCx_ENABLE);

