betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_tmr.c
  if (IS_TMR_BREAK_INSTANCE(htmr->Instance) != RESET)
  {
    /* Enable the main output */
    __DAL_TMR_MOE_ENABLE(htmr);
  }

  /* Enable the Peripheral, except in trigger mode where enable is automatically done with trigger */
  if (IS_TMR_SLAVE_INSTANCE(htmr->Instance))
  {
    tmpsmcr = htmr->Instance->SMCTRL & TMR_SMCTRL_SMFSEL;
    if (!IS_TMR_SLAVEMODE_TRIGGER_ENABLED(tmpsmcr))
    {
      __DAL_TMR_ENABLE(htmr);
    }
  }
  else
  {
    __DAL_TMR_ENABLE(htmr);
  }

  /* Return function status */
  return DAL_OK;
}

/**
  * @brief  Stops the PWM signal generation.
  * @param  htmr TMR PWM handle
  * @param  Channel TMR Channels to be disabled
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1 selected
  *            @arg TMR_CHANNEL_2: TMR Channel 2 selected
  *            @arg TMR_CHANNEL_3: TMR Channel 3 selected
  *            @arg TMR_CHANNEL_4: TMR Channel 4 selected
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_PWM_Stop(TMR_HandleTypeDef *htmr, uint32_t Channel)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_CCX_INSTANCE(htmr->Instance, Channel));

  /* Disable the Capture compare channel */
  TMR_CCxChannelCmd(htmr->Instance, Channel, TMR_CCx_DISABLE);

  if (IS_TMR_BREAK_INSTANCE(htmr->Instance) != RESET)
  {
    /* Disable the Main Output */
    __DAL_TMR_MOE_DISABLE(htmr);
  }

  /* Disable the Peripheral */
  __DAL_TMR_DISABLE(htmr);

  /* Set the TMR channel state */
  TMR_CHANNEL_STATE_SET(htmr, Channel, DAL_TMR_CHANNEL_STATE_READY);

  /* Return function status */
  return DAL_OK;
}

/**
  * @brief  Starts the PWM signal generation in interrupt mode.
  * @param  htmr TMR PWM handle
  * @param  Channel TMR Channel to be enabled
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1 selected
  *            @arg TMR_CHANNEL_2: TMR Channel 2 selected
  *            @arg TMR_CHANNEL_3: TMR Channel 3 selected
  *            @arg TMR_CHANNEL_4: TMR Channel 4 selected
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_PWM_Start_IT(TMR_HandleTypeDef *htmr, uint32_t Channel)
{
  DAL_StatusTypeDef status = DAL_OK;
  uint32_t tmpsmcr;

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_CCX_INSTANCE(htmr->Instance, Channel));

  /* Check the TMR channel state */
  if (TMR_CHANNEL_STATE_GET(htmr, Channel) != DAL_TMR_CHANNEL_STATE_READY)
  {
    return DAL_ERROR;
  }

  /* Set the TMR channel state */
  TMR_CHANNEL_STATE_SET(htmr, Channel, DAL_TMR_CHANNEL_STATE_BUSY);

  switch (Channel)
  {
    case TMR_CHANNEL_1:
    {
      /* Enable the TMR Capture/Compare 1 interrupt */
      __DAL_TMR_ENABLE_IT(htmr, TMR_IT_CC1);
      break;
    }

    case TMR_CHANNEL_2:
    {
      /* Enable the TMR Capture/Compare 2 interrupt */
      __DAL_TMR_ENABLE_IT(htmr, TMR_IT_CC2);
      break;
    }

    case TMR_CHANNEL_3:
    {
      /* Enable the TMR Capture/Compare 3 interrupt */
      __DAL_TMR_ENABLE_IT(htmr, TMR_IT_CC3);
      break;
    }

    case TMR_CHANNEL_4:
    {
      /* Enable the TMR Capture/Compare 4 interrupt */
      __DAL_TMR_ENABLE_IT(htmr, TMR_IT_CC4);
      break;
    }

    default:
      status = DAL_ERROR;
      break;
  }

  if (status == DAL_OK)
  {
    /* Enable the Capture compare channel */
    TMR_CCxChannelCmd(htmr->Instance, Channel, TMR_CCx_ENABLE);

    if (IS_TMR_BREAK_INSTANCE(htmr->Instance) != RESET)
    {
      /* Enable the main output */
      __DAL_TMR_MOE_ENABLE(htmr);
    }

    /* Enable the Peripheral, except in trigger mode where enable is automatically done with trigger */
    if (IS_TMR_SLAVE_INSTANCE(htmr->Instance))
    {
      tmpsmcr = htmr->Instance->SMCTRL & TMR_SMCTRL_SMFSEL;
      if (!IS_TMR_SLAVEMODE_TRIGGER_ENABLED(tmpsmcr))
      {
        __DAL_TMR_ENABLE(htmr);
      }
    }
    else
    {
      __DAL_TMR_ENABLE(htmr);
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  Stops the PWM signal generation in interrupt mode.
  * @param  htmr TMR PWM handle
  * @param  Channel TMR Channels to be disabled
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1 selected
  *            @arg TMR_CHANNEL_2: TMR Channel 2 selected
  *            @arg TMR_CHANNEL_3: TMR Channel 3 selected
  *            @arg TMR_CHANNEL_4: TMR Channel 4 selected
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_PWM_Stop_IT(TMR_HandleTypeDef *htmr, uint32_t Channel)
{
  DAL_StatusTypeDef status = DAL_OK;

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_CCX_INSTANCE(htmr->Instance, Channel));

  switch (Channel)
  {
    case TMR_CHANNEL_1:
    {
      /* Disable the TMR Capture/Compare 1 interrupt */
      __DAL_TMR_DISABLE_IT(htmr, TMR_IT_CC1);
      break;
    }

    case TMR_CHANNEL_2:
    {
      /* Disable the TMR Capture/Compare 2 interrupt */
      __DAL_TMR_DISABLE_IT(htmr, TMR_IT_CC2);
      break;
    }

    case TMR_CHANNEL_3:
    {
      /* Disable the TMR Capture/Compare 3 interrupt */
      __DAL_TMR_DISABLE_IT(htmr, TMR_IT_CC3);
      break;
    }

    case TMR_CHANNEL_4:
    {
      /* Disable the TMR Capture/Compare 4 interrupt */
      __DAL_TMR_DISABLE_IT(htmr, TMR_IT_CC4);
      break;
    }

    default:
      status = DAL_ERROR;
      break;
  }

  if (status == DAL_OK)
  {
    /* Disable the Capture compare channel */
    TMR_CCxChannelCmd(htmr->Instance, Channel, TMR_CCx_DISABLE);

    if (IS_TMR_BREAK_INSTANCE(htmr->Instance) != RESET)
    {
      /* Disable the Main Output */
      __DAL_TMR_MOE_DISABLE(htmr);
    }

    /* Disable the Peripheral */
    __DAL_TMR_DISABLE(htmr);

    /* Set the TMR channel state */
    TMR_CHANNEL_STATE_SET(htmr, Channel, DAL_TMR_CHANNEL_STATE_READY);
  }

  /* Return function status */
  return status;
}

/**
  * @brief  Starts the TMR PWM signal generation in DMA mode.
  * @param  htmr TMR PWM handle
  * @param  Channel TMR Channels to be enabled
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1 selected
  *            @arg TMR_CHANNEL_2: TMR Channel 2 selected
  *            @arg TMR_CHANNEL_3: TMR Channel 3 selected
  *            @arg TMR_CHANNEL_4: TMR Channel 4 selected
  * @param  pData The source Buffer address.
  * @param  Length The length of data to be transferred from memory to TMR peripheral
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_PWM_Start_DMA(TMR_HandleTypeDef *htmr, uint32_t Channel, uint32_t *pData, uint16_t Length)
{
  DAL_StatusTypeDef status = DAL_OK;
  uint32_t tmpsmcr;

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_CCX_INSTANCE(htmr->Instance, Channel));

  /* Set the TMR channel state */
  if (TMR_CHANNEL_STATE_GET(htmr, Channel) == DAL_TMR_CHANNEL_STATE_BUSY)
  {
    return DAL_BUSY;
  }
  else if (TMR_CHANNEL_STATE_GET(htmr, Channel) == DAL_TMR_CHANNEL_STATE_READY)
  {
    if ((pData == NULL) || (Length == 0U))
    {
      return DAL_ERROR;
    }
    else
    {
      TMR_CHANNEL_STATE_SET(htmr, Channel, DAL_TMR_CHANNEL_STATE_BUSY);
    }
  }
  else
  {
    return DAL_ERROR;
  }

  switch (Channel)
  {
    case TMR_CHANNEL_1:
    {
      /* Set the DMA compare callbacks */
      htmr->hdma[TMR_DMA_ID_CC1]->XferCpltCallback = TMR_DMADelayPulseCplt;
      htmr->hdma[TMR_DMA_ID_CC1]->XferHalfCpltCallback = TMR_DMADelayPulseHalfCplt;

      /* Set the DMA error callback */
      htmr->hdma[TMR_DMA_ID_CC1]->XferErrorCallback = TMR_DMAError ;

      /* Enable the DMA stream */
      if (DAL_DMA_Start_IT(htmr->hdma[TMR_DMA_ID_CC1], (uint32_t)pData, (uint32_t)&htmr->Instance->CC1,
                           Length) != DAL_OK)
      {
        /* Return error status */
        return DAL_ERROR;
      }

