betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_tmr.c
  /* Disable the TMR Peripheral Clock */
  __DAL_TMR_DISABLE(htmr);

#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
  if (htmr->IC_MspDeInitCallback == NULL)
  {
    htmr->IC_MspDeInitCallback = DAL_TMR_IC_MspDeInit;
  }
  /* DeInit the low level hardware */
  htmr->IC_MspDeInitCallback(htmr);
#else
  /* DeInit the low level hardware: GPIO, CLOCK, NVIC and DMA */
  DAL_TMR_IC_MspDeInit(htmr);
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */

  /* Change the DMA burst operation state */
  htmr->DMABurstState = DAL_DMA_BURST_STATE_RESET;

  /* Change the TMR channels state */
  TMR_CHANNEL_STATE_SET_ALL(htmr, DAL_TMR_CHANNEL_STATE_RESET);
  TMR_CHANNEL_N_STATE_SET_ALL(htmr, DAL_TMR_CHANNEL_STATE_RESET);

  /* Change TMR state */
  htmr->State = DAL_TMR_STATE_RESET;

  /* Release Lock */
  __DAL_UNLOCK(htmr);

  return DAL_OK;
}

/**
  * @brief  Initializes the TMR Input Capture MSP.
  * @param  htmr TMR Input Capture handle
  * @retval None
  */
__weak void DAL_TMR_IC_MspInit(TMR_HandleTypeDef *htmr)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(htmr);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_TMR_IC_MspInit could be implemented in the user file
   */
}

/**
  * @brief  DeInitializes TMR Input Capture MSP.
  * @param  htmr TMR handle
  * @retval None
  */
__weak void DAL_TMR_IC_MspDeInit(TMR_HandleTypeDef *htmr)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(htmr);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_TMR_IC_MspDeInit could be implemented in the user file
   */
}

/**
  * @brief  Starts the TMR Input Capture measurement.
  * @param  htmr TMR Input Capture handle
  * @param  Channel TMR Channels to be enabled
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1 selected
  *            @arg TMR_CHANNEL_2: TMR Channel 2 selected
  *            @arg TMR_CHANNEL_3: TMR Channel 3 selected
  *            @arg TMR_CHANNEL_4: TMR Channel 4 selected
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_IC_Start(TMR_HandleTypeDef *htmr, uint32_t Channel)
{
  uint32_t tmpsmcr;
  DAL_TMR_ChannelStateTypeDef channel_state = TMR_CHANNEL_STATE_GET(htmr, Channel);
  DAL_TMR_ChannelStateTypeDef complementary_channel_state = TMR_CHANNEL_N_STATE_GET(htmr, Channel);

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_CCX_INSTANCE(htmr->Instance, Channel));

  /* Check the TMR channel state */
  if ((channel_state != DAL_TMR_CHANNEL_STATE_READY)
      || (complementary_channel_state != DAL_TMR_CHANNEL_STATE_READY))
  {
    return DAL_ERROR;
  }

  /* Set the TMR channel state */
  TMR_CHANNEL_STATE_SET(htmr, Channel, DAL_TMR_CHANNEL_STATE_BUSY);
  TMR_CHANNEL_N_STATE_SET(htmr, Channel, DAL_TMR_CHANNEL_STATE_BUSY);

  /* Enable the Input Capture channel */
  TMR_CCxChannelCmd(htmr->Instance, Channel, TMR_CCx_ENABLE);

  /* Enable the Peripheral, except in trigger mode where enable is automatically done with trigger */
  if (IS_TMR_SLAVE_INSTANCE(htmr->Instance))
  {
    tmpsmcr = htmr->Instance->SMCTRL & TMR_SMCTRL_SMFSEL;
    if (!IS_TMR_SLAVEMODE_TRIGGER_ENABLED(tmpsmcr))
    {
      __DAL_TMR_ENABLE(htmr);
    }
  }
  else
  {
    __DAL_TMR_ENABLE(htmr);
  }

  /* Return function status */
  return DAL_OK;
}

/**
  * @brief  Stops the TMR Input Capture measurement.
  * @param  htmr TMR Input Capture handle
  * @param  Channel TMR Channels to be disabled
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1 selected
  *            @arg TMR_CHANNEL_2: TMR Channel 2 selected
  *            @arg TMR_CHANNEL_3: TMR Channel 3 selected
  *            @arg TMR_CHANNEL_4: TMR Channel 4 selected
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_IC_Stop(TMR_HandleTypeDef *htmr, uint32_t Channel)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_CCX_INSTANCE(htmr->Instance, Channel));

  /* Disable the Input Capture channel */
  TMR_CCxChannelCmd(htmr->Instance, Channel, TMR_CCx_DISABLE);

  /* Disable the Peripheral */
  __DAL_TMR_DISABLE(htmr);

  /* Set the TMR channel state */
  TMR_CHANNEL_STATE_SET(htmr, Channel, DAL_TMR_CHANNEL_STATE_READY);
  TMR_CHANNEL_N_STATE_SET(htmr, Channel, DAL_TMR_CHANNEL_STATE_READY);

  /* Return function status */
  return DAL_OK;
}

/**
  * @brief  Starts the TMR Input Capture measurement in interrupt mode.
  * @param  htmr TMR Input Capture handle
  * @param  Channel TMR Channels to be enabled
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1 selected
  *            @arg TMR_CHANNEL_2: TMR Channel 2 selected
  *            @arg TMR_CHANNEL_3: TMR Channel 3 selected
  *            @arg TMR_CHANNEL_4: TMR Channel 4 selected
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_IC_Start_IT(TMR_HandleTypeDef *htmr, uint32_t Channel)
{
  DAL_StatusTypeDef status = DAL_OK;
  uint32_t tmpsmcr;

  DAL_TMR_ChannelStateTypeDef channel_state = TMR_CHANNEL_STATE_GET(htmr, Channel);
  DAL_TMR_ChannelStateTypeDef complementary_channel_state = TMR_CHANNEL_N_STATE_GET(htmr, Channel);

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_CCX_INSTANCE(htmr->Instance, Channel));

  /* Check the TMR channel state */
  if ((channel_state != DAL_TMR_CHANNEL_STATE_READY)
      || (complementary_channel_state != DAL_TMR_CHANNEL_STATE_READY))
  {
    return DAL_ERROR;
  }

  /* Set the TMR channel state */
  TMR_CHANNEL_STATE_SET(htmr, Channel, DAL_TMR_CHANNEL_STATE_BUSY);
  TMR_CHANNEL_N_STATE_SET(htmr, Channel, DAL_TMR_CHANNEL_STATE_BUSY);

  switch (Channel)
  {
    case TMR_CHANNEL_1:
    {
      /* Enable the TMR Capture/Compare 1 interrupt */
      __DAL_TMR_ENABLE_IT(htmr, TMR_IT_CC1);
      break;
    }

    case TMR_CHANNEL_2:
    {
      /* Enable the TMR Capture/Compare 2 interrupt */
      __DAL_TMR_ENABLE_IT(htmr, TMR_IT_CC2);
      break;
    }

    case TMR_CHANNEL_3:
    {
      /* Enable the TMR Capture/Compare 3 interrupt */
      __DAL_TMR_ENABLE_IT(htmr, TMR_IT_CC3);
      break;
    }

    case TMR_CHANNEL_4:
    {
      /* Enable the TMR Capture/Compare 4 interrupt */
      __DAL_TMR_ENABLE_IT(htmr, TMR_IT_CC4);
      break;
    }

    default:
      status = DAL_ERROR;
      break;
  }

  if (status == DAL_OK)
  {
    /* Enable the Input Capture channel */
    TMR_CCxChannelCmd(htmr->Instance, Channel, TMR_CCx_ENABLE);

    /* Enable the Peripheral, except in trigger mode where enable is automatically done with trigger */
    if (IS_TMR_SLAVE_INSTANCE(htmr->Instance))
    {
      tmpsmcr = htmr->Instance->SMCTRL & TMR_SMCTRL_SMFSEL;
      if (!IS_TMR_SLAVEMODE_TRIGGER_ENABLED(tmpsmcr))
      {
        __DAL_TMR_ENABLE(htmr);
      }
    }
    else
    {
      __DAL_TMR_ENABLE(htmr);
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  Stops the TMR Input Capture measurement in interrupt mode.
  * @param  htmr TMR Input Capture handle
  * @param  Channel TMR Channels to be disabled
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1 selected
  *            @arg TMR_CHANNEL_2: TMR Channel 2 selected
  *            @arg TMR_CHANNEL_3: TMR Channel 3 selected
  *            @arg TMR_CHANNEL_4: TMR Channel 4 selected
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_IC_Stop_IT(TMR_HandleTypeDef *htmr, uint32_t Channel)
{
  DAL_StatusTypeDef status = DAL_OK;

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_CCX_INSTANCE(htmr->Instance, Channel));

  switch (Channel)
  {
    case TMR_CHANNEL_1:
    {
      /* Disable the TMR Capture/Compare 1 interrupt */
      __DAL_TMR_DISABLE_IT(htmr, TMR_IT_CC1);
      break;
    }

