betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_tmr.c
    case TMR_CHANNEL_2:
    {
      /* Disable the TMR Capture/Compare 2 interrupt */
      __DAL_TMR_DISABLE_IT(htmr, TMR_IT_CC2);
      break;
    }

    case TMR_CHANNEL_3:
    {
      /* Disable the TMR Capture/Compare 3 interrupt */
      __DAL_TMR_DISABLE_IT(htmr, TMR_IT_CC3);
      break;
    }

    case TMR_CHANNEL_4:
    {
      /* Disable the TMR Capture/Compare 4 interrupt */
      __DAL_TMR_DISABLE_IT(htmr, TMR_IT_CC4);
      break;
    }

    default:
      status = DAL_ERROR;
      break;
  }

  if (status == DAL_OK)
  {
    /* Disable the Input Capture channel */
    TMR_CCxChannelCmd(htmr->Instance, Channel, TMR_CCx_DISABLE);

    /* Disable the Peripheral */
    __DAL_TMR_DISABLE(htmr);

    /* Set the TMR channel state */
    TMR_CHANNEL_STATE_SET(htmr, Channel, DAL_TMR_CHANNEL_STATE_READY);
    TMR_CHANNEL_N_STATE_SET(htmr, Channel, DAL_TMR_CHANNEL_STATE_READY);
  }

  /* Return function status */
  return status;
}

/**
  * @brief  Starts the TMR Input Capture measurement in DMA mode.
  * @param  htmr TMR Input Capture handle
  * @param  Channel TMR Channels to be enabled
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1 selected
  *            @arg TMR_CHANNEL_2: TMR Channel 2 selected
  *            @arg TMR_CHANNEL_3: TMR Channel 3 selected
  *            @arg TMR_CHANNEL_4: TMR Channel 4 selected
  * @param  pData The destination Buffer address.
  * @param  Length The length of data to be transferred from TMR peripheral to memory.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_IC_Start_DMA(TMR_HandleTypeDef *htmr, uint32_t Channel, uint32_t *pData, uint16_t Length)
{
  DAL_StatusTypeDef status = DAL_OK;
  uint32_t tmpsmcr;

  DAL_TMR_ChannelStateTypeDef channel_state = TMR_CHANNEL_STATE_GET(htmr, Channel);
  DAL_TMR_ChannelStateTypeDef complementary_channel_state = TMR_CHANNEL_N_STATE_GET(htmr, Channel);

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_CCX_INSTANCE(htmr->Instance, Channel));
  ASSERT_PARAM(IS_TMR_DMA_CC_INSTANCE(htmr->Instance));

  /* Set the TMR channel state */
  if ((channel_state == DAL_TMR_CHANNEL_STATE_BUSY)
      || (complementary_channel_state == DAL_TMR_CHANNEL_STATE_BUSY))
  {
    return DAL_BUSY;
  }
  else if ((channel_state == DAL_TMR_CHANNEL_STATE_READY)
           && (complementary_channel_state == DAL_TMR_CHANNEL_STATE_READY))
  {
    if ((pData == NULL) || (Length == 0U))
    {
      return DAL_ERROR;
    }
    else
    {
      TMR_CHANNEL_STATE_SET(htmr, Channel, DAL_TMR_CHANNEL_STATE_BUSY);
      TMR_CHANNEL_N_STATE_SET(htmr, Channel, DAL_TMR_CHANNEL_STATE_BUSY);
    }
  }
  else
  {
    return DAL_ERROR;
  }

  /* Enable the Input Capture channel */
  TMR_CCxChannelCmd(htmr->Instance, Channel, TMR_CCx_ENABLE);

  switch (Channel)
  {
    case TMR_CHANNEL_1:
    {
      /* Set the DMA capture callbacks */
      htmr->hdma[TMR_DMA_ID_CC1]->XferCpltCallback = TMR_DMACaptureCplt;
      htmr->hdma[TMR_DMA_ID_CC1]->XferHalfCpltCallback = TMR_DMACaptureHalfCplt;

      /* Set the DMA error callback */
      htmr->hdma[TMR_DMA_ID_CC1]->XferErrorCallback = TMR_DMAError ;

      /* Enable the DMA stream */
      if (DAL_DMA_Start_IT(htmr->hdma[TMR_DMA_ID_CC1], (uint32_t)&htmr->Instance->CC1, (uint32_t)pData,
                           Length) != DAL_OK)
      {
        /* Return error status */
        return DAL_ERROR;
      }
      /* Enable the TMR Capture/Compare 1 DMA request */
      __DAL_TMR_ENABLE_DMA(htmr, TMR_DMA_CC1);
      break;
    }

    case TMR_CHANNEL_2:
    {
      /* Set the DMA capture callbacks */
      htmr->hdma[TMR_DMA_ID_CC2]->XferCpltCallback = TMR_DMACaptureCplt;
      htmr->hdma[TMR_DMA_ID_CC2]->XferHalfCpltCallback = TMR_DMACaptureHalfCplt;

      /* Set the DMA error callback */
      htmr->hdma[TMR_DMA_ID_CC2]->XferErrorCallback = TMR_DMAError ;

      /* Enable the DMA stream */
      if (DAL_DMA_Start_IT(htmr->hdma[TMR_DMA_ID_CC2], (uint32_t)&htmr->Instance->CC2, (uint32_t)pData,
                           Length) != DAL_OK)
      {
        /* Return error status */
        return DAL_ERROR;
      }
      /* Enable the TMR Capture/Compare 2  DMA request */
      __DAL_TMR_ENABLE_DMA(htmr, TMR_DMA_CC2);
      break;
    }

    case TMR_CHANNEL_3:
    {
      /* Set the DMA capture callbacks */
      htmr->hdma[TMR_DMA_ID_CC3]->XferCpltCallback = TMR_DMACaptureCplt;
      htmr->hdma[TMR_DMA_ID_CC3]->XferHalfCpltCallback = TMR_DMACaptureHalfCplt;

      /* Set the DMA error callback */
      htmr->hdma[TMR_DMA_ID_CC3]->XferErrorCallback = TMR_DMAError ;

      /* Enable the DMA stream */
      if (DAL_DMA_Start_IT(htmr->hdma[TMR_DMA_ID_CC3], (uint32_t)&htmr->Instance->CC3, (uint32_t)pData,
                           Length) != DAL_OK)
      {
        /* Return error status */
        return DAL_ERROR;
      }
      /* Enable the TMR Capture/Compare 3  DMA request */
      __DAL_TMR_ENABLE_DMA(htmr, TMR_DMA_CC3);
      break;
    }

    case TMR_CHANNEL_4:
    {
      /* Set the DMA capture callbacks */
      htmr->hdma[TMR_DMA_ID_CC4]->XferCpltCallback = TMR_DMACaptureCplt;
      htmr->hdma[TMR_DMA_ID_CC4]->XferHalfCpltCallback = TMR_DMACaptureHalfCplt;

      /* Set the DMA error callback */
      htmr->hdma[TMR_DMA_ID_CC4]->XferErrorCallback = TMR_DMAError ;

      /* Enable the DMA stream */
      if (DAL_DMA_Start_IT(htmr->hdma[TMR_DMA_ID_CC4], (uint32_t)&htmr->Instance->CC4, (uint32_t)pData,
                           Length) != DAL_OK)
      {
        /* Return error status */
        return DAL_ERROR;
      }
      /* Enable the TMR Capture/Compare 4  DMA request */
      __DAL_TMR_ENABLE_DMA(htmr, TMR_DMA_CC4);
      break;
    }

    default:
      status = DAL_ERROR;
      break;
  }

  /* Enable the Peripheral, except in trigger mode where enable is automatically done with trigger */
  if (IS_TMR_SLAVE_INSTANCE(htmr->Instance))
  {
    tmpsmcr = htmr->Instance->SMCTRL & TMR_SMCTRL_SMFSEL;
    if (!IS_TMR_SLAVEMODE_TRIGGER_ENABLED(tmpsmcr))
    {
      __DAL_TMR_ENABLE(htmr);
    }
  }
  else
  {
    __DAL_TMR_ENABLE(htmr);
  }

  /* Return function status */
  return status;
}

/**
  * @brief  Stops the TMR Input Capture measurement in DMA mode.
  * @param  htmr TMR Input Capture handle
  * @param  Channel TMR Channels to be disabled
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1 selected
  *            @arg TMR_CHANNEL_2: TMR Channel 2 selected
  *            @arg TMR_CHANNEL_3: TMR Channel 3 selected
  *            @arg TMR_CHANNEL_4: TMR Channel 4 selected
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_IC_Stop_DMA(TMR_HandleTypeDef *htmr, uint32_t Channel)
{
  DAL_StatusTypeDef status = DAL_OK;

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_CCX_INSTANCE(htmr->Instance, Channel));
  ASSERT_PARAM(IS_TMR_DMA_CC_INSTANCE(htmr->Instance));

  /* Disable the Input Capture channel */
  TMR_CCxChannelCmd(htmr->Instance, Channel, TMR_CCx_DISABLE);

  switch (Channel)
  {
    case TMR_CHANNEL_1:
    {
      /* Disable the TMR Capture/Compare 1 DMA request */
      __DAL_TMR_DISABLE_DMA(htmr, TMR_DMA_CC1);
      (void)DAL_DMA_Abort_IT(htmr->hdma[TMR_DMA_ID_CC1]);
      break;
    }

