betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_tmr.c
    case TMR_CHANNEL_2:
    {
      /* Disable the TMR Capture/Compare 2 DMA request */
      __DAL_TMR_DISABLE_DMA(htmr, TMR_DMA_CC2);
      (void)DAL_DMA_Abort_IT(htmr->hdma[TMR_DMA_ID_CC2]);
      break;
    }

    case TMR_CHANNEL_3:
    {
      /* Disable the TMR Capture/Compare 3  DMA request */
      __DAL_TMR_DISABLE_DMA(htmr, TMR_DMA_CC3);
      (void)DAL_DMA_Abort_IT(htmr->hdma[TMR_DMA_ID_CC3]);
      break;
    }

    case TMR_CHANNEL_4:
    {
      /* Disable the TMR Capture/Compare 4  DMA request */
      __DAL_TMR_DISABLE_DMA(htmr, TMR_DMA_CC4);
      (void)DAL_DMA_Abort_IT(htmr->hdma[TMR_DMA_ID_CC4]);
      break;
    }

    default:
      status = DAL_ERROR;
      break;
  }

  if (status == DAL_OK)
  {
    /* Disable the Peripheral */
    __DAL_TMR_DISABLE(htmr);

    /* Set the TMR channel state */
    TMR_CHANNEL_STATE_SET(htmr, Channel, DAL_TMR_CHANNEL_STATE_READY);
    TMR_CHANNEL_N_STATE_SET(htmr, Channel, DAL_TMR_CHANNEL_STATE_READY);
  }

  /* Return function status */
  return status;
}
/**
  * @}
  */

/** @defgroup TMR_Exported_Functions_Group5 TMR One Pulse functions
  *  @brief    TMR One Pulse functions
  *
@verbatim
  ==============================================================================
                        ##### TMR One Pulse functions #####
  ==============================================================================
  [..]
    This section provides functions allowing to:
    (+) Initialize and configure the TMR One Pulse.
    (+) De-initialize the TMR One Pulse.
    (+) Start the TMR One Pulse.
    (+) Stop the TMR One Pulse.
    (+) Start the TMR One Pulse and enable interrupt.
    (+) Stop the TMR One Pulse and disable interrupt.
    (+) Start the TMR One Pulse and enable DMA transfer.
    (+) Stop the TMR One Pulse and disable DMA transfer.

@endverbatim
  * @{
  */
/**
  * @brief  Initializes the TMR One Pulse Time Base according to the specified
  *         parameters in the TMR_HandleTypeDef and initializes the associated handle.
  * @note   Switching from Center Aligned counter mode to Edge counter mode (or reverse)
  *         requires a timer reset to avoid unexpected direction
  *         due to DIR bit readonly in center aligned mode.
  *         Ex: call @ref DAL_TMR_OnePulse_DeInit() before DAL_TMR_OnePulse_Init()
  * @note   When the timer instance is initialized in One Pulse mode, timer
  *         channels 1 and channel 2 are reserved and cannot be used for other
  *         purpose.
  * @param  htmr TMR One Pulse handle
  * @param  OnePulseMode Select the One pulse mode.
  *         This parameter can be one of the following values:
  *            @arg TMR_OPMODE_SINGLE: Only one pulse will be generated.
  *            @arg TMR_OPMODE_REPETITIVE: Repetitive pulses will be generated.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_OnePulse_Init(TMR_HandleTypeDef *htmr, uint32_t OnePulseMode)
{
  /* Check the TMR handle allocation */
  if (htmr == NULL)
  {
    return DAL_ERROR;
  }

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_INSTANCE(htmr->Instance));
  ASSERT_PARAM(IS_TMR_COUNTER_MODE(htmr->Init.CounterMode));
  ASSERT_PARAM(IS_TMR_CLOCKDIVISION_DIV(htmr->Init.ClockDivision));
  ASSERT_PARAM(IS_TMR_OPM_MODE(OnePulseMode));
  ASSERT_PARAM(IS_TMR_PERIOD(htmr, htmr->Init.Period));
  ASSERT_PARAM(IS_TMR_AUTORELOAD_PRELOAD(htmr->Init.AutoReloadPreload));

  if (htmr->State == DAL_TMR_STATE_RESET)
  {
    /* Allocate lock resource and initialize it */
    htmr->Lock = DAL_UNLOCKED;

#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
    /* Reset interrupt callbacks to legacy weak callbacks */
    TMR_ResetCallback(htmr);

    if (htmr->OnePulse_MspInitCallback == NULL)
    {
      htmr->OnePulse_MspInitCallback = DAL_TMR_OnePulse_MspInit;
    }
    /* Init the low level hardware : GPIO, CLOCK, NVIC */
    htmr->OnePulse_MspInitCallback(htmr);
#else
    /* Init the low level hardware : GPIO, CLOCK, NVIC and DMA */
    DAL_TMR_OnePulse_MspInit(htmr);
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */
  }

  /* Set the TMR state */
  htmr->State = DAL_TMR_STATE_BUSY;

  /* Configure the Time base in the One Pulse Mode */
  TMR_Base_SetConfig(htmr->Instance, &htmr->Init);

  /* Reset the OPM Bit */
  htmr->Instance->CTRL1 &= ~TMR_CTRL1_SPMEN;

  /* Configure the OPM Mode */
  htmr->Instance->CTRL1 |= OnePulseMode;

  /* Initialize the DMA burst operation state */
  htmr->DMABurstState = DAL_DMA_BURST_STATE_READY;

  /* Initialize the TMR channels state */
  TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_READY);
  TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_READY);
  TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_READY);
  TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_READY);

  /* Initialize the TMR state*/
  htmr->State = DAL_TMR_STATE_READY;

  return DAL_OK;
}

/**
  * @brief  DeInitializes the TMR One Pulse
  * @param  htmr TMR One Pulse handle
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_OnePulse_DeInit(TMR_HandleTypeDef *htmr)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_INSTANCE(htmr->Instance));

  htmr->State = DAL_TMR_STATE_BUSY;

  /* Disable the TMR Peripheral Clock */
  __DAL_TMR_DISABLE(htmr);

#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
  if (htmr->OnePulse_MspDeInitCallback == NULL)
  {
    htmr->OnePulse_MspDeInitCallback = DAL_TMR_OnePulse_MspDeInit;
  }
  /* DeInit the low level hardware */
  htmr->OnePulse_MspDeInitCallback(htmr);
#else
  /* DeInit the low level hardware: GPIO, CLOCK, NVIC */
  DAL_TMR_OnePulse_MspDeInit(htmr);
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */

  /* Change the DMA burst operation state */
  htmr->DMABurstState = DAL_DMA_BURST_STATE_RESET;

  /* Set the TMR channel state */
  TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_RESET);
  TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_RESET);
  TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_RESET);
  TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_RESET);

  /* Change TMR state */
  htmr->State = DAL_TMR_STATE_RESET;

  /* Release Lock */
  __DAL_UNLOCK(htmr);

  return DAL_OK;
}

/**
  * @brief  Initializes the TMR One Pulse MSP.
  * @param  htmr TMR One Pulse handle
  * @retval None
  */
__weak void DAL_TMR_OnePulse_MspInit(TMR_HandleTypeDef *htmr)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(htmr);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_TMR_OnePulse_MspInit could be implemented in the user file
   */
}

/**
  * @brief  DeInitializes TMR One Pulse MSP.
  * @param  htmr TMR One Pulse handle
  * @retval None
  */
__weak void DAL_TMR_OnePulse_MspDeInit(TMR_HandleTypeDef *htmr)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(htmr);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_TMR_OnePulse_MspDeInit could be implemented in the user file
   */
}

/**
  * @brief  Starts the TMR One Pulse signal generation.
  * @note Though OutputChannel parameter is deprecated and ignored by the function
  *        it has been kept to avoid DAL_TMR API compatibility break.
  * @note The pulse output channel is determined when calling
  *       @ref DAL_TMR_OnePulse_ConfigChannel().
  * @param  htmr TMR One Pulse handle
  * @param  OutputChannel See note above
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_OnePulse_Start(TMR_HandleTypeDef *htmr, uint32_t OutputChannel)
{
  DAL_TMR_ChannelStateTypeDef channel_1_state = TMR_CHANNEL_STATE_GET(htmr, TMR_CHANNEL_1);
  DAL_TMR_ChannelStateTypeDef channel_2_state = TMR_CHANNEL_STATE_GET(htmr, TMR_CHANNEL_2);
  DAL_TMR_ChannelStateTypeDef complementary_channel_1_state = TMR_CHANNEL_N_STATE_GET(htmr, TMR_CHANNEL_1);
  DAL_TMR_ChannelStateTypeDef complementary_channel_2_state = TMR_CHANNEL_N_STATE_GET(htmr, TMR_CHANNEL_2);

