betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_tmr.c
  /* Prevent unused argument(s) compilation warning */
  UNUSED(OutputChannel);

  /* Check the TMR channels state */
  if ((channel_1_state != DAL_TMR_CHANNEL_STATE_READY)
      || (channel_2_state != DAL_TMR_CHANNEL_STATE_READY)
      || (complementary_channel_1_state != DAL_TMR_CHANNEL_STATE_READY)
      || (complementary_channel_2_state != DAL_TMR_CHANNEL_STATE_READY))
  {
    return DAL_ERROR;
  }

  /* Set the TMR channels state */
  TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_BUSY);
  TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_BUSY);
  TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_BUSY);
  TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_BUSY);

  /* Enable the Capture compare and the Input Capture channels
    (in the OPM Mode the two possible channels that can be used are TMR_CHANNEL_1 and TMR_CHANNEL_2)
    if TMR_CHANNEL_1 is used as output, the TMR_CHANNEL_2 will be used as input and
    if TMR_CHANNEL_1 is used as input, the TMR_CHANNEL_2 will be used as output
    whatever the combination, the TMR_CHANNEL_1 and TMR_CHANNEL_2 should be enabled together

    No need to enable the counter, it's enabled automatically by hardware
    (the counter starts in response to a stimulus and generate a pulse */

  TMR_CCxChannelCmd(htmr->Instance, TMR_CHANNEL_1, TMR_CCx_ENABLE);
  TMR_CCxChannelCmd(htmr->Instance, TMR_CHANNEL_2, TMR_CCx_ENABLE);

  if (IS_TMR_BREAK_INSTANCE(htmr->Instance) != RESET)
  {
    /* Enable the main output */
    __DAL_TMR_MOE_ENABLE(htmr);
  }

  /* Return function status */
  return DAL_OK;
}

/**
  * @brief  Stops the TMR One Pulse signal generation.
  * @note Though OutputChannel parameter is deprecated and ignored by the function
  *        it has been kept to avoid DAL_TMR API compatibility break.
  * @note The pulse output channel is determined when calling
  *       @ref DAL_TMR_OnePulse_ConfigChannel().
  * @param  htmr TMR One Pulse handle
  * @param  OutputChannel See note above
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_OnePulse_Stop(TMR_HandleTypeDef *htmr, uint32_t OutputChannel)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(OutputChannel);

  /* Disable the Capture compare and the Input Capture channels
  (in the OPM Mode the two possible channels that can be used are TMR_CHANNEL_1 and TMR_CHANNEL_2)
  if TMR_CHANNEL_1 is used as output, the TMR_CHANNEL_2 will be used as input and
  if TMR_CHANNEL_1 is used as input, the TMR_CHANNEL_2 will be used as output
  whatever the combination, the TMR_CHANNEL_1 and TMR_CHANNEL_2 should be disabled together */

  TMR_CCxChannelCmd(htmr->Instance, TMR_CHANNEL_1, TMR_CCx_DISABLE);
  TMR_CCxChannelCmd(htmr->Instance, TMR_CHANNEL_2, TMR_CCx_DISABLE);

  if (IS_TMR_BREAK_INSTANCE(htmr->Instance) != RESET)
  {
    /* Disable the Main Output */
    __DAL_TMR_MOE_DISABLE(htmr);
  }

  /* Disable the Peripheral */
  __DAL_TMR_DISABLE(htmr);

  /* Set the TMR channels state */
  TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_READY);
  TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_READY);
  TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_READY);
  TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_READY);

  /* Return function status */
  return DAL_OK;
}

/**
  * @brief  Starts the TMR One Pulse signal generation in interrupt mode.
  * @note Though OutputChannel parameter is deprecated and ignored by the function
  *        it has been kept to avoid DAL_TMR API compatibility break.
  * @note The pulse output channel is determined when calling
  *       @ref DAL_TMR_OnePulse_ConfigChannel().
  * @param  htmr TMR One Pulse handle
  * @param  OutputChannel See note above
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_OnePulse_Start_IT(TMR_HandleTypeDef *htmr, uint32_t OutputChannel)
{
  DAL_TMR_ChannelStateTypeDef channel_1_state = TMR_CHANNEL_STATE_GET(htmr, TMR_CHANNEL_1);
  DAL_TMR_ChannelStateTypeDef channel_2_state = TMR_CHANNEL_STATE_GET(htmr, TMR_CHANNEL_2);
  DAL_TMR_ChannelStateTypeDef complementary_channel_1_state = TMR_CHANNEL_N_STATE_GET(htmr, TMR_CHANNEL_1);
  DAL_TMR_ChannelStateTypeDef complementary_channel_2_state = TMR_CHANNEL_N_STATE_GET(htmr, TMR_CHANNEL_2);

  /* Prevent unused argument(s) compilation warning */
  UNUSED(OutputChannel);

  /* Check the TMR channels state */
  if ((channel_1_state != DAL_TMR_CHANNEL_STATE_READY)
      || (channel_2_state != DAL_TMR_CHANNEL_STATE_READY)
      || (complementary_channel_1_state != DAL_TMR_CHANNEL_STATE_READY)
      || (complementary_channel_2_state != DAL_TMR_CHANNEL_STATE_READY))
  {
    return DAL_ERROR;
  }

  /* Set the TMR channels state */
  TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_BUSY);
  TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_BUSY);
  TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_BUSY);
  TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_BUSY);

  /* Enable the Capture compare and the Input Capture channels
    (in the OPM Mode the two possible channels that can be used are TMR_CHANNEL_1 and TMR_CHANNEL_2)
    if TMR_CHANNEL_1 is used as output, the TMR_CHANNEL_2 will be used as input and
    if TMR_CHANNEL_1 is used as input, the TMR_CHANNEL_2 will be used as output
    whatever the combination, the TMR_CHANNEL_1 and TMR_CHANNEL_2 should be enabled together

    No need to enable the counter, it's enabled automatically by hardware
    (the counter starts in response to a stimulus and generate a pulse */

  /* Enable the TMR Capture/Compare 1 interrupt */
  __DAL_TMR_ENABLE_IT(htmr, TMR_IT_CC1);

  /* Enable the TMR Capture/Compare 2 interrupt */
  __DAL_TMR_ENABLE_IT(htmr, TMR_IT_CC2);

  TMR_CCxChannelCmd(htmr->Instance, TMR_CHANNEL_1, TMR_CCx_ENABLE);
  TMR_CCxChannelCmd(htmr->Instance, TMR_CHANNEL_2, TMR_CCx_ENABLE);

  if (IS_TMR_BREAK_INSTANCE(htmr->Instance) != RESET)
  {
    /* Enable the main output */
    __DAL_TMR_MOE_ENABLE(htmr);
  }

  /* Return function status */
  return DAL_OK;
}

/**
  * @brief  Stops the TMR One Pulse signal generation in interrupt mode.
  * @note Though OutputChannel parameter is deprecated and ignored by the function
  *        it has been kept to avoid DAL_TMR API compatibility break.
  * @note The pulse output channel is determined when calling
  *       @ref DAL_TMR_OnePulse_ConfigChannel().
  * @param  htmr TMR One Pulse handle
  * @param  OutputChannel See note above
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_OnePulse_Stop_IT(TMR_HandleTypeDef *htmr, uint32_t OutputChannel)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(OutputChannel);

  /* Disable the TMR Capture/Compare 1 interrupt */
  __DAL_TMR_DISABLE_IT(htmr, TMR_IT_CC1);

  /* Disable the TMR Capture/Compare 2 interrupt */
  __DAL_TMR_DISABLE_IT(htmr, TMR_IT_CC2);

  /* Disable the Capture compare and the Input Capture channels
  (in the OPM Mode the two possible channels that can be used are TMR_CHANNEL_1 and TMR_CHANNEL_2)
  if TMR_CHANNEL_1 is used as output, the TMR_CHANNEL_2 will be used as input and
  if TMR_CHANNEL_1 is used as input, the TMR_CHANNEL_2 will be used as output
  whatever the combination, the TMR_CHANNEL_1 and TMR_CHANNEL_2 should be disabled together */
  TMR_CCxChannelCmd(htmr->Instance, TMR_CHANNEL_1, TMR_CCx_DISABLE);
  TMR_CCxChannelCmd(htmr->Instance, TMR_CHANNEL_2, TMR_CCx_DISABLE);

