betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_tmr.c
  if (IS_TMR_BREAK_INSTANCE(htmr->Instance) != RESET)
  {
    /* Disable the Main Output */
    __DAL_TMR_MOE_DISABLE(htmr);
  }

  /* Disable the Peripheral */
  __DAL_TMR_DISABLE(htmr);

  /* Set the TMR channels state */
  TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_READY);
  TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_READY);
  TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_READY);
  TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_READY);

  /* Return function status */
  return DAL_OK;
}

/**
  * @}
  */

/** @defgroup TMR_Exported_Functions_Group6 TMR Encoder functions
  *  @brief    TMR Encoder functions
  *
@verbatim
  ==============================================================================
                          ##### TMR Encoder functions #####
  ==============================================================================
  [..]
    This section provides functions allowing to:
    (+) Initialize and configure the TMR Encoder.
    (+) De-initialize the TMR Encoder.
    (+) Start the TMR Encoder.
    (+) Stop the TMR Encoder.
    (+) Start the TMR Encoder and enable interrupt.
    (+) Stop the TMR Encoder and disable interrupt.
    (+) Start the TMR Encoder and enable DMA transfer.
    (+) Stop the TMR Encoder and disable DMA transfer.

@endverbatim
  * @{
  */
/**
  * @brief  Initializes the TMR Encoder Interface and initialize the associated handle.
  * @note   Switching from Center Aligned counter mode to Edge counter mode (or reverse)
  *         requires a timer reset to avoid unexpected direction
  *         due to DIR bit readonly in center aligned mode.
  *         Ex: call @ref DAL_TMR_Encoder_DeInit() before DAL_TMR_Encoder_Init()
  * @note   Encoder mode and External clock mode 2 are not compatible and must not be selected together
  *         Ex: A call for @ref DAL_TMR_Encoder_Init will erase the settings of @ref DAL_TMR_ConfigClockSource
  *         using TMR_CLOCKSOURCE_ETRMODE2 and vice versa
  * @note   When the timer instance is initialized in Encoder mode, timer
  *         channels 1 and channel 2 are reserved and cannot be used for other
  *         purpose.
  * @param  htmr TMR Encoder Interface handle
  * @param  sConfig TMR Encoder Interface configuration structure
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_Encoder_Init(TMR_HandleTypeDef *htmr,  TMR_Encoder_InitTypeDef *sConfig)
{
  uint32_t tmpsmcr;
  uint32_t tmpccmr1;
  uint32_t tmpccer;

  /* Check the TMR handle allocation */
  if (htmr == NULL)
  {
    return DAL_ERROR;
  }

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_ENCODER_INTERFACE_INSTANCE(htmr->Instance));
  ASSERT_PARAM(IS_TMR_COUNTER_MODE(htmr->Init.CounterMode));
  ASSERT_PARAM(IS_TMR_CLOCKDIVISION_DIV(htmr->Init.ClockDivision));
  ASSERT_PARAM(IS_TMR_AUTORELOAD_PRELOAD(htmr->Init.AutoReloadPreload));
  ASSERT_PARAM(IS_TMR_ENCODER_MODE(sConfig->EncoderMode));
  ASSERT_PARAM(IS_TMR_IC_SELECTION(sConfig->IC1Selection));
  ASSERT_PARAM(IS_TMR_IC_SELECTION(sConfig->IC2Selection));
  ASSERT_PARAM(IS_TMR_ENCODERINPUT_POLARITY(sConfig->IC1Polarity));
  ASSERT_PARAM(IS_TMR_ENCODERINPUT_POLARITY(sConfig->IC2Polarity));
  ASSERT_PARAM(IS_TMR_IC_PRESCALER(sConfig->IC1Prescaler));
  ASSERT_PARAM(IS_TMR_IC_PRESCALER(sConfig->IC2Prescaler));
  ASSERT_PARAM(IS_TMR_IC_FILTER(sConfig->IC1Filter));
  ASSERT_PARAM(IS_TMR_IC_FILTER(sConfig->IC2Filter));
  ASSERT_PARAM(IS_TMR_PERIOD(htmr, htmr->Init.Period));

  if (htmr->State == DAL_TMR_STATE_RESET)
  {
    /* Allocate lock resource and initialize it */
    htmr->Lock = DAL_UNLOCKED;

#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
    /* Reset interrupt callbacks to legacy weak callbacks */
    TMR_ResetCallback(htmr);

    if (htmr->Encoder_MspInitCallback == NULL)
    {
      htmr->Encoder_MspInitCallback = DAL_TMR_Encoder_MspInit;
    }
    /* Init the low level hardware : GPIO, CLOCK, NVIC */
    htmr->Encoder_MspInitCallback(htmr);
#else
    /* Init the low level hardware : GPIO, CLOCK, NVIC and DMA */
    DAL_TMR_Encoder_MspInit(htmr);
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */
  }

  /* Set the TMR state */
  htmr->State = DAL_TMR_STATE_BUSY;

  /* Reset the SMFSEL and ECEN bits */
  htmr->Instance->SMCTRL &= ~(TMR_SMCTRL_SMFSEL | TMR_SMCTRL_ECEN);

  /* Configure the Time base in the Encoder Mode */
  TMR_Base_SetConfig(htmr->Instance, &htmr->Init);

  /* Get the TMRx SMCTRL register value */
  tmpsmcr = htmr->Instance->SMCTRL;

  /* Get the TMRx CCM1 register value */
  tmpccmr1 = htmr->Instance->CCM1;

  /* Get the TMRx CCEN register value */
  tmpccer = htmr->Instance->CCEN;

  /* Set the encoder Mode */
  tmpsmcr |= sConfig->EncoderMode;

  /* Select the Capture Compare 1 and the Capture Compare 2 as input */
  tmpccmr1 &= ~(TMR_CCM1_CC1SEL | TMR_CCM1_CC2SEL);
  tmpccmr1 |= (sConfig->IC1Selection | (sConfig->IC2Selection << 8U));

  /* Set the Capture Compare 1 and the Capture Compare 2 prescalers and filters */
  tmpccmr1 &= ~(TMR_CCM1_IC1PSC | TMR_CCM1_IC2PSC);
  tmpccmr1 &= ~(TMR_CCM1_IC1F | TMR_CCM1_IC2F);
  tmpccmr1 |= sConfig->IC1Prescaler | (sConfig->IC2Prescaler << 8U);
  tmpccmr1 |= (sConfig->IC1Filter << 4U) | (sConfig->IC2Filter << 12U);

  /* Set the TI1 and the TI2 Polarities */
  tmpccer &= ~(TMR_CCEN_CC1POL | TMR_CCEN_CC2POL);
  tmpccer &= ~(TMR_CCEN_CC1NPOL | TMR_CCEN_CC2NPOL);
  tmpccer |= sConfig->IC1Polarity | (sConfig->IC2Polarity << 4U);

  /* Write to TMRx SMCTRL */
  htmr->Instance->SMCTRL = tmpsmcr;

  /* Write to TMRx CCM1 */
  htmr->Instance->CCM1 = tmpccmr1;

  /* Write to TMRx CCEN */
  htmr->Instance->CCEN = tmpccer;

  /* Initialize the DMA burst operation state */
  htmr->DMABurstState = DAL_DMA_BURST_STATE_READY;

  /* Set the TMR channels state */
  TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_READY);
  TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_READY);
  TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_READY);
  TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_READY);

  /* Initialize the TMR state*/
  htmr->State = DAL_TMR_STATE_READY;

  return DAL_OK;
}


/**
  * @brief  DeInitializes the TMR Encoder interface
  * @param  htmr TMR Encoder Interface handle
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_Encoder_DeInit(TMR_HandleTypeDef *htmr)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_INSTANCE(htmr->Instance));

  htmr->State = DAL_TMR_STATE_BUSY;

