betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_tmr.c
  /* Disable the TMR Peripheral Clock */
  __DAL_TMR_DISABLE(htmr);

#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
  if (htmr->Encoder_MspDeInitCallback == NULL)
  {
    htmr->Encoder_MspDeInitCallback = DAL_TMR_Encoder_MspDeInit;
  }
  /* DeInit the low level hardware */
  htmr->Encoder_MspDeInitCallback(htmr);
#else
  /* DeInit the low level hardware: GPIO, CLOCK, NVIC */
  DAL_TMR_Encoder_MspDeInit(htmr);
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */

  /* Change the DMA burst operation state */
  htmr->DMABurstState = DAL_DMA_BURST_STATE_RESET;

  /* Set the TMR channels state */
  TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_RESET);
  TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_RESET);
  TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_RESET);
  TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_RESET);

  /* Change TMR state */
  htmr->State = DAL_TMR_STATE_RESET;

  /* Release Lock */
  __DAL_UNLOCK(htmr);

  return DAL_OK;
}

/**
  * @brief  Initializes the TMR Encoder Interface MSP.
  * @param  htmr TMR Encoder Interface handle
  * @retval None
  */
__weak void DAL_TMR_Encoder_MspInit(TMR_HandleTypeDef *htmr)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(htmr);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_TMR_Encoder_MspInit could be implemented in the user file
   */
}

/**
  * @brief  DeInitializes TMR Encoder Interface MSP.
  * @param  htmr TMR Encoder Interface handle
  * @retval None
  */
__weak void DAL_TMR_Encoder_MspDeInit(TMR_HandleTypeDef *htmr)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(htmr);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_TMR_Encoder_MspDeInit could be implemented in the user file
   */
}

/**
  * @brief  Starts the TMR Encoder Interface.
  * @param  htmr TMR Encoder Interface handle
  * @param  Channel TMR Channels to be enabled
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1 selected
  *            @arg TMR_CHANNEL_2: TMR Channel 2 selected
  *            @arg TMR_CHANNEL_ALL: TMR Channel 1 and TMR Channel 2 are selected
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_Encoder_Start(TMR_HandleTypeDef *htmr, uint32_t Channel)
{
  DAL_TMR_ChannelStateTypeDef channel_1_state = TMR_CHANNEL_STATE_GET(htmr, TMR_CHANNEL_1);
  DAL_TMR_ChannelStateTypeDef channel_2_state = TMR_CHANNEL_STATE_GET(htmr, TMR_CHANNEL_2);
  DAL_TMR_ChannelStateTypeDef complementary_channel_1_state = TMR_CHANNEL_N_STATE_GET(htmr, TMR_CHANNEL_1);
  DAL_TMR_ChannelStateTypeDef complementary_channel_2_state = TMR_CHANNEL_N_STATE_GET(htmr, TMR_CHANNEL_2);

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_ENCODER_INTERFACE_INSTANCE(htmr->Instance));

  /* Set the TMR channel(s) state */
  if (Channel == TMR_CHANNEL_1)
  {
    if ((channel_1_state != DAL_TMR_CHANNEL_STATE_READY)
        || (complementary_channel_1_state != DAL_TMR_CHANNEL_STATE_READY))
    {
      return DAL_ERROR;
    }
    else
    {
      TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_BUSY);
      TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_BUSY);
    }
  }
  else if (Channel == TMR_CHANNEL_2)
  {
    if ((channel_2_state != DAL_TMR_CHANNEL_STATE_READY)
        || (complementary_channel_2_state != DAL_TMR_CHANNEL_STATE_READY))
    {
      return DAL_ERROR;
    }
    else
    {
      TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_BUSY);
      TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_BUSY);
    }
  }
  else
  {
    if ((channel_1_state != DAL_TMR_CHANNEL_STATE_READY)
        || (channel_2_state != DAL_TMR_CHANNEL_STATE_READY)
        || (complementary_channel_1_state != DAL_TMR_CHANNEL_STATE_READY)
        || (complementary_channel_2_state != DAL_TMR_CHANNEL_STATE_READY))
    {
      return DAL_ERROR;
    }
    else
    {
      TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_BUSY);
      TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_BUSY);
      TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_BUSY);
      TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_BUSY);
    }
  }

  /* Enable the encoder interface channels */
  switch (Channel)
  {
    case TMR_CHANNEL_1:
    {
      TMR_CCxChannelCmd(htmr->Instance, TMR_CHANNEL_1, TMR_CCx_ENABLE);
      break;
    }

    case TMR_CHANNEL_2:
    {
      TMR_CCxChannelCmd(htmr->Instance, TMR_CHANNEL_2, TMR_CCx_ENABLE);
      break;
    }

    default :
    {
      TMR_CCxChannelCmd(htmr->Instance, TMR_CHANNEL_1, TMR_CCx_ENABLE);
      TMR_CCxChannelCmd(htmr->Instance, TMR_CHANNEL_2, TMR_CCx_ENABLE);
      break;
    }
  }
  /* Enable the Peripheral */
  __DAL_TMR_ENABLE(htmr);

  /* Return function status */
  return DAL_OK;
}

/**
  * @brief  Stops the TMR Encoder Interface.
  * @param  htmr TMR Encoder Interface handle
  * @param  Channel TMR Channels to be disabled
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1 selected
  *            @arg TMR_CHANNEL_2: TMR Channel 2 selected
  *            @arg TMR_CHANNEL_ALL: TMR Channel 1 and TMR Channel 2 are selected
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_Encoder_Stop(TMR_HandleTypeDef *htmr, uint32_t Channel)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_ENCODER_INTERFACE_INSTANCE(htmr->Instance));

  /* Disable the Input Capture channels 1 and 2
    (in the EncoderInterface the two possible channels that can be used are TMR_CHANNEL_1 and TMR_CHANNEL_2) */
  switch (Channel)
  {
    case TMR_CHANNEL_1:
    {
      TMR_CCxChannelCmd(htmr->Instance, TMR_CHANNEL_1, TMR_CCx_DISABLE);
      break;
    }

    case TMR_CHANNEL_2:
    {
      TMR_CCxChannelCmd(htmr->Instance, TMR_CHANNEL_2, TMR_CCx_DISABLE);
      break;
    }

    default :
    {
      TMR_CCxChannelCmd(htmr->Instance, TMR_CHANNEL_1, TMR_CCx_DISABLE);
      TMR_CCxChannelCmd(htmr->Instance, TMR_CHANNEL_2, TMR_CCx_DISABLE);
      break;
    }
  }

  /* Disable the Peripheral */
  __DAL_TMR_DISABLE(htmr);

  /* Set the TMR channel(s) state */
  if ((Channel == TMR_CHANNEL_1) || (Channel == TMR_CHANNEL_2))
  {
    TMR_CHANNEL_STATE_SET(htmr, Channel, DAL_TMR_CHANNEL_STATE_READY);
    TMR_CHANNEL_N_STATE_SET(htmr, Channel, DAL_TMR_CHANNEL_STATE_READY);
  }
  else
  {
    TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_READY);
    TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_READY);
    TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_READY);
    TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_READY);
  }

  /* Return function status */
  return DAL_OK;
}

/**
  * @brief  Starts the TMR Encoder Interface in interrupt mode.
  * @param  htmr TMR Encoder Interface handle
  * @param  Channel TMR Channels to be enabled
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1 selected
  *            @arg TMR_CHANNEL_2: TMR Channel 2 selected
  *            @arg TMR_CHANNEL_ALL: TMR Channel 1 and TMR Channel 2 are selected
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_Encoder_Start_IT(TMR_HandleTypeDef *htmr, uint32_t Channel)
{
  DAL_TMR_ChannelStateTypeDef channel_1_state = TMR_CHANNEL_STATE_GET(htmr, TMR_CHANNEL_1);
  DAL_TMR_ChannelStateTypeDef channel_2_state = TMR_CHANNEL_STATE_GET(htmr, TMR_CHANNEL_2);
  DAL_TMR_ChannelStateTypeDef complementary_channel_1_state = TMR_CHANNEL_N_STATE_GET(htmr, TMR_CHANNEL_1);
  DAL_TMR_ChannelStateTypeDef complementary_channel_2_state = TMR_CHANNEL_N_STATE_GET(htmr, TMR_CHANNEL_2);

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_ENCODER_INTERFACE_INSTANCE(htmr->Instance));

  /* Set the TMR channel(s) state */
  if (Channel == TMR_CHANNEL_1)
  {
    if ((channel_1_state != DAL_TMR_CHANNEL_STATE_READY)
        || (complementary_channel_1_state != DAL_TMR_CHANNEL_STATE_READY))
    {
      return DAL_ERROR;
    }
    else
    {
      TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_BUSY);
      TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_BUSY);
    }
  }
  else if (Channel == TMR_CHANNEL_2)
  {
    if ((channel_2_state != DAL_TMR_CHANNEL_STATE_READY)
        || (complementary_channel_2_state != DAL_TMR_CHANNEL_STATE_READY))
    {
      return DAL_ERROR;
    }
    else
    {
      TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_BUSY);
      TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_BUSY);
    }
  }
  else
  {
    if ((channel_1_state != DAL_TMR_CHANNEL_STATE_READY)
        || (channel_2_state != DAL_TMR_CHANNEL_STATE_READY)
        || (complementary_channel_1_state != DAL_TMR_CHANNEL_STATE_READY)
        || (complementary_channel_2_state != DAL_TMR_CHANNEL_STATE_READY))
    {
      return DAL_ERROR;
    }
    else
    {
      TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_BUSY);
      TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_BUSY);
      TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_BUSY);
      TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_BUSY);
    }
  }

  /* Enable the encoder interface channels */
  /* Enable the capture compare Interrupts 1 and/or 2 */
  switch (Channel)
  {
    case TMR_CHANNEL_1:
    {
      TMR_CCxChannelCmd(htmr->Instance, TMR_CHANNEL_1, TMR_CCx_ENABLE);
      __DAL_TMR_ENABLE_IT(htmr, TMR_IT_CC1);
      break;
    }

