betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_tmr.c
    case TMR_CHANNEL_2:
    {
      TMR_CCxChannelCmd(htmr->Instance, TMR_CHANNEL_2, TMR_CCx_ENABLE);
      __DAL_TMR_ENABLE_IT(htmr, TMR_IT_CC2);
      break;
    }

    default :
    {
      TMR_CCxChannelCmd(htmr->Instance, TMR_CHANNEL_1, TMR_CCx_ENABLE);
      TMR_CCxChannelCmd(htmr->Instance, TMR_CHANNEL_2, TMR_CCx_ENABLE);
      __DAL_TMR_ENABLE_IT(htmr, TMR_IT_CC1);
      __DAL_TMR_ENABLE_IT(htmr, TMR_IT_CC2);
      break;
    }
  }

  /* Enable the Peripheral */
  __DAL_TMR_ENABLE(htmr);

  /* Return function status */
  return DAL_OK;
}

/**
  * @brief  Stops the TMR Encoder Interface in interrupt mode.
  * @param  htmr TMR Encoder Interface handle
  * @param  Channel TMR Channels to be disabled
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1 selected
  *            @arg TMR_CHANNEL_2: TMR Channel 2 selected
  *            @arg TMR_CHANNEL_ALL: TMR Channel 1 and TMR Channel 2 are selected
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_Encoder_Stop_IT(TMR_HandleTypeDef *htmr, uint32_t Channel)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_ENCODER_INTERFACE_INSTANCE(htmr->Instance));

  /* Disable the Input Capture channels 1 and 2
    (in the EncoderInterface the two possible channels that can be used are TMR_CHANNEL_1 and TMR_CHANNEL_2) */
  if (Channel == TMR_CHANNEL_1)
  {
    TMR_CCxChannelCmd(htmr->Instance, TMR_CHANNEL_1, TMR_CCx_DISABLE);

    /* Disable the capture compare Interrupts 1 */
    __DAL_TMR_DISABLE_IT(htmr, TMR_IT_CC1);
  }
  else if (Channel == TMR_CHANNEL_2)
  {
    TMR_CCxChannelCmd(htmr->Instance, TMR_CHANNEL_2, TMR_CCx_DISABLE);

    /* Disable the capture compare Interrupts 2 */
    __DAL_TMR_DISABLE_IT(htmr, TMR_IT_CC2);
  }
  else
  {
    TMR_CCxChannelCmd(htmr->Instance, TMR_CHANNEL_1, TMR_CCx_DISABLE);
    TMR_CCxChannelCmd(htmr->Instance, TMR_CHANNEL_2, TMR_CCx_DISABLE);

    /* Disable the capture compare Interrupts 1 and 2 */
    __DAL_TMR_DISABLE_IT(htmr, TMR_IT_CC1);
    __DAL_TMR_DISABLE_IT(htmr, TMR_IT_CC2);
  }

  /* Disable the Peripheral */
  __DAL_TMR_DISABLE(htmr);

  /* Set the TMR channel(s) state */
  if ((Channel == TMR_CHANNEL_1) || (Channel == TMR_CHANNEL_2))
  {
    TMR_CHANNEL_STATE_SET(htmr, Channel, DAL_TMR_CHANNEL_STATE_READY);
    TMR_CHANNEL_N_STATE_SET(htmr, Channel, DAL_TMR_CHANNEL_STATE_READY);
  }
  else
  {
    TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_READY);
    TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_READY);
    TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_READY);
    TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_READY);
  }

  /* Return function status */
  return DAL_OK;
}

/**
  * @brief  Starts the TMR Encoder Interface in DMA mode.
  * @param  htmr TMR Encoder Interface handle
  * @param  Channel TMR Channels to be enabled
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1 selected
  *            @arg TMR_CHANNEL_2: TMR Channel 2 selected
  *            @arg TMR_CHANNEL_ALL: TMR Channel 1 and TMR Channel 2 are selected
  * @param  pData1 The destination Buffer address for IC1.
  * @param  pData2 The destination Buffer address for IC2.
  * @param  Length The length of data to be transferred from TMR peripheral to memory.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_Encoder_Start_DMA(TMR_HandleTypeDef *htmr, uint32_t Channel, uint32_t *pData1,
                                            uint32_t *pData2, uint16_t Length)
{
  DAL_TMR_ChannelStateTypeDef channel_1_state = TMR_CHANNEL_STATE_GET(htmr, TMR_CHANNEL_1);
  DAL_TMR_ChannelStateTypeDef channel_2_state = TMR_CHANNEL_STATE_GET(htmr, TMR_CHANNEL_2);
  DAL_TMR_ChannelStateTypeDef complementary_channel_1_state = TMR_CHANNEL_N_STATE_GET(htmr, TMR_CHANNEL_1);
  DAL_TMR_ChannelStateTypeDef complementary_channel_2_state = TMR_CHANNEL_N_STATE_GET(htmr, TMR_CHANNEL_2);

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_ENCODER_INTERFACE_INSTANCE(htmr->Instance));

  /* Set the TMR channel(s) state */
  if (Channel == TMR_CHANNEL_1)
  {
    if ((channel_1_state == DAL_TMR_CHANNEL_STATE_BUSY)
        || (complementary_channel_1_state == DAL_TMR_CHANNEL_STATE_BUSY))
    {
      return DAL_BUSY;
    }
    else if ((channel_1_state == DAL_TMR_CHANNEL_STATE_READY)
             && (complementary_channel_1_state == DAL_TMR_CHANNEL_STATE_READY))
    {
      if ((pData1 == NULL) || (Length == 0U))
      {
        return DAL_ERROR;
      }
      else
      {
        TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_BUSY);
        TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_BUSY);
      }
    }
    else
    {
      return DAL_ERROR;
    }
  }
  else if (Channel == TMR_CHANNEL_2)
  {
    if ((channel_2_state == DAL_TMR_CHANNEL_STATE_BUSY)
        || (complementary_channel_2_state == DAL_TMR_CHANNEL_STATE_BUSY))
    {
      return DAL_BUSY;
    }
    else if ((channel_2_state == DAL_TMR_CHANNEL_STATE_READY)
             && (complementary_channel_2_state == DAL_TMR_CHANNEL_STATE_READY))
    {
      if ((pData2 == NULL) || (Length == 0U))
      {
        return DAL_ERROR;
      }
      else
      {
        TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_BUSY);
        TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_BUSY);
      }
    }
    else
    {
      return DAL_ERROR;
    }
  }
  else
  {
    if ((channel_1_state == DAL_TMR_CHANNEL_STATE_BUSY)
        || (channel_2_state == DAL_TMR_CHANNEL_STATE_BUSY)
        || (complementary_channel_1_state == DAL_TMR_CHANNEL_STATE_BUSY)
        || (complementary_channel_2_state == DAL_TMR_CHANNEL_STATE_BUSY))
    {
      return DAL_BUSY;
    }
    else if ((channel_1_state == DAL_TMR_CHANNEL_STATE_READY)
             && (channel_2_state == DAL_TMR_CHANNEL_STATE_READY)
             && (complementary_channel_1_state == DAL_TMR_CHANNEL_STATE_READY)
             && (complementary_channel_2_state == DAL_TMR_CHANNEL_STATE_READY))
    {
      if ((((pData1 == NULL) || (pData2 == NULL))) || (Length == 0U))
      {
        return DAL_ERROR;
      }
      else
      {
        TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_BUSY);
        TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_BUSY);
        TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_BUSY);
        TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_BUSY);
      }
    }
    else
    {
      return DAL_ERROR;
    }
  }

  switch (Channel)
  {
    case TMR_CHANNEL_1:
    {
      /* Set the DMA capture callbacks */
      htmr->hdma[TMR_DMA_ID_CC1]->XferCpltCallback = TMR_DMACaptureCplt;
      htmr->hdma[TMR_DMA_ID_CC1]->XferHalfCpltCallback = TMR_DMACaptureHalfCplt;

      /* Set the DMA error callback */
      htmr->hdma[TMR_DMA_ID_CC1]->XferErrorCallback = TMR_DMAError ;

      /* Enable the DMA stream */
      if (DAL_DMA_Start_IT(htmr->hdma[TMR_DMA_ID_CC1], (uint32_t)&htmr->Instance->CC1, (uint32_t)pData1,
                           Length) != DAL_OK)
      {
        /* Return error status */
        return DAL_ERROR;
      }
      /* Enable the TMR Input Capture DMA request */
      __DAL_TMR_ENABLE_DMA(htmr, TMR_DMA_CC1);

      /* Enable the Capture compare channel */
      TMR_CCxChannelCmd(htmr->Instance, TMR_CHANNEL_1, TMR_CCx_ENABLE);

      /* Enable the Peripheral */
      __DAL_TMR_ENABLE(htmr);

      break;
    }

