betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_tmr.c
    case TMR_CHANNEL_2:
    {
      /* Set the DMA capture callbacks */
      htmr->hdma[TMR_DMA_ID_CC2]->XferCpltCallback = TMR_DMACaptureCplt;
      htmr->hdma[TMR_DMA_ID_CC2]->XferHalfCpltCallback = TMR_DMACaptureHalfCplt;

      /* Set the DMA error callback */
      htmr->hdma[TMR_DMA_ID_CC2]->XferErrorCallback = TMR_DMAError;
      /* Enable the DMA stream */
      if (DAL_DMA_Start_IT(htmr->hdma[TMR_DMA_ID_CC2], (uint32_t)&htmr->Instance->CC2, (uint32_t)pData2,
                           Length) != DAL_OK)
      {
        /* Return error status */
        return DAL_ERROR;
      }
      /* Enable the TMR Input Capture  DMA request */
      __DAL_TMR_ENABLE_DMA(htmr, TMR_DMA_CC2);

      /* Enable the Capture compare channel */
      TMR_CCxChannelCmd(htmr->Instance, TMR_CHANNEL_2, TMR_CCx_ENABLE);

      /* Enable the Peripheral */
      __DAL_TMR_ENABLE(htmr);

      break;
    }

    default:
    {
      /* Set the DMA capture callbacks */
      htmr->hdma[TMR_DMA_ID_CC1]->XferCpltCallback = TMR_DMACaptureCplt;
      htmr->hdma[TMR_DMA_ID_CC1]->XferHalfCpltCallback = TMR_DMACaptureHalfCplt;

      /* Set the DMA error callback */
      htmr->hdma[TMR_DMA_ID_CC1]->XferErrorCallback = TMR_DMAError ;

      /* Enable the DMA stream */
      if (DAL_DMA_Start_IT(htmr->hdma[TMR_DMA_ID_CC1], (uint32_t)&htmr->Instance->CC1, (uint32_t)pData1,
                           Length) != DAL_OK)
      {
        /* Return error status */
        return DAL_ERROR;
      }

      /* Set the DMA capture callbacks */
      htmr->hdma[TMR_DMA_ID_CC2]->XferCpltCallback = TMR_DMACaptureCplt;
      htmr->hdma[TMR_DMA_ID_CC2]->XferHalfCpltCallback = TMR_DMACaptureHalfCplt;

      /* Set the DMA error callback */
      htmr->hdma[TMR_DMA_ID_CC2]->XferErrorCallback = TMR_DMAError ;

      /* Enable the DMA stream */
      if (DAL_DMA_Start_IT(htmr->hdma[TMR_DMA_ID_CC2], (uint32_t)&htmr->Instance->CC2, (uint32_t)pData2,
                           Length) != DAL_OK)
      {
        /* Return error status */
        return DAL_ERROR;
      }

      /* Enable the TMR Input Capture  DMA request */
      __DAL_TMR_ENABLE_DMA(htmr, TMR_DMA_CC1);
      /* Enable the TMR Input Capture  DMA request */
      __DAL_TMR_ENABLE_DMA(htmr, TMR_DMA_CC2);

      /* Enable the Capture compare channel */
      TMR_CCxChannelCmd(htmr->Instance, TMR_CHANNEL_1, TMR_CCx_ENABLE);
      TMR_CCxChannelCmd(htmr->Instance, TMR_CHANNEL_2, TMR_CCx_ENABLE);

      /* Enable the Peripheral */
      __DAL_TMR_ENABLE(htmr);

      break;
    }
  }

  /* Return function status */
  return DAL_OK;
}

/**
  * @brief  Stops the TMR Encoder Interface in DMA mode.
  * @param  htmr TMR Encoder Interface handle
  * @param  Channel TMR Channels to be enabled
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1 selected
  *            @arg TMR_CHANNEL_2: TMR Channel 2 selected
  *            @arg TMR_CHANNEL_ALL: TMR Channel 1 and TMR Channel 2 are selected
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_Encoder_Stop_DMA(TMR_HandleTypeDef *htmr, uint32_t Channel)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_ENCODER_INTERFACE_INSTANCE(htmr->Instance));

  /* Disable the Input Capture channels 1 and 2
    (in the EncoderInterface the two possible channels that can be used are TMR_CHANNEL_1 and TMR_CHANNEL_2) */
  if (Channel == TMR_CHANNEL_1)
  {
    TMR_CCxChannelCmd(htmr->Instance, TMR_CHANNEL_1, TMR_CCx_DISABLE);

    /* Disable the capture compare DMA Request 1 */
    __DAL_TMR_DISABLE_DMA(htmr, TMR_DMA_CC1);
    (void)DAL_DMA_Abort_IT(htmr->hdma[TMR_DMA_ID_CC1]);
  }
  else if (Channel == TMR_CHANNEL_2)
  {
    TMR_CCxChannelCmd(htmr->Instance, TMR_CHANNEL_2, TMR_CCx_DISABLE);

    /* Disable the capture compare DMA Request 2 */
    __DAL_TMR_DISABLE_DMA(htmr, TMR_DMA_CC2);
    (void)DAL_DMA_Abort_IT(htmr->hdma[TMR_DMA_ID_CC2]);
  }
  else
  {
    TMR_CCxChannelCmd(htmr->Instance, TMR_CHANNEL_1, TMR_CCx_DISABLE);
    TMR_CCxChannelCmd(htmr->Instance, TMR_CHANNEL_2, TMR_CCx_DISABLE);

    /* Disable the capture compare DMA Request 1 and 2 */
    __DAL_TMR_DISABLE_DMA(htmr, TMR_DMA_CC1);
    __DAL_TMR_DISABLE_DMA(htmr, TMR_DMA_CC2);
    (void)DAL_DMA_Abort_IT(htmr->hdma[TMR_DMA_ID_CC1]);
    (void)DAL_DMA_Abort_IT(htmr->hdma[TMR_DMA_ID_CC2]);
  }

  /* Disable the Peripheral */
  __DAL_TMR_DISABLE(htmr);

  /* Set the TMR channel(s) state */
  if ((Channel == TMR_CHANNEL_1) || (Channel == TMR_CHANNEL_2))
  {
    TMR_CHANNEL_STATE_SET(htmr, Channel, DAL_TMR_CHANNEL_STATE_READY);
    TMR_CHANNEL_N_STATE_SET(htmr, Channel, DAL_TMR_CHANNEL_STATE_READY);
  }
  else
  {
    TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_READY);
    TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_READY);
    TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_READY);
    TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_READY);
  }

  /* Return function status */
  return DAL_OK;
}

/**
  * @}
  */
/** @defgroup TMR_Exported_Functions_Group7 TMR IRQ handler management
  *  @brief    TMR IRQ handler management
  *
@verbatim
  ==============================================================================
                        ##### IRQ handler management #####
  ==============================================================================
  [..]
    This section provides Timer IRQ handler function.

@endverbatim
  * @{
  */
/**
  * @brief  This function handles TMR interrupts requests.
  * @param  htmr TMR  handle
  * @retval None
  */
void DAL_TMR_IRQHandler(TMR_HandleTypeDef *htmr)
{
  /* Capture compare 1 event */
  if (__DAL_TMR_GET_FLAG(htmr, TMR_FLAG_CC1) != RESET)
  {
    if (__DAL_TMR_GET_IT_SOURCE(htmr, TMR_IT_CC1) != RESET)
    {
      {
        __DAL_TMR_CLEAR_IT(htmr, TMR_IT_CC1);
        htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_1;

        /* Input capture event */
        if ((htmr->Instance->CCM1 & TMR_CCM1_CC1SEL) != 0x00U)
        {
#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
          htmr->IC_CaptureCallback(htmr);
#else
          DAL_TMR_IC_CaptureCallback(htmr);
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */
        }
        /* Output compare event */
        else
        {
#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
          htmr->OC_DelayElapsedCallback(htmr);
          htmr->PWM_PulseFinishedCallback(htmr);
#else
          DAL_TMR_OC_DelayElapsedCallback(htmr);
          DAL_TMR_PWM_PulseFinishedCallback(htmr);
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */
        }
        htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_CLEARED;
      }
    }
  }
  /* Capture compare 2 event */
  if (__DAL_TMR_GET_FLAG(htmr, TMR_FLAG_CC2) != RESET)
  {
    if (__DAL_TMR_GET_IT_SOURCE(htmr, TMR_IT_CC2) != RESET)
    {
      __DAL_TMR_CLEAR_IT(htmr, TMR_IT_CC2);
      htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_2;
      /* Input capture event */
      if ((htmr->Instance->CCM1 & TMR_CCM1_CC2SEL) != 0x00U)
      {
#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
        htmr->IC_CaptureCallback(htmr);
#else
        DAL_TMR_IC_CaptureCallback(htmr);
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */
      }
      /* Output compare event */
      else
      {
#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
        htmr->OC_DelayElapsedCallback(htmr);
        htmr->PWM_PulseFinishedCallback(htmr);
#else
        DAL_TMR_OC_DelayElapsedCallback(htmr);
        DAL_TMR_PWM_PulseFinishedCallback(htmr);
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */
      }
      htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_CLEARED;
    }
  }
  /* Capture compare 3 event */
  if (__DAL_TMR_GET_FLAG(htmr, TMR_FLAG_CC3) != RESET)
  {
    if (__DAL_TMR_GET_IT_SOURCE(htmr, TMR_IT_CC3) != RESET)
    {
      __DAL_TMR_CLEAR_IT(htmr, TMR_IT_CC3);
      htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_3;
      /* Input capture event */
      if ((htmr->Instance->CCM2 & TMR_CCM2_CC3SEL) != 0x00U)
      {
#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
        htmr->IC_CaptureCallback(htmr);
#else
        DAL_TMR_IC_CaptureCallback(htmr);
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */
      }
      /* Output compare event */
      else
      {
#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
        htmr->OC_DelayElapsedCallback(htmr);
        htmr->PWM_PulseFinishedCallback(htmr);
#else
        DAL_TMR_OC_DelayElapsedCallback(htmr);
        DAL_TMR_PWM_PulseFinishedCallback(htmr);
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */
      }
      htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_CLEARED;
    }
  }
  /* Capture compare 4 event */
  if (__DAL_TMR_GET_FLAG(htmr, TMR_FLAG_CC4) != RESET)
  {
    if (__DAL_TMR_GET_IT_SOURCE(htmr, TMR_IT_CC4) != RESET)
    {
      __DAL_TMR_CLEAR_IT(htmr, TMR_IT_CC4);
      htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_4;
      /* Input capture event */
      if ((htmr->Instance->CCM2 & TMR_CCM2_CC4SEL) != 0x00U)
      {
#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
        htmr->IC_CaptureCallback(htmr);
#else
        DAL_TMR_IC_CaptureCallback(htmr);
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */
      }
      /* Output compare event */
      else
      {
#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
        htmr->OC_DelayElapsedCallback(htmr);
        htmr->PWM_PulseFinishedCallback(htmr);
#else
        DAL_TMR_OC_DelayElapsedCallback(htmr);
        DAL_TMR_PWM_PulseFinishedCallback(htmr);
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */
      }
      htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_CLEARED;
    }
  }
  /* TMR Update event */
  if (__DAL_TMR_GET_FLAG(htmr, TMR_FLAG_UPDATE) != RESET)
  {
    if (__DAL_TMR_GET_IT_SOURCE(htmr, TMR_IT_UPDATE) != RESET)
    {
      __DAL_TMR_CLEAR_IT(htmr, TMR_IT_UPDATE);
#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
      htmr->PeriodElapsedCallback(htmr);
#else
      DAL_TMR_PeriodElapsedCallback(htmr);
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */
    }
  }
  /* TMR Break input event */
  if (__DAL_TMR_GET_FLAG(htmr, TMR_FLAG_BREAK) != RESET)
  {
    if (__DAL_TMR_GET_IT_SOURCE(htmr, TMR_IT_BREAK) != RESET)
    {
      __DAL_TMR_CLEAR_IT(htmr, TMR_IT_BREAK);
#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
      htmr->BreakCallback(htmr);
#else
      DAL_TMREx_BreakCallback(htmr);
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */
    }
  }
  /* TMR Trigger detection event */
  if (__DAL_TMR_GET_FLAG(htmr, TMR_FLAG_TRIGGER) != RESET)
  {
    if (__DAL_TMR_GET_IT_SOURCE(htmr, TMR_IT_TRIGGER) != RESET)
    {
      __DAL_TMR_CLEAR_IT(htmr, TMR_IT_TRIGGER);
#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
      htmr->TriggerCallback(htmr);
#else
      DAL_TMR_TriggerCallback(htmr);
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */
    }
  }
  /* TMR commutation event */
  if (__DAL_TMR_GET_FLAG(htmr, TMR_FLAG_COM) != RESET)
  {
    if (__DAL_TMR_GET_IT_SOURCE(htmr, TMR_IT_COM) != RESET)
    {
      __DAL_TMR_CLEAR_IT(htmr, TMR_FLAG_COM);
#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
      htmr->CommutationCallback(htmr);
#else
      DAL_TMREx_CommutCallback(htmr);
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */
    }
  }
}

/**
  * @}
  */

