betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_tmr.c
/** @defgroup TMR_Exported_Functions_Group8 TMR Peripheral Control functions
  *  @brief    TMR Peripheral Control functions
  *
@verbatim
  ==============================================================================
                   ##### Peripheral Control functions #####
  ==============================================================================
 [..]
   This section provides functions allowing to:
      (+) Configure The Input Output channels for OC, PWM, IC or One Pulse mode.
      (+) Configure External Clock source.
      (+) Configure Complementary channels, break features and dead time.
      (+) Configure Master and the Slave synchronization.
      (+) Configure the DMA Burst Mode.

@endverbatim
  * @{
  */

/**
  * @brief  Initializes the TMR Output Compare Channels according to the specified
  *         parameters in the TMR_OC_InitTypeDef.
  * @param  htmr TMR Output Compare handle
  * @param  sConfig TMR Output Compare configuration structure
  * @param  Channel TMR Channels to configure
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1 selected
  *            @arg TMR_CHANNEL_2: TMR Channel 2 selected
  *            @arg TMR_CHANNEL_3: TMR Channel 3 selected
  *            @arg TMR_CHANNEL_4: TMR Channel 4 selected
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_OC_ConfigChannel(TMR_HandleTypeDef *htmr,
                                           TMR_OC_InitTypeDef *sConfig,
                                           uint32_t Channel)
{
  DAL_StatusTypeDef status = DAL_OK;

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_CHANNELS(Channel));
  ASSERT_PARAM(IS_TMR_OC_MODE(sConfig->OCMode));
  ASSERT_PARAM(IS_TMR_OC_POLARITY(sConfig->OCPolarity));

  /* Process Locked */
  __DAL_LOCK(htmr);

  switch (Channel)
  {
    case TMR_CHANNEL_1:
    {
      /* Check the parameters */
      ASSERT_PARAM(IS_TMR_CC1_INSTANCE(htmr->Instance));

      /* Configure the TMR Channel 1 in Output Compare */
      TMR_OC1_SetConfig(htmr->Instance, sConfig);
      break;
    }

    case TMR_CHANNEL_2:
    {
      /* Check the parameters */
      ASSERT_PARAM(IS_TMR_CC2_INSTANCE(htmr->Instance));

      /* Configure the TMR Channel 2 in Output Compare */
      TMR_OC2_SetConfig(htmr->Instance, sConfig);
      break;
    }

    case TMR_CHANNEL_3:
    {
      /* Check the parameters */
      ASSERT_PARAM(IS_TMR_CC3_INSTANCE(htmr->Instance));

      /* Configure the TMR Channel 3 in Output Compare */
      TMR_OC3_SetConfig(htmr->Instance, sConfig);
      break;
    }

    case TMR_CHANNEL_4:
    {
      /* Check the parameters */
      ASSERT_PARAM(IS_TMR_CC4_INSTANCE(htmr->Instance));

      /* Configure the TMR Channel 4 in Output Compare */
      TMR_OC4_SetConfig(htmr->Instance, sConfig);
      break;
    }

    default:
      status = DAL_ERROR;
      break;
  }

  __DAL_UNLOCK(htmr);

  return status;
}

/**
  * @brief  Initializes the TMR Input Capture Channels according to the specified
  *         parameters in the TMR_IC_InitTypeDef.
  * @param  htmr TMR IC handle
  * @param  sConfig TMR Input Capture configuration structure
  * @param  Channel TMR Channel to configure
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1 selected
  *            @arg TMR_CHANNEL_2: TMR Channel 2 selected
  *            @arg TMR_CHANNEL_3: TMR Channel 3 selected
  *            @arg TMR_CHANNEL_4: TMR Channel 4 selected
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_IC_ConfigChannel(TMR_HandleTypeDef *htmr, TMR_IC_InitTypeDef *sConfig, uint32_t Channel)
{
  DAL_StatusTypeDef status = DAL_OK;

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_CC1_INSTANCE(htmr->Instance));
  ASSERT_PARAM(IS_TMR_IC_POLARITY(sConfig->ICPolarity));
  ASSERT_PARAM(IS_TMR_IC_SELECTION(sConfig->ICSelection));
  ASSERT_PARAM(IS_TMR_IC_PRESCALER(sConfig->ICPrescaler));
  ASSERT_PARAM(IS_TMR_IC_FILTER(sConfig->ICFilter));

  /* Process Locked */
  __DAL_LOCK(htmr);

  if (Channel == TMR_CHANNEL_1)
  {
    /* TI1 Configuration */
    TMR_TI1_SetConfig(htmr->Instance,
                      sConfig->ICPolarity,
                      sConfig->ICSelection,
                      sConfig->ICFilter);

    /* Reset the IC1PSC Bits */
    htmr->Instance->CCM1 &= ~TMR_CCM1_IC1PSC;

    /* Set the IC1PSC value */
    htmr->Instance->CCM1 |= sConfig->ICPrescaler;
  }
  else if (Channel == TMR_CHANNEL_2)
  {
    /* TI2 Configuration */
    ASSERT_PARAM(IS_TMR_CC2_INSTANCE(htmr->Instance));

    TMR_TI2_SetConfig(htmr->Instance,
                      sConfig->ICPolarity,
                      sConfig->ICSelection,
                      sConfig->ICFilter);

    /* Reset the IC2PSC Bits */
    htmr->Instance->CCM1 &= ~TMR_CCM1_IC2PSC;

    /* Set the IC2PSC value */
    htmr->Instance->CCM1 |= (sConfig->ICPrescaler << 8U);
  }
  else if (Channel == TMR_CHANNEL_3)
  {
    /* TI3 Configuration */
    ASSERT_PARAM(IS_TMR_CC3_INSTANCE(htmr->Instance));

    TMR_TI3_SetConfig(htmr->Instance,
                      sConfig->ICPolarity,
                      sConfig->ICSelection,
                      sConfig->ICFilter);

    /* Reset the IC3PSC Bits */
    htmr->Instance->CCM2 &= ~TMR_CCM2_IC3PSC;

    /* Set the IC3PSC value */
    htmr->Instance->CCM2 |= sConfig->ICPrescaler;
  }
  else if (Channel == TMR_CHANNEL_4)
  {
    /* TI4 Configuration */
    ASSERT_PARAM(IS_TMR_CC4_INSTANCE(htmr->Instance));

    TMR_TI4_SetConfig(htmr->Instance,
                      sConfig->ICPolarity,
                      sConfig->ICSelection,
                      sConfig->ICFilter);

    /* Reset the IC4PSC Bits */
    htmr->Instance->CCM2 &= ~TMR_CCM2_IC4PSC;

    /* Set the IC4PSC value */
    htmr->Instance->CCM2 |= (sConfig->ICPrescaler << 8U);
  }
  else
  {
    status = DAL_ERROR;
  }

  __DAL_UNLOCK(htmr);

  return status;
}

/**
  * @brief  Initializes the TMR PWM  channels according to the specified
  *         parameters in the TMR_OC_InitTypeDef.
  * @param  htmr TMR PWM handle
  * @param  sConfig TMR PWM configuration structure
  * @param  Channel TMR Channels to be configured
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1 selected
  *            @arg TMR_CHANNEL_2: TMR Channel 2 selected
  *            @arg TMR_CHANNEL_3: TMR Channel 3 selected
  *            @arg TMR_CHANNEL_4: TMR Channel 4 selected
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_PWM_ConfigChannel(TMR_HandleTypeDef *htmr,
                                            TMR_OC_InitTypeDef *sConfig,
                                            uint32_t Channel)
{
  DAL_StatusTypeDef status = DAL_OK;

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_CHANNELS(Channel));
  ASSERT_PARAM(IS_TMR_PWM_MODE(sConfig->OCMode));
  ASSERT_PARAM(IS_TMR_OC_POLARITY(sConfig->OCPolarity));
  ASSERT_PARAM(IS_TMR_FAST_STATE(sConfig->OCFastMode));

  /* Process Locked */
  __DAL_LOCK(htmr);

  switch (Channel)
  {
    case TMR_CHANNEL_1:
    {
      /* Check the parameters */
      ASSERT_PARAM(IS_TMR_CC1_INSTANCE(htmr->Instance));

