betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_tmr.c
      /* Configure the Channel 1 in PWM mode */
      TMR_OC1_SetConfig(htmr->Instance, sConfig);

      /* Set the Preload enable bit for channel1 */
      htmr->Instance->CCM1 |= TMR_CCM1_OC1PEN;

      /* Configure the Output Fast mode */
      htmr->Instance->CCM1 &= ~TMR_CCM1_OC1FEN;
      htmr->Instance->CCM1 |= sConfig->OCFastMode;
      break;
    }

    case TMR_CHANNEL_2:
    {
      /* Check the parameters */
      ASSERT_PARAM(IS_TMR_CC2_INSTANCE(htmr->Instance));

      /* Configure the Channel 2 in PWM mode */
      TMR_OC2_SetConfig(htmr->Instance, sConfig);

      /* Set the Preload enable bit for channel2 */
      htmr->Instance->CCM1 |= TMR_CCM1_OC2PEN;

      /* Configure the Output Fast mode */
      htmr->Instance->CCM1 &= ~TMR_CCM1_OC2FEN;
      htmr->Instance->CCM1 |= sConfig->OCFastMode << 8U;
      break;
    }

    case TMR_CHANNEL_3:
    {
      /* Check the parameters */
      ASSERT_PARAM(IS_TMR_CC3_INSTANCE(htmr->Instance));

      /* Configure the Channel 3 in PWM mode */
      TMR_OC3_SetConfig(htmr->Instance, sConfig);

      /* Set the Preload enable bit for channel3 */
      htmr->Instance->CCM2 |= TMR_CCM2_OC3PEN;

      /* Configure the Output Fast mode */
      htmr->Instance->CCM2 &= ~TMR_CCM2_OC3FEN;
      htmr->Instance->CCM2 |= sConfig->OCFastMode;
      break;
    }

    case TMR_CHANNEL_4:
    {
      /* Check the parameters */
      ASSERT_PARAM(IS_TMR_CC4_INSTANCE(htmr->Instance));

      /* Configure the Channel 4 in PWM mode */
      TMR_OC4_SetConfig(htmr->Instance, sConfig);

      /* Set the Preload enable bit for channel4 */
      htmr->Instance->CCM2 |= TMR_CCM2_OC4PEN;

      /* Configure the Output Fast mode */
      htmr->Instance->CCM2 &= ~TMR_CCM2_OC4FEN;
      htmr->Instance->CCM2 |= sConfig->OCFastMode << 8U;
      break;
    }

    default:
      status = DAL_ERROR;
      break;
  }

  __DAL_UNLOCK(htmr);

  return status;
}

/**
  * @brief  Initializes the TMR One Pulse Channels according to the specified
  *         parameters in the TMR_OnePulse_InitTypeDef.
  * @param  htmr TMR One Pulse handle
  * @param  sConfig TMR One Pulse configuration structure
  * @param  OutputChannel TMR output channel to configure
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1 selected
  *            @arg TMR_CHANNEL_2: TMR Channel 2 selected
  * @param  InputChannel TMR input Channel to configure
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1 selected
  *            @arg TMR_CHANNEL_2: TMR Channel 2 selected
  * @note  To output a waveform with a minimum delay user can enable the fast
  *        mode by calling the @ref __DAL_TMR_ENABLE_OCxFAST macro. Then CCx
  *        output is forced in response to the edge detection on TIx input,
  *        without taking in account the comparison.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_OnePulse_ConfigChannel(TMR_HandleTypeDef *htmr,  TMR_OnePulse_InitTypeDef *sConfig,
                                                 uint32_t OutputChannel,  uint32_t InputChannel)
{
  DAL_StatusTypeDef status = DAL_OK;
  TMR_OC_InitTypeDef temp1;

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_OPM_CHANNELS(OutputChannel));
  ASSERT_PARAM(IS_TMR_OPM_CHANNELS(InputChannel));

  if (OutputChannel != InputChannel)
  {
    /* Process Locked */
    __DAL_LOCK(htmr);

    htmr->State = DAL_TMR_STATE_BUSY;

    /* Extract the Output compare configuration from sConfig structure */
    temp1.OCMode = sConfig->OCMode;
    temp1.Pulse = sConfig->Pulse;
    temp1.OCPolarity = sConfig->OCPolarity;
    temp1.OCNPolarity = sConfig->OCNPolarity;
    temp1.OCIdleState = sConfig->OCIdleState;
    temp1.OCNIdleState = sConfig->OCNIdleState;

    switch (OutputChannel)
    {
      case TMR_CHANNEL_1:
      {
        ASSERT_PARAM(IS_TMR_CC1_INSTANCE(htmr->Instance));

        TMR_OC1_SetConfig(htmr->Instance, &temp1);
        break;
      }

      case TMR_CHANNEL_2:
      {
        ASSERT_PARAM(IS_TMR_CC2_INSTANCE(htmr->Instance));

        TMR_OC2_SetConfig(htmr->Instance, &temp1);
        break;
      }

      default:
        status = DAL_ERROR;
        break;
    }

    if (status == DAL_OK)
    {
      switch (InputChannel)
      {
        case TMR_CHANNEL_1:
        {
          ASSERT_PARAM(IS_TMR_CC1_INSTANCE(htmr->Instance));

          TMR_TI1_SetConfig(htmr->Instance, sConfig->ICPolarity,
                            sConfig->ICSelection, sConfig->ICFilter);

          /* Reset the IC1PSC Bits */
          htmr->Instance->CCM1 &= ~TMR_CCM1_IC1PSC;

          /* Select the Trigger source */
          htmr->Instance->SMCTRL &= ~TMR_SMCTRL_TRGSEL;
          htmr->Instance->SMCTRL |= TMR_TS_TI1FP1;

          /* Select the Slave Mode */
          htmr->Instance->SMCTRL &= ~TMR_SMCTRL_SMFSEL;
          htmr->Instance->SMCTRL |= TMR_SLAVEMODE_TRIGGER;
          break;
        }

        case TMR_CHANNEL_2:
        {
          ASSERT_PARAM(IS_TMR_CC2_INSTANCE(htmr->Instance));

          TMR_TI2_SetConfig(htmr->Instance, sConfig->ICPolarity,
                            sConfig->ICSelection, sConfig->ICFilter);

          /* Reset the IC2PSC Bits */
          htmr->Instance->CCM1 &= ~TMR_CCM1_IC2PSC;

          /* Select the Trigger source */
          htmr->Instance->SMCTRL &= ~TMR_SMCTRL_TRGSEL;
          htmr->Instance->SMCTRL |= TMR_TS_TI2FP2;

          /* Select the Slave Mode */
          htmr->Instance->SMCTRL &= ~TMR_SMCTRL_SMFSEL;
          htmr->Instance->SMCTRL |= TMR_SLAVEMODE_TRIGGER;
          break;
        }

        default:
          status = DAL_ERROR;
          break;
      }
    }

    htmr->State = DAL_TMR_STATE_READY;

    __DAL_UNLOCK(htmr);

    return status;
  }
  else
  {
    return DAL_ERROR;
  }
}

/**
  * @brief  Configure the DMA Burst to transfer Data from the memory to the TMR peripheral
  * @param  htmr TMR handle
  * @param  BurstBaseAddress TMR Base address from where the DMA  will start the Data write
  *         This parameter can be one of the following values:
  *            @arg TMR_DMABASE_CTRL1
  *            @arg TMR_DMABASE_CTRL2
  *            @arg TMR_DMABASE_SMCTRL
  *            @arg TMR_DMABASE_DIEN
  *            @arg TMR_DMABASE_STS
  *            @arg TMR_DMABASE_CEG
  *            @arg TMR_DMABASE_CCM1
  *            @arg TMR_DMABASE_CCM2
  *            @arg TMR_DMABASE_CCEN
  *            @arg TMR_DMABASE_CNT
  *            @arg TMR_DMABASE_PSC
  *            @arg TMR_DMABASE_AUTORLD
  *            @arg TMR_DMABASE_REPCNT
  *            @arg TMR_DMABASE_CC1
  *            @arg TMR_DMABASE_CC2
  *            @arg TMR_DMABASE_CC3
  *            @arg TMR_DMABASE_CC4
  *            @arg TMR_DMABASE_BDT
  * @param  BurstRequestSrc TMR DMA Request sources
  *         This parameter can be one of the following values:
  *            @arg TMR_DMA_UPDATE: TMR update Interrupt source
  *            @arg TMR_DMA_CC1: TMR Capture Compare 1 DMA source
  *            @arg TMR_DMA_CC2: TMR Capture Compare 2 DMA source
  *            @arg TMR_DMA_CC3: TMR Capture Compare 3 DMA source
  *            @arg TMR_DMA_CC4: TMR Capture Compare 4 DMA source
  *            @arg TMR_DMA_COM: TMR Commutation DMA source
  *            @arg TMR_DMA_TRIGGER: TMR Trigger DMA source
  * @param  BurstBuffer The Buffer address.
  * @param  BurstLength DMA Burst length. This parameter can be one value
  *         between: TMR_DMABURSTLENGTH_1TRANSFER and TMR_DMABURSTLENGTH_18TRANSFERS.
  * @note   This function should be used only when BurstLength is equal to DMA data transfer length.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_DMABurst_WriteStart(TMR_HandleTypeDef *htmr, uint32_t BurstBaseAddress,
                                              uint32_t BurstRequestSrc, uint32_t *BurstBuffer, uint32_t  BurstLength)
{
  DAL_StatusTypeDef status;

  status = DAL_TMR_DMABurst_MultiWriteStart(htmr, BurstBaseAddress, BurstRequestSrc, BurstBuffer, BurstLength,
                                            ((BurstLength) >> 8U) + 1U);



