betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_tmr.c
  return status;
}

/**
  * @brief  Configure the DMA Burst to transfer Data from the TMR peripheral to the memory
  * @param  htmr TMR handle
  * @param  BurstBaseAddress TMR Base address from where the DMA  will start the Data read
  *         This parameter can be one of the following values:
  *            @arg TMR_DMABASE_CTRL1
  *            @arg TMR_DMABASE_CTRL2
  *            @arg TMR_DMABASE_SMCTRL
  *            @arg TMR_DMABASE_DIEN
  *            @arg TMR_DMABASE_STS
  *            @arg TMR_DMABASE_CEG
  *            @arg TMR_DMABASE_CCM1
  *            @arg TMR_DMABASE_CCM2
  *            @arg TMR_DMABASE_CCEN
  *            @arg TMR_DMABASE_CNT
  *            @arg TMR_DMABASE_PSC
  *            @arg TMR_DMABASE_AUTORLD
  *            @arg TMR_DMABASE_REPCNT
  *            @arg TMR_DMABASE_CC1
  *            @arg TMR_DMABASE_CC2
  *            @arg TMR_DMABASE_CC3
  *            @arg TMR_DMABASE_CC4
  *            @arg TMR_DMABASE_BDT
  * @param  BurstRequestSrc TMR DMA Request sources
  *         This parameter can be one of the following values:
  *            @arg TMR_DMA_UPDATE: TMR update Interrupt source
  *            @arg TMR_DMA_CC1: TMR Capture Compare 1 DMA source
  *            @arg TMR_DMA_CC2: TMR Capture Compare 2 DMA source
  *            @arg TMR_DMA_CC3: TMR Capture Compare 3 DMA source
  *            @arg TMR_DMA_CC4: TMR Capture Compare 4 DMA source
  *            @arg TMR_DMA_COM: TMR Commutation DMA source
  *            @arg TMR_DMA_TRIGGER: TMR Trigger DMA source
  * @param  BurstBuffer The Buffer address.
  * @param  BurstLength DMA Burst length. This parameter can be one value
  *         between: TMR_DMABURSTLENGTH_1TRANSFER and TMR_DMABURSTLENGTH_18TRANSFERS.
  * @param  DataLength Data length. This parameter can be one value
  *         between 1 and 0xFFFF.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_DMABurst_MultiReadStart(TMR_HandleTypeDef *htmr, uint32_t BurstBaseAddress,
                                                  uint32_t BurstRequestSrc, uint32_t  *BurstBuffer,
                                                  uint32_t  BurstLength, uint32_t  DataLength)
{
  DAL_StatusTypeDef status = DAL_OK;

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_DMABURST_INSTANCE(htmr->Instance));
  ASSERT_PARAM(IS_TMR_DMA_BASE(BurstBaseAddress));
  ASSERT_PARAM(IS_TMR_DMA_SOURCE(BurstRequestSrc));
  ASSERT_PARAM(IS_TMR_DMA_LENGTH(BurstLength));
  ASSERT_PARAM(IS_TMR_DMA_DATA_LENGTH(DataLength));

  if (htmr->DMABurstState == DAL_DMA_BURST_STATE_BUSY)
  {
    return DAL_BUSY;
  }
  else if (htmr->DMABurstState == DAL_DMA_BURST_STATE_READY)
  {
    if ((BurstBuffer == NULL) && (BurstLength > 0U))
    {
      return DAL_ERROR;
    }
    else
    {
      htmr->DMABurstState = DAL_DMA_BURST_STATE_BUSY;
    }
  }
  else
  {
    /* nothing to do */
  }
  switch (BurstRequestSrc)
  {
    case TMR_DMA_UPDATE:
    {
      /* Set the DMA Period elapsed callbacks */
      htmr->hdma[TMR_DMA_ID_UPDATE]->XferCpltCallback = TMR_DMAPeriodElapsedCplt;
      htmr->hdma[TMR_DMA_ID_UPDATE]->XferHalfCpltCallback = TMR_DMAPeriodElapsedHalfCplt;

      /* Set the DMA error callback */
      htmr->hdma[TMR_DMA_ID_UPDATE]->XferErrorCallback = TMR_DMAError ;

      /* Enable the DMA stream */
      if (DAL_DMA_Start_IT(htmr->hdma[TMR_DMA_ID_UPDATE], (uint32_t)&htmr->Instance->DMADDR, (uint32_t)BurstBuffer,
                           DataLength) != DAL_OK)
      {
        /* Return error status */
        return DAL_ERROR;
      }
      break;
    }
    case TMR_DMA_CC1:
    {
      /* Set the DMA capture callbacks */
      htmr->hdma[TMR_DMA_ID_CC1]->XferCpltCallback = TMR_DMACaptureCplt;
      htmr->hdma[TMR_DMA_ID_CC1]->XferHalfCpltCallback = TMR_DMACaptureHalfCplt;

      /* Set the DMA error callback */
      htmr->hdma[TMR_DMA_ID_CC1]->XferErrorCallback = TMR_DMAError ;

      /* Enable the DMA stream */
      if (DAL_DMA_Start_IT(htmr->hdma[TMR_DMA_ID_CC1], (uint32_t)&htmr->Instance->DMADDR, (uint32_t)BurstBuffer,
                           DataLength) != DAL_OK)
      {
        /* Return error status */
        return DAL_ERROR;
      }
      break;
    }
    case TMR_DMA_CC2:
    {
      /* Set the DMA capture callbacks */
      htmr->hdma[TMR_DMA_ID_CC2]->XferCpltCallback = TMR_DMACaptureCplt;
      htmr->hdma[TMR_DMA_ID_CC2]->XferHalfCpltCallback = TMR_DMACaptureHalfCplt;

      /* Set the DMA error callback */
      htmr->hdma[TMR_DMA_ID_CC2]->XferErrorCallback = TMR_DMAError ;

      /* Enable the DMA stream */
      if (DAL_DMA_Start_IT(htmr->hdma[TMR_DMA_ID_CC2], (uint32_t)&htmr->Instance->DMADDR, (uint32_t)BurstBuffer,
                           DataLength) != DAL_OK)
      {
        /* Return error status */
        return DAL_ERROR;
      }
      break;
    }
    case TMR_DMA_CC3:
    {
      /* Set the DMA capture callbacks */
      htmr->hdma[TMR_DMA_ID_CC3]->XferCpltCallback = TMR_DMACaptureCplt;
      htmr->hdma[TMR_DMA_ID_CC3]->XferHalfCpltCallback = TMR_DMACaptureHalfCplt;

      /* Set the DMA error callback */
      htmr->hdma[TMR_DMA_ID_CC3]->XferErrorCallback = TMR_DMAError ;

      /* Enable the DMA stream */
      if (DAL_DMA_Start_IT(htmr->hdma[TMR_DMA_ID_CC3], (uint32_t)&htmr->Instance->DMADDR, (uint32_t)BurstBuffer,
                           DataLength) != DAL_OK)
      {
        /* Return error status */
        return DAL_ERROR;
      }
      break;
    }
    case TMR_DMA_CC4:
    {
      /* Set the DMA capture callbacks */
      htmr->hdma[TMR_DMA_ID_CC4]->XferCpltCallback = TMR_DMACaptureCplt;
      htmr->hdma[TMR_DMA_ID_CC4]->XferHalfCpltCallback = TMR_DMACaptureHalfCplt;

      /* Set the DMA error callback */
      htmr->hdma[TMR_DMA_ID_CC4]->XferErrorCallback = TMR_DMAError ;

      /* Enable the DMA stream */
      if (DAL_DMA_Start_IT(htmr->hdma[TMR_DMA_ID_CC4], (uint32_t)&htmr->Instance->DMADDR, (uint32_t)BurstBuffer,
                           DataLength) != DAL_OK)
      {
        /* Return error status */
        return DAL_ERROR;
      }
      break;
    }
    case TMR_DMA_COM:
    {
      /* Set the DMA commutation callbacks */
      htmr->hdma[TMR_DMA_ID_COMMUTATION]->XferCpltCallback =  TMREx_DMACommutationCplt;
      htmr->hdma[TMR_DMA_ID_COMMUTATION]->XferHalfCpltCallback =  TMREx_DMACommutationHalfCplt;

      /* Set the DMA error callback */
      htmr->hdma[TMR_DMA_ID_COMMUTATION]->XferErrorCallback = TMR_DMAError ;

      /* Enable the DMA stream */
      if (DAL_DMA_Start_IT(htmr->hdma[TMR_DMA_ID_COMMUTATION], (uint32_t)&htmr->Instance->DMADDR, (uint32_t)BurstBuffer,
                           DataLength) != DAL_OK)
      {
        /* Return error status */
        return DAL_ERROR;
      }
      break;
    }
    case TMR_DMA_TRIGGER:
    {
      /* Set the DMA trigger callbacks */
      htmr->hdma[TMR_DMA_ID_TRIGGER]->XferCpltCallback = TMR_DMATriggerCplt;
      htmr->hdma[TMR_DMA_ID_TRIGGER]->XferHalfCpltCallback = TMR_DMATriggerHalfCplt;

      /* Set the DMA error callback */
      htmr->hdma[TMR_DMA_ID_TRIGGER]->XferErrorCallback = TMR_DMAError ;

      /* Enable the DMA stream */
      if (DAL_DMA_Start_IT(htmr->hdma[TMR_DMA_ID_TRIGGER], (uint32_t)&htmr->Instance->DMADDR, (uint32_t)BurstBuffer,
                           DataLength) != DAL_OK)
      {
        /* Return error status */
        return DAL_ERROR;
      }
      break;
    }
    default:
      status = DAL_ERROR;
      break;
  }

  if (status == DAL_OK)
  {
    /* Configure the DMA Burst Mode */
    htmr->Instance->DCTRL = (BurstBaseAddress | BurstLength);

    /* Enable the TMR DMA Request */
    __DAL_TMR_ENABLE_DMA(htmr, BurstRequestSrc);
  }

  /* Return function status */
  return status;
}

/**
  * @brief  Stop the DMA burst reading
  * @param  htmr TMR handle
  * @param  BurstRequestSrc TMR DMA Request sources to disable.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_DMABurst_ReadStop(TMR_HandleTypeDef *htmr, uint32_t BurstRequestSrc)
{
  DAL_StatusTypeDef status = DAL_OK;

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_DMA_SOURCE(BurstRequestSrc));

  /* Abort the DMA transfer (at least disable the DMA stream) */
  switch (BurstRequestSrc)
  {
    case TMR_DMA_UPDATE:
    {
      (void)DAL_DMA_Abort_IT(htmr->hdma[TMR_DMA_ID_UPDATE]);
      break;
    }
    case TMR_DMA_CC1:
    {
      (void)DAL_DMA_Abort_IT(htmr->hdma[TMR_DMA_ID_CC1]);
      break;
    }
    case TMR_DMA_CC2:
    {
      (void)DAL_DMA_Abort_IT(htmr->hdma[TMR_DMA_ID_CC2]);
      break;
    }
    case TMR_DMA_CC3:
    {
      (void)DAL_DMA_Abort_IT(htmr->hdma[TMR_DMA_ID_CC3]);
      break;
    }
    case TMR_DMA_CC4:
    {
      (void)DAL_DMA_Abort_IT(htmr->hdma[TMR_DMA_ID_CC4]);
      break;
    }
    case TMR_DMA_COM:
    {
      (void)DAL_DMA_Abort_IT(htmr->hdma[TMR_DMA_ID_COMMUTATION]);
      break;
    }
    case TMR_DMA_TRIGGER:
    {
      (void)DAL_DMA_Abort_IT(htmr->hdma[TMR_DMA_ID_TRIGGER]);
      break;
    }
    default:
      status = DAL_ERROR;
      break;
  }

  if (status == DAL_OK)
  {
    /* Disable the TMR Update DMA request */
    __DAL_TMR_DISABLE_DMA(htmr, BurstRequestSrc);

    /* Change the DMA burst operation state */
    htmr->DMABurstState = DAL_DMA_BURST_STATE_READY;
  }

  /* Return function status */
  return status;
}

/**
  * @brief  Generate a software event
  * @param  htmr TMR handle
  * @param  EventSource specifies the event source.
  *          This parameter can be one of the following values:
  *            @arg TMR_EVENTSOURCE_UPDATE: Timer update Event source
  *            @arg TMR_EVENTSOURCE_CC1: Timer Capture Compare 1 Event source
  *            @arg TMR_EVENTSOURCE_CC2: Timer Capture Compare 2 Event source
  *            @arg TMR_EVENTSOURCE_CC3: Timer Capture Compare 3 Event source
  *            @arg TMR_EVENTSOURCE_CC4: Timer Capture Compare 4 Event source
  *            @arg TMR_EVENTSOURCE_COM: Timer COM event source
  *            @arg TMR_EVENTSOURCE_TRIGGER: Timer Trigger Event source
  *            @arg TMR_EVENTSOURCE_BREAK: Timer Break event source
  * @note   Basic timers can only generate an update event.
  * @note   TMR_EVENTSOURCE_COM is relevant only with advanced timer instances.
  * @note   TMR_EVENTSOURCE_BREAK are relevant only for timer instances
  *         supporting a break input.
  * @note   Ensure that this function is executed completely, so it is not interrupted
  *         by the signals set by the function, which could result in the tmr handler 
  *         being locked and unable to execute the interrupt code properly.
  * @retval DAL status
  */

