betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_tmr.c
DAL_StatusTypeDef DAL_TMR_GenerateEvent(TMR_HandleTypeDef *htmr, uint32_t EventSource)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_INSTANCE(htmr->Instance));
  ASSERT_PARAM(IS_TMR_EVENT_SOURCE(EventSource));

  /* Process Locked */
  __DAL_LOCK(htmr);

  /* Change the TMR state */
  htmr->State = DAL_TMR_STATE_BUSY;

  /* Set the event sources */
  htmr->Instance->CEG = EventSource;

  /* Change the TMR state */
  htmr->State = DAL_TMR_STATE_READY;

  __DAL_UNLOCK(htmr);

  /* Return function status */
  return DAL_OK;
}

/**
  * @brief  Configures the OCRef clear feature
  * @param  htmr TMR handle
  * @param  sClearInputConfig pointer to a TMR_ClearInputConfigTypeDef structure that
  *         contains the OCREF clear feature and parameters for the TMR peripheral.
  * @param  Channel specifies the TMR Channel
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1
  *            @arg TMR_CHANNEL_2: TMR Channel 2
  *            @arg TMR_CHANNEL_3: TMR Channel 3
  *            @arg TMR_CHANNEL_4: TMR Channel 4
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_ConfigOCrefClear(TMR_HandleTypeDef *htmr,
                                           TMR_ClearInputConfigTypeDef *sClearInputConfig,
                                           uint32_t Channel)
{
  DAL_StatusTypeDef status = DAL_OK;

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_OCXREF_CLEAR_INSTANCE(htmr->Instance));
  ASSERT_PARAM(IS_TMR_CLEARINPUT_SOURCE(sClearInputConfig->ClearInputSource));

  /* Process Locked */
  __DAL_LOCK(htmr);

  htmr->State = DAL_TMR_STATE_BUSY;

  switch (sClearInputConfig->ClearInputSource)
  {
    case TMR_CLEARINPUTSOURCE_NONE:
    {
      /* Clear the OCREF clear selection bit and the the ETR Bits */
      CLEAR_BIT(htmr->Instance->SMCTRL, (TMR_SMCTRL_ETFCFG | TMR_SMCTRL_ETPCFG | TMR_SMCTRL_ECEN | TMR_SMCTRL_ETPOL));
      break;
    }

    case TMR_CLEARINPUTSOURCE_ETR:
    {
      /* Check the parameters */
      ASSERT_PARAM(IS_TMR_CLEARINPUT_POLARITY(sClearInputConfig->ClearInputPolarity));
      ASSERT_PARAM(IS_TMR_CLEARINPUT_PRESCALER(sClearInputConfig->ClearInputPrescaler));
      ASSERT_PARAM(IS_TMR_CLEARINPUT_FILTER(sClearInputConfig->ClearInputFilter));

      /* When OCRef clear feature is used with ETR source, ETR prescaler must be off */
      if (sClearInputConfig->ClearInputPrescaler != TMR_CLEARINPUTPRESCALER_DIV1)
      {
        htmr->State = DAL_TMR_STATE_READY;
        __DAL_UNLOCK(htmr);
        return DAL_ERROR;
      }

      TMR_ETR_SetConfig(htmr->Instance,
                        sClearInputConfig->ClearInputPrescaler,
                        sClearInputConfig->ClearInputPolarity,
                        sClearInputConfig->ClearInputFilter);
      break;
    }

    default:
      status = DAL_ERROR;
      break;
  }

  if (status == DAL_OK)
  {
    switch (Channel)
    {
      case TMR_CHANNEL_1:
      {
        if (sClearInputConfig->ClearInputState != (uint32_t)DISABLE)
        {
          /* Enable the OCREF clear feature for Channel 1 */
          SET_BIT(htmr->Instance->CCM1, TMR_CCM1_OC1CEN);
        }
        else
        {
          /* Disable the OCREF clear feature for Channel 1 */
          CLEAR_BIT(htmr->Instance->CCM1, TMR_CCM1_OC1CEN);
        }
        break;
      }
      case TMR_CHANNEL_2:
      {
        if (sClearInputConfig->ClearInputState != (uint32_t)DISABLE)
        {
          /* Enable the OCREF clear feature for Channel 2 */
          SET_BIT(htmr->Instance->CCM1, TMR_CCM1_OC2CEN);
        }
        else
        {
          /* Disable the OCREF clear feature for Channel 2 */
          CLEAR_BIT(htmr->Instance->CCM1, TMR_CCM1_OC2CEN);
        }
        break;
      }
      case TMR_CHANNEL_3:
      {
        if (sClearInputConfig->ClearInputState != (uint32_t)DISABLE)
        {
          /* Enable the OCREF clear feature for Channel 3 */
          SET_BIT(htmr->Instance->CCM2, TMR_CCM2_OC3CEN);
        }
        else
        {
          /* Disable the OCREF clear feature for Channel 3 */
          CLEAR_BIT(htmr->Instance->CCM2, TMR_CCM2_OC3CEN);
        }
        break;
      }
      case TMR_CHANNEL_4:
      {
        if (sClearInputConfig->ClearInputState != (uint32_t)DISABLE)
        {
          /* Enable the OCREF clear feature for Channel 4 */
          SET_BIT(htmr->Instance->CCM2, TMR_CCM2_OC4CEN);
        }
        else
        {
          /* Disable the OCREF clear feature for Channel 4 */
          CLEAR_BIT(htmr->Instance->CCM2, TMR_CCM2_OC4CEN);
        }
        break;
      }
      default:
        break;
    }
  }

  htmr->State = DAL_TMR_STATE_READY;

  __DAL_UNLOCK(htmr);

  return status;
}

/**
  * @brief   Configures the clock source to be used
  * @param  htmr TMR handle
  * @param  sClockSourceConfig pointer to a TMR_ClockConfigTypeDef structure that
  *         contains the clock source information for the TMR peripheral.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_ConfigClockSource(TMR_HandleTypeDef *htmr, TMR_ClockConfigTypeDef *sClockSourceConfig)
{
  DAL_StatusTypeDef status = DAL_OK;
  uint32_t tmpsmcr;

  /* Process Locked */
  __DAL_LOCK(htmr);

  htmr->State = DAL_TMR_STATE_BUSY;

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_CLOCKSOURCE(sClockSourceConfig->ClockSource));

  /* Reset the SMFSEL, TRGSEL, ETFCFG, ETPCFG and ECEN bits */
  tmpsmcr = htmr->Instance->SMCTRL;
  tmpsmcr &= ~(TMR_SMCTRL_SMFSEL | TMR_SMCTRL_TRGSEL);
  tmpsmcr &= ~(TMR_SMCTRL_ETFCFG | TMR_SMCTRL_ETPCFG | TMR_SMCTRL_ECEN | TMR_SMCTRL_ETPOL);
  htmr->Instance->SMCTRL = tmpsmcr;

  switch (sClockSourceConfig->ClockSource)
  {
    case TMR_CLOCKSOURCE_INTERNAL:
    {
      ASSERT_PARAM(IS_TMR_INSTANCE(htmr->Instance));
      break;
    }

    case TMR_CLOCKSOURCE_ETRMODE1:
    {
      /* Check whether or not the timer instance supports external trigger input mode 1 (ETRF)*/
      ASSERT_PARAM(IS_TMR_CLOCKSOURCE_ETRMODE1_INSTANCE(htmr->Instance));

      /* Check ETR input conditioning related parameters */
      ASSERT_PARAM(IS_TMR_CLOCKPRESCALER(sClockSourceConfig->ClockPrescaler));
      ASSERT_PARAM(IS_TMR_CLOCKPOLARITY(sClockSourceConfig->ClockPolarity));
      ASSERT_PARAM(IS_TMR_CLOCKFILTER(sClockSourceConfig->ClockFilter));

      /* Configure the ETR Clock source */
      TMR_ETR_SetConfig(htmr->Instance,
                        sClockSourceConfig->ClockPrescaler,
                        sClockSourceConfig->ClockPolarity,
                        sClockSourceConfig->ClockFilter);

      /* Select the External clock mode1 and the ETRF trigger */
      tmpsmcr = htmr->Instance->SMCTRL;
      tmpsmcr |= (TMR_SLAVEMODE_EXTERNAL1 | TMR_CLOCKSOURCE_ETRMODE1);
      /* Write to TMRx SMCTRL */
      htmr->Instance->SMCTRL = tmpsmcr;
      break;
    }

    case TMR_CLOCKSOURCE_ETRMODE2:
    {
      /* Check whether or not the timer instance supports external trigger input mode 2 (ETRF)*/
      ASSERT_PARAM(IS_TMR_CLOCKSOURCE_ETRMODE2_INSTANCE(htmr->Instance));

