betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_tmr.c
      /* Check ETR input conditioning related parameters */
      ASSERT_PARAM(IS_TMR_CLOCKPRESCALER(sClockSourceConfig->ClockPrescaler));
      ASSERT_PARAM(IS_TMR_CLOCKPOLARITY(sClockSourceConfig->ClockPolarity));
      ASSERT_PARAM(IS_TMR_CLOCKFILTER(sClockSourceConfig->ClockFilter));

      /* Configure the ETR Clock source */
      TMR_ETR_SetConfig(htmr->Instance,
                        sClockSourceConfig->ClockPrescaler,
                        sClockSourceConfig->ClockPolarity,
                        sClockSourceConfig->ClockFilter);
      /* Enable the External clock mode2 */
      htmr->Instance->SMCTRL |= TMR_SMCTRL_ECEN;
      break;
    }

    case TMR_CLOCKSOURCE_TI1:
    {
      /* Check whether or not the timer instance supports external clock mode 1 */
      ASSERT_PARAM(IS_TMR_CLOCKSOURCE_TIX_INSTANCE(htmr->Instance));

      /* Check TI1 input conditioning related parameters */
      ASSERT_PARAM(IS_TMR_CLOCKPOLARITY(sClockSourceConfig->ClockPolarity));
      ASSERT_PARAM(IS_TMR_CLOCKFILTER(sClockSourceConfig->ClockFilter));

      TMR_TI1_ConfigInputStage(htmr->Instance,
                               sClockSourceConfig->ClockPolarity,
                               sClockSourceConfig->ClockFilter);
      TMR_ITRx_SetConfig(htmr->Instance, TMR_CLOCKSOURCE_TI1);
      break;
    }

    case TMR_CLOCKSOURCE_TI2:
    {
      /* Check whether or not the timer instance supports external clock mode 1 (ETRF)*/
      ASSERT_PARAM(IS_TMR_CLOCKSOURCE_TIX_INSTANCE(htmr->Instance));

      /* Check TI2 input conditioning related parameters */
      ASSERT_PARAM(IS_TMR_CLOCKPOLARITY(sClockSourceConfig->ClockPolarity));
      ASSERT_PARAM(IS_TMR_CLOCKFILTER(sClockSourceConfig->ClockFilter));

      TMR_TI2_ConfigInputStage(htmr->Instance,
                               sClockSourceConfig->ClockPolarity,
                               sClockSourceConfig->ClockFilter);
      TMR_ITRx_SetConfig(htmr->Instance, TMR_CLOCKSOURCE_TI2);
      break;
    }

    case TMR_CLOCKSOURCE_TI1ED:
    {
      /* Check whether or not the timer instance supports external clock mode 1 */
      ASSERT_PARAM(IS_TMR_CLOCKSOURCE_TIX_INSTANCE(htmr->Instance));

      /* Check TI1 input conditioning related parameters */
      ASSERT_PARAM(IS_TMR_CLOCKPOLARITY(sClockSourceConfig->ClockPolarity));
      ASSERT_PARAM(IS_TMR_CLOCKFILTER(sClockSourceConfig->ClockFilter));

      TMR_TI1_ConfigInputStage(htmr->Instance,
                               sClockSourceConfig->ClockPolarity,
                               sClockSourceConfig->ClockFilter);
      TMR_ITRx_SetConfig(htmr->Instance, TMR_CLOCKSOURCE_TI1ED);
      break;
    }

    case TMR_CLOCKSOURCE_ITR0:
    case TMR_CLOCKSOURCE_ITR1:
    case TMR_CLOCKSOURCE_ITR2:
    case TMR_CLOCKSOURCE_ITR3:
    {
      /* Check whether or not the timer instance supports internal trigger input */
      ASSERT_PARAM(IS_TMR_CLOCKSOURCE_ITRX_INSTANCE(htmr->Instance));

      TMR_ITRx_SetConfig(htmr->Instance, sClockSourceConfig->ClockSource);
      break;
    }

    default:
      status = DAL_ERROR;
      break;
  }
  htmr->State = DAL_TMR_STATE_READY;

  __DAL_UNLOCK(htmr);

  return status;
}

/**
  * @brief  Selects the signal connected to the TI1 input: direct from CH1_input
  *         or a XOR combination between CH1_input, CH2_input & CH3_input
  * @param  htmr TMR handle.
  * @param  TI1_Selection Indicate whether or not channel 1 is connected to the
  *         output of a XOR gate.
  *          This parameter can be one of the following values:
  *            @arg TMR_TI1SELECTION_CH1: The TMRx_CH1 pin is connected to TI1 input
  *            @arg TMR_TI1SELECTION_XORCOMBINATION: The TMRx_CH1, CH2 and CH3
  *            pins are connected to the TI1 input (XOR combination)
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_ConfigTI1Input(TMR_HandleTypeDef *htmr, uint32_t TI1_Selection)
{
  uint32_t tmpcr2;

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_XOR_INSTANCE(htmr->Instance));
  ASSERT_PARAM(IS_TMR_TI1SELECTION(TI1_Selection));

  /* Get the TMRx CTRL2 register value */
  tmpcr2 = htmr->Instance->CTRL2;

  /* Reset the TI1 selection */
  tmpcr2 &= ~TMR_CTRL2_TI1SEL;

  /* Set the TI1 selection */
  tmpcr2 |= TI1_Selection;

  /* Write to TMRx CTRL2 */
  htmr->Instance->CTRL2 = tmpcr2;

  return DAL_OK;
}

/**
  * @brief  Configures the TMR in Slave mode
  * @param  htmr TMR handle.
  * @param  sSlaveConfig pointer to a TMR_SlaveConfigTypeDef structure that
  *         contains the selected trigger (internal trigger input, filtered
  *         timer input or external trigger input) and the Slave mode
  *         (Disable, Reset, Gated, Trigger, External clock mode 1).
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_SlaveConfigSynchro(TMR_HandleTypeDef *htmr, TMR_SlaveConfigTypeDef *sSlaveConfig)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_SLAVE_INSTANCE(htmr->Instance));
  ASSERT_PARAM(IS_TMR_SLAVE_MODE(sSlaveConfig->SlaveMode));
  ASSERT_PARAM(IS_TMR_TRIGGER_SELECTION(sSlaveConfig->InputTrigger));

  __DAL_LOCK(htmr);

  htmr->State = DAL_TMR_STATE_BUSY;

  if (TMR_SlaveTimer_SetConfig(htmr, sSlaveConfig) != DAL_OK)
  {
    htmr->State = DAL_TMR_STATE_READY;
    __DAL_UNLOCK(htmr);
    return DAL_ERROR;
  }

  /* Disable Trigger Interrupt */
  __DAL_TMR_DISABLE_IT(htmr, TMR_IT_TRIGGER);

  /* Disable Trigger DMA request */
  __DAL_TMR_DISABLE_DMA(htmr, TMR_DMA_TRIGGER);

  htmr->State = DAL_TMR_STATE_READY;

  __DAL_UNLOCK(htmr);

  return DAL_OK;
}

/**
  * @brief  Configures the TMR in Slave mode in interrupt mode
  * @param  htmr TMR handle.
  * @param  sSlaveConfig pointer to a TMR_SlaveConfigTypeDef structure that
  *         contains the selected trigger (internal trigger input, filtered
  *         timer input or external trigger input) and the Slave mode
  *         (Disable, Reset, Gated, Trigger, External clock mode 1).
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMR_SlaveConfigSynchro_IT(TMR_HandleTypeDef *htmr,
                                                TMR_SlaveConfigTypeDef *sSlaveConfig)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_SLAVE_INSTANCE(htmr->Instance));
  ASSERT_PARAM(IS_TMR_SLAVE_MODE(sSlaveConfig->SlaveMode));
  ASSERT_PARAM(IS_TMR_TRIGGER_SELECTION(sSlaveConfig->InputTrigger));

  __DAL_LOCK(htmr);

  htmr->State = DAL_TMR_STATE_BUSY;

  if (TMR_SlaveTimer_SetConfig(htmr, sSlaveConfig) != DAL_OK)
  {
    htmr->State = DAL_TMR_STATE_READY;
    __DAL_UNLOCK(htmr);
    return DAL_ERROR;
  }

  /* Enable Trigger Interrupt */
  __DAL_TMR_ENABLE_IT(htmr, TMR_IT_TRIGGER);

  /* Disable Trigger DMA request */
  __DAL_TMR_DISABLE_DMA(htmr, TMR_DMA_TRIGGER);

  htmr->State = DAL_TMR_STATE_READY;

  __DAL_UNLOCK(htmr);

  return DAL_OK;
}

/**
  * @brief  Read the captured value from Capture Compare unit
  * @param  htmr TMR handle.
  * @param  Channel TMR Channels to be enabled
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1 selected
  *            @arg TMR_CHANNEL_2: TMR Channel 2 selected
  *            @arg TMR_CHANNEL_3: TMR Channel 3 selected
  *            @arg TMR_CHANNEL_4: TMR Channel 4 selected
  * @retval Captured value
  */
uint32_t DAL_TMR_ReadCapturedValue(TMR_HandleTypeDef *htmr, uint32_t Channel)
{
  uint32_t tmpreg = 0U;

  switch (Channel)
  {
    case TMR_CHANNEL_1:
    {
      /* Check the parameters */
      ASSERT_PARAM(IS_TMR_CC1_INSTANCE(htmr->Instance));

      /* Return the capture 1 value */
      tmpreg =  htmr->Instance->CC1;

      break;
    }
    case TMR_CHANNEL_2:
    {
      /* Check the parameters */
      ASSERT_PARAM(IS_TMR_CC2_INSTANCE(htmr->Instance));

      /* Return the capture 2 value */
      tmpreg =   htmr->Instance->CC2;

      break;
    }

    case TMR_CHANNEL_3:
    {
      /* Check the parameters */
      ASSERT_PARAM(IS_TMR_CC3_INSTANCE(htmr->Instance));

