betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_tmr.c
      /* Return the capture 3 value */
      tmpreg =   htmr->Instance->CC3;

      break;
    }

    case TMR_CHANNEL_4:
    {
      /* Check the parameters */
      ASSERT_PARAM(IS_TMR_CC4_INSTANCE(htmr->Instance));

      /* Return the capture 4 value */
      tmpreg =   htmr->Instance->CC4;

      break;
    }

    default:
      break;
  }

  return tmpreg;
}

/**
  * @}
  */

/** @defgroup TMR_Exported_Functions_Group9 TMR Callbacks functions
  *  @brief    TMR Callbacks functions
  *
@verbatim
  ==============================================================================
                        ##### TMR Callbacks functions #####
  ==============================================================================
 [..]
   This section provides TMR callback functions:
   (+) TMR Period elapsed callback
   (+) TMR Output Compare callback
   (+) TMR Input capture callback
   (+) TMR Trigger callback
   (+) TMR Error callback

@endverbatim
  * @{
  */

/**
  * @brief  Period elapsed callback in non-blocking mode
  * @param  htmr TMR handle
  * @retval None
  */
__weak void DAL_TMR_PeriodElapsedCallback(TMR_HandleTypeDef *htmr)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(htmr);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_TMR_PeriodElapsedCallback could be implemented in the user file
   */
}

/**
  * @brief  Period elapsed half complete callback in non-blocking mode
  * @param  htmr TMR handle
  * @retval None
  */
__weak void DAL_TMR_PeriodElapsedHalfCpltCallback(TMR_HandleTypeDef *htmr)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(htmr);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_TMR_PeriodElapsedHalfCpltCallback could be implemented in the user file
   */
}

/**
  * @brief  Output Compare callback in non-blocking mode
  * @param  htmr TMR OC handle
  * @retval None
  */
__weak void DAL_TMR_OC_DelayElapsedCallback(TMR_HandleTypeDef *htmr)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(htmr);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_TMR_OC_DelayElapsedCallback could be implemented in the user file
   */
}

/**
  * @brief  Input Capture callback in non-blocking mode
  * @param  htmr TMR IC handle
  * @retval None
  */
__weak void DAL_TMR_IC_CaptureCallback(TMR_HandleTypeDef *htmr)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(htmr);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_TMR_IC_CaptureCallback could be implemented in the user file
   */
}

/**
  * @brief  Input Capture half complete callback in non-blocking mode
  * @param  htmr TMR IC handle
  * @retval None
  */
__weak void DAL_TMR_IC_CaptureHalfCpltCallback(TMR_HandleTypeDef *htmr)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(htmr);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_TMR_IC_CaptureHalfCpltCallback could be implemented in the user file
   */
}

/**
  * @brief  PWM Pulse finished callback in non-blocking mode
  * @param  htmr TMR handle
  * @retval None
  */
__weak void DAL_TMR_PWM_PulseFinishedCallback(TMR_HandleTypeDef *htmr)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(htmr);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_TMR_PWM_PulseFinishedCallback could be implemented in the user file
   */
}

/**
  * @brief  PWM Pulse finished half complete callback in non-blocking mode
  * @param  htmr TMR handle
  * @retval None
  */
__weak void DAL_TMR_PWM_PulseFinishedHalfCpltCallback(TMR_HandleTypeDef *htmr)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(htmr);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_TMR_PWM_PulseFinishedHalfCpltCallback could be implemented in the user file
   */
}

/**
  * @brief  Hall Trigger detection callback in non-blocking mode
  * @param  htmr TMR handle
  * @retval None
  */
__weak void DAL_TMR_TriggerCallback(TMR_HandleTypeDef *htmr)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(htmr);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_TMR_TriggerCallback could be implemented in the user file
   */
}

/**
  * @brief  Hall Trigger detection half complete callback in non-blocking mode
  * @param  htmr TMR handle
  * @retval None
  */
__weak void DAL_TMR_TriggerHalfCpltCallback(TMR_HandleTypeDef *htmr)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(htmr);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_TMR_TriggerHalfCpltCallback could be implemented in the user file
   */
}

/**
  * @brief  Timer error callback in non-blocking mode
  * @param  htmr TMR handle
  * @retval None
  */
__weak void DAL_TMR_ErrorCallback(TMR_HandleTypeDef *htmr)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(htmr);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_TMR_ErrorCallback could be implemented in the user file
   */
}

#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register a User TMR callback to be used instead of the weak predefined callback
  * @param htmr tim handle
  * @param CallbackID ID of the callback to be registered
  *        This parameter can be one of the following values:
  *          @arg @ref DAL_TMR_BASE_MSPINIT_CB_ID Base MspInit Callback ID
  *          @arg @ref DAL_TMR_BASE_MSPDEINIT_CB_ID Base MspDeInit Callback ID
  *          @arg @ref DAL_TMR_IC_MSPINIT_CB_ID IC MspInit Callback ID
  *          @arg @ref DAL_TMR_IC_MSPDEINIT_CB_ID IC MspDeInit Callback ID
  *          @arg @ref DAL_TMR_OC_MSPINIT_CB_ID OC MspInit Callback ID
  *          @arg @ref DAL_TMR_OC_MSPDEINIT_CB_ID OC MspDeInit Callback ID
  *          @arg @ref DAL_TMR_PWM_MSPINIT_CB_ID PWM MspInit Callback ID
  *          @arg @ref DAL_TMR_PWM_MSPDEINIT_CB_ID PWM MspDeInit Callback ID
  *          @arg @ref DAL_TMR_ONE_PULSE_MSPINIT_CB_ID One Pulse MspInit Callback ID
  *          @arg @ref DAL_TMR_ONE_PULSE_MSPDEINIT_CB_ID One Pulse MspDeInit Callback ID
  *          @arg @ref DAL_TMR_ENCODER_MSPINIT_CB_ID Encoder MspInit Callback ID
  *          @arg @ref DAL_TMR_ENCODER_MSPDEINIT_CB_ID Encoder MspDeInit Callback ID
  *          @arg @ref DAL_TMR_HALL_SENSOR_MSPINIT_CB_ID Hall Sensor MspInit Callback ID
  *          @arg @ref DAL_TMR_HALL_SENSOR_MSPDEINIT_CB_ID Hall Sensor MspDeInit Callback ID
  *          @arg @ref DAL_TMR_PERIOD_ELAPSED_CB_ID Period Elapsed Callback ID
  *          @arg @ref DAL_TMR_PERIOD_ELAPSED_HALF_CB_ID Period Elapsed half complete Callback ID
  *          @arg @ref DAL_TMR_TRIGGER_CB_ID Trigger Callback ID
  *          @arg @ref DAL_TMR_TRIGGER_HALF_CB_ID Trigger half complete Callback ID
  *          @arg @ref DAL_TMR_IC_CAPTURE_CB_ID Input Capture Callback ID
  *          @arg @ref DAL_TMR_IC_CAPTURE_HALF_CB_ID Input Capture half complete Callback ID
  *          @arg @ref DAL_TMR_OC_DELAY_ELAPSED_CB_ID Output Compare Delay Elapsed Callback ID
  *          @arg @ref DAL_TMR_PWM_PULSE_FINISHED_CB_ID PWM Pulse Finished Callback ID
  *          @arg @ref DAL_TMR_PWM_PULSE_FINISHED_HALF_CB_ID PWM Pulse Finished half complete Callback ID
  *          @arg @ref DAL_TMR_ERROR_CB_ID Error Callback ID
  *          @arg @ref DAL_TMR_COMMUTATION_CB_ID Commutation Callback ID
  *          @arg @ref DAL_TMR_COMMUTATION_HALF_CB_ID Commutation half complete Callback ID
  *          @arg @ref DAL_TMR_BREAK_CB_ID Break Callback ID
  *          @param pCallback pointer to the callback function
  *          @retval status
  */
DAL_StatusTypeDef DAL_TMR_RegisterCallback(TMR_HandleTypeDef *htmr, DAL_TMR_CallbackIDTypeDef CallbackID,
                                           pTMR_CallbackTypeDef pCallback)
{
  DAL_StatusTypeDef status = DAL_OK;

  if (pCallback == NULL)
  {
    return DAL_ERROR;
  }

  if (htmr->State == DAL_TMR_STATE_READY)
  {
    switch (CallbackID)
    {
      case DAL_TMR_BASE_MSPINIT_CB_ID :
        htmr->Base_MspInitCallback                 = pCallback;
        break;

      case DAL_TMR_BASE_MSPDEINIT_CB_ID :
        htmr->Base_MspDeInitCallback               = pCallback;
        break;

      case DAL_TMR_IC_MSPINIT_CB_ID :
        htmr->IC_MspInitCallback                   = pCallback;
        break;

