betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_tmr.c
      case DAL_TMR_IC_MSPDEINIT_CB_ID :
        htmr->IC_MspDeInitCallback                 = pCallback;
        break;

      case DAL_TMR_OC_MSPINIT_CB_ID :
        htmr->OC_MspInitCallback                   = pCallback;
        break;

      case DAL_TMR_OC_MSPDEINIT_CB_ID :
        htmr->OC_MspDeInitCallback                 = pCallback;
        break;

      case DAL_TMR_PWM_MSPINIT_CB_ID :
        htmr->PWM_MspInitCallback                  = pCallback;
        break;

      case DAL_TMR_PWM_MSPDEINIT_CB_ID :
        htmr->PWM_MspDeInitCallback                = pCallback;
        break;

      case DAL_TMR_ONE_PULSE_MSPINIT_CB_ID :
        htmr->OnePulse_MspInitCallback             = pCallback;
        break;

      case DAL_TMR_ONE_PULSE_MSPDEINIT_CB_ID :
        htmr->OnePulse_MspDeInitCallback           = pCallback;
        break;

      case DAL_TMR_ENCODER_MSPINIT_CB_ID :
        htmr->Encoder_MspInitCallback              = pCallback;
        break;

      case DAL_TMR_ENCODER_MSPDEINIT_CB_ID :
        htmr->Encoder_MspDeInitCallback            = pCallback;
        break;

      case DAL_TMR_HALL_SENSOR_MSPINIT_CB_ID :
        htmr->HallSensor_MspInitCallback           = pCallback;
        break;

      case DAL_TMR_HALL_SENSOR_MSPDEINIT_CB_ID :
        htmr->HallSensor_MspDeInitCallback         = pCallback;
        break;

      case DAL_TMR_PERIOD_ELAPSED_CB_ID :
        htmr->PeriodElapsedCallback                = pCallback;
        break;

      case DAL_TMR_PERIOD_ELAPSED_HALF_CB_ID :
        htmr->PeriodElapsedHalfCpltCallback        = pCallback;
        break;

      case DAL_TMR_TRIGGER_CB_ID :
        htmr->TriggerCallback                      = pCallback;
        break;

      case DAL_TMR_TRIGGER_HALF_CB_ID :
        htmr->TriggerHalfCpltCallback              = pCallback;
        break;

      case DAL_TMR_IC_CAPTURE_CB_ID :
        htmr->IC_CaptureCallback                   = pCallback;
        break;

      case DAL_TMR_IC_CAPTURE_HALF_CB_ID :
        htmr->IC_CaptureHalfCpltCallback           = pCallback;
        break;

      case DAL_TMR_OC_DELAY_ELAPSED_CB_ID :
        htmr->OC_DelayElapsedCallback              = pCallback;
        break;

      case DAL_TMR_PWM_PULSE_FINISHED_CB_ID :
        htmr->PWM_PulseFinishedCallback            = pCallback;
        break;

      case DAL_TMR_PWM_PULSE_FINISHED_HALF_CB_ID :
        htmr->PWM_PulseFinishedHalfCpltCallback    = pCallback;
        break;

      case DAL_TMR_ERROR_CB_ID :
        htmr->ErrorCallback                        = pCallback;
        break;

      case DAL_TMR_COMMUTATION_CB_ID :
        htmr->CommutationCallback                  = pCallback;
        break;

      case DAL_TMR_COMMUTATION_HALF_CB_ID :
        htmr->CommutationHalfCpltCallback          = pCallback;
        break;

      case DAL_TMR_BREAK_CB_ID :
        htmr->BreakCallback                        = pCallback;
        break;

      default :
        /* Return error status */
        status = DAL_ERROR;
        break;
    }
  }
  else if (htmr->State == DAL_TMR_STATE_RESET)
  {
    switch (CallbackID)
    {
      case DAL_TMR_BASE_MSPINIT_CB_ID :
        htmr->Base_MspInitCallback         = pCallback;
        break;

      case DAL_TMR_BASE_MSPDEINIT_CB_ID :
        htmr->Base_MspDeInitCallback       = pCallback;
        break;

      case DAL_TMR_IC_MSPINIT_CB_ID :
        htmr->IC_MspInitCallback           = pCallback;
        break;

      case DAL_TMR_IC_MSPDEINIT_CB_ID :
        htmr->IC_MspDeInitCallback         = pCallback;
        break;

      case DAL_TMR_OC_MSPINIT_CB_ID :
        htmr->OC_MspInitCallback           = pCallback;
        break;

      case DAL_TMR_OC_MSPDEINIT_CB_ID :
        htmr->OC_MspDeInitCallback         = pCallback;
        break;

      case DAL_TMR_PWM_MSPINIT_CB_ID :
        htmr->PWM_MspInitCallback          = pCallback;
        break;

      case DAL_TMR_PWM_MSPDEINIT_CB_ID :
        htmr->PWM_MspDeInitCallback        = pCallback;
        break;

      case DAL_TMR_ONE_PULSE_MSPINIT_CB_ID :
        htmr->OnePulse_MspInitCallback     = pCallback;
        break;

      case DAL_TMR_ONE_PULSE_MSPDEINIT_CB_ID :
        htmr->OnePulse_MspDeInitCallback   = pCallback;
        break;

      case DAL_TMR_ENCODER_MSPINIT_CB_ID :
        htmr->Encoder_MspInitCallback      = pCallback;
        break;

      case DAL_TMR_ENCODER_MSPDEINIT_CB_ID :
        htmr->Encoder_MspDeInitCallback    = pCallback;
        break;

      case DAL_TMR_HALL_SENSOR_MSPINIT_CB_ID :
        htmr->HallSensor_MspInitCallback   = pCallback;
        break;

      case DAL_TMR_HALL_SENSOR_MSPDEINIT_CB_ID :
        htmr->HallSensor_MspDeInitCallback = pCallback;
        break;

      default :
        /* Return error status */
        status = DAL_ERROR;
        break;
    }
  }
  else
  {
    /* Return error status */
    status = DAL_ERROR;
  }

  return status;
}

/**
  * @brief  Unregister a TMR callback
  *         TMR callback is redirected to the weak predefined callback
  * @param htmr tim handle
  * @param CallbackID ID of the callback to be unregistered
  *        This parameter can be one of the following values:
  *          @arg @ref DAL_TMR_BASE_MSPINIT_CB_ID Base MspInit Callback ID
  *          @arg @ref DAL_TMR_BASE_MSPDEINIT_CB_ID Base MspDeInit Callback ID
  *          @arg @ref DAL_TMR_IC_MSPINIT_CB_ID IC MspInit Callback ID
  *          @arg @ref DAL_TMR_IC_MSPDEINIT_CB_ID IC MspDeInit Callback ID
  *          @arg @ref DAL_TMR_OC_MSPINIT_CB_ID OC MspInit Callback ID
  *          @arg @ref DAL_TMR_OC_MSPDEINIT_CB_ID OC MspDeInit Callback ID
  *          @arg @ref DAL_TMR_PWM_MSPINIT_CB_ID PWM MspInit Callback ID
  *          @arg @ref DAL_TMR_PWM_MSPDEINIT_CB_ID PWM MspDeInit Callback ID
  *          @arg @ref DAL_TMR_ONE_PULSE_MSPINIT_CB_ID One Pulse MspInit Callback ID
  *          @arg @ref DAL_TMR_ONE_PULSE_MSPDEINIT_CB_ID One Pulse MspDeInit Callback ID
  *          @arg @ref DAL_TMR_ENCODER_MSPINIT_CB_ID Encoder MspInit Callback ID
  *          @arg @ref DAL_TMR_ENCODER_MSPDEINIT_CB_ID Encoder MspDeInit Callback ID
  *          @arg @ref DAL_TMR_HALL_SENSOR_MSPINIT_CB_ID Hall Sensor MspInit Callback ID
  *          @arg @ref DAL_TMR_HALL_SENSOR_MSPDEINIT_CB_ID Hall Sensor MspDeInit Callback ID
  *          @arg @ref DAL_TMR_PERIOD_ELAPSED_CB_ID Period Elapsed Callback ID
  *          @arg @ref DAL_TMR_PERIOD_ELAPSED_HALF_CB_ID Period Elapsed half complete Callback ID
  *          @arg @ref DAL_TMR_TRIGGER_CB_ID Trigger Callback ID
  *          @arg @ref DAL_TMR_TRIGGER_HALF_CB_ID Trigger half complete Callback ID
  *          @arg @ref DAL_TMR_IC_CAPTURE_CB_ID Input Capture Callback ID
  *          @arg @ref DAL_TMR_IC_CAPTURE_HALF_CB_ID Input Capture half complete Callback ID
  *          @arg @ref DAL_TMR_OC_DELAY_ELAPSED_CB_ID Output Compare Delay Elapsed Callback ID
  *          @arg @ref DAL_TMR_PWM_PULSE_FINISHED_CB_ID PWM Pulse Finished Callback ID
  *          @arg @ref DAL_TMR_PWM_PULSE_FINISHED_HALF_CB_ID PWM Pulse Finished half complete Callback ID
  *          @arg @ref DAL_TMR_ERROR_CB_ID Error Callback ID
  *          @arg @ref DAL_TMR_COMMUTATION_CB_ID Commutation Callback ID
  *          @arg @ref DAL_TMR_COMMUTATION_HALF_CB_ID Commutation half complete Callback ID
  *          @arg @ref DAL_TMR_BREAK_CB_ID Break Callback ID
  *          @retval status
  */
DAL_StatusTypeDef DAL_TMR_UnRegisterCallback(TMR_HandleTypeDef *htmr, DAL_TMR_CallbackIDTypeDef CallbackID)
{
  DAL_StatusTypeDef status = DAL_OK;

  if (htmr->State == DAL_TMR_STATE_READY)
  {
    switch (CallbackID)
    {
      case DAL_TMR_BASE_MSPINIT_CB_ID :
        /* Legacy weak Base MspInit Callback */
        htmr->Base_MspInitCallback              = DAL_TMR_Base_MspInit;
        break;

      case DAL_TMR_BASE_MSPDEINIT_CB_ID :
        /* Legacy weak Base Msp DeInit Callback */
        htmr->Base_MspDeInitCallback            = DAL_TMR_Base_MspDeInit;
        break;

      case DAL_TMR_IC_MSPINIT_CB_ID :
        /* Legacy weak IC Msp Init Callback */
        htmr->IC_MspInitCallback                = DAL_TMR_IC_MspInit;
        break;

