betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_tmr.c
      case DAL_TMR_IC_MSPDEINIT_CB_ID :
        /* Legacy weak IC Msp DeInit Callback */
        htmr->IC_MspDeInitCallback              = DAL_TMR_IC_MspDeInit;
        break;

      case DAL_TMR_OC_MSPINIT_CB_ID :
        /* Legacy weak OC Msp Init Callback */
        htmr->OC_MspInitCallback                = DAL_TMR_OC_MspInit;
        break;

      case DAL_TMR_OC_MSPDEINIT_CB_ID :
        /* Legacy weak OC Msp DeInit Callback */
        htmr->OC_MspDeInitCallback              = DAL_TMR_OC_MspDeInit;
        break;

      case DAL_TMR_PWM_MSPINIT_CB_ID :
        /* Legacy weak PWM Msp Init Callback */
        htmr->PWM_MspInitCallback               = DAL_TMR_PWM_MspInit;
        break;

      case DAL_TMR_PWM_MSPDEINIT_CB_ID :
        /* Legacy weak PWM Msp DeInit Callback */
        htmr->PWM_MspDeInitCallback             = DAL_TMR_PWM_MspDeInit;
        break;

      case DAL_TMR_ONE_PULSE_MSPINIT_CB_ID :
        /* Legacy weak One Pulse Msp Init Callback */
        htmr->OnePulse_MspInitCallback          = DAL_TMR_OnePulse_MspInit;
        break;

      case DAL_TMR_ONE_PULSE_MSPDEINIT_CB_ID :
        /* Legacy weak One Pulse Msp DeInit Callback */
        htmr->OnePulse_MspDeInitCallback        = DAL_TMR_OnePulse_MspDeInit;
        break;

      case DAL_TMR_ENCODER_MSPINIT_CB_ID :
        /* Legacy weak Encoder Msp Init Callback */
        htmr->Encoder_MspInitCallback           = DAL_TMR_Encoder_MspInit;
        break;

      case DAL_TMR_ENCODER_MSPDEINIT_CB_ID :
        /* Legacy weak Encoder Msp DeInit Callback */
        htmr->Encoder_MspDeInitCallback         = DAL_TMR_Encoder_MspDeInit;
        break;

      case DAL_TMR_HALL_SENSOR_MSPINIT_CB_ID :
        /* Legacy weak Hall Sensor Msp Init Callback */
        htmr->HallSensor_MspInitCallback        = DAL_TMREx_HallSensor_MspInit;
        break;

      case DAL_TMR_HALL_SENSOR_MSPDEINIT_CB_ID :
        /* Legacy weak Hall Sensor Msp DeInit Callback */
        htmr->HallSensor_MspDeInitCallback      = DAL_TMREx_HallSensor_MspDeInit;
        break;

      case DAL_TMR_PERIOD_ELAPSED_CB_ID :
        /* Legacy weak Period Elapsed Callback */
        htmr->PeriodElapsedCallback             = DAL_TMR_PeriodElapsedCallback;
        break;

      case DAL_TMR_PERIOD_ELAPSED_HALF_CB_ID :
        /* Legacy weak Period Elapsed half complete Callback */
        htmr->PeriodElapsedHalfCpltCallback     = DAL_TMR_PeriodElapsedHalfCpltCallback;
        break;

      case DAL_TMR_TRIGGER_CB_ID :
        /* Legacy weak Trigger Callback */
        htmr->TriggerCallback                   = DAL_TMR_TriggerCallback;
        break;

      case DAL_TMR_TRIGGER_HALF_CB_ID :
        /* Legacy weak Trigger half complete Callback */
        htmr->TriggerHalfCpltCallback           = DAL_TMR_TriggerHalfCpltCallback;
        break;

      case DAL_TMR_IC_CAPTURE_CB_ID :
        /* Legacy weak IC Capture Callback */
        htmr->IC_CaptureCallback                = DAL_TMR_IC_CaptureCallback;
        break;

      case DAL_TMR_IC_CAPTURE_HALF_CB_ID :
        /* Legacy weak IC Capture half complete Callback */
        htmr->IC_CaptureHalfCpltCallback        = DAL_TMR_IC_CaptureHalfCpltCallback;
        break;

      case DAL_TMR_OC_DELAY_ELAPSED_CB_ID :
        /* Legacy weak OC Delay Elapsed Callback */
        htmr->OC_DelayElapsedCallback           = DAL_TMR_OC_DelayElapsedCallback;
        break;

      case DAL_TMR_PWM_PULSE_FINISHED_CB_ID :
        /* Legacy weak PWM Pulse Finished Callback */
        htmr->PWM_PulseFinishedCallback         = DAL_TMR_PWM_PulseFinishedCallback;
        break;

      case DAL_TMR_PWM_PULSE_FINISHED_HALF_CB_ID :
        /* Legacy weak PWM Pulse Finished half complete Callback */
        htmr->PWM_PulseFinishedHalfCpltCallback = DAL_TMR_PWM_PulseFinishedHalfCpltCallback;
        break;

      case DAL_TMR_ERROR_CB_ID :
        /* Legacy weak Error Callback */
        htmr->ErrorCallback                     = DAL_TMR_ErrorCallback;
        break;

      case DAL_TMR_COMMUTATION_CB_ID :
        /* Legacy weak Commutation Callback */
        htmr->CommutationCallback               = DAL_TMREx_CommutCallback;
        break;

      case DAL_TMR_COMMUTATION_HALF_CB_ID :
        /* Legacy weak Commutation half complete Callback */
        htmr->CommutationHalfCpltCallback       = DAL_TMREx_CommutHalfCpltCallback;
        break;

      case DAL_TMR_BREAK_CB_ID :
        /* Legacy weak Break Callback */
        htmr->BreakCallback                     = DAL_TMREx_BreakCallback;
        break;

      default :
        /* Return error status */
        status = DAL_ERROR;
        break;
    }
  }
  else if (htmr->State == DAL_TMR_STATE_RESET)
  {
    switch (CallbackID)
    {
      case DAL_TMR_BASE_MSPINIT_CB_ID :
        /* Legacy weak Base MspInit Callback */
        htmr->Base_MspInitCallback         = DAL_TMR_Base_MspInit;
        break;

      case DAL_TMR_BASE_MSPDEINIT_CB_ID :
        /* Legacy weak Base Msp DeInit Callback */
        htmr->Base_MspDeInitCallback       = DAL_TMR_Base_MspDeInit;
        break;

      case DAL_TMR_IC_MSPINIT_CB_ID :
        /* Legacy weak IC Msp Init Callback */
        htmr->IC_MspInitCallback           = DAL_TMR_IC_MspInit;
        break;

      case DAL_TMR_IC_MSPDEINIT_CB_ID :
        /* Legacy weak IC Msp DeInit Callback */
        htmr->IC_MspDeInitCallback         = DAL_TMR_IC_MspDeInit;
        break;

      case DAL_TMR_OC_MSPINIT_CB_ID :
        /* Legacy weak OC Msp Init Callback */
        htmr->OC_MspInitCallback           = DAL_TMR_OC_MspInit;
        break;

      case DAL_TMR_OC_MSPDEINIT_CB_ID :
        /* Legacy weak OC Msp DeInit Callback */
        htmr->OC_MspDeInitCallback         = DAL_TMR_OC_MspDeInit;
        break;

      case DAL_TMR_PWM_MSPINIT_CB_ID :
        /* Legacy weak PWM Msp Init Callback */
        htmr->PWM_MspInitCallback          = DAL_TMR_PWM_MspInit;
        break;

      case DAL_TMR_PWM_MSPDEINIT_CB_ID :
        /* Legacy weak PWM Msp DeInit Callback */
        htmr->PWM_MspDeInitCallback        = DAL_TMR_PWM_MspDeInit;
        break;

      case DAL_TMR_ONE_PULSE_MSPINIT_CB_ID :
        /* Legacy weak One Pulse Msp Init Callback */
        htmr->OnePulse_MspInitCallback     = DAL_TMR_OnePulse_MspInit;
        break;

      case DAL_TMR_ONE_PULSE_MSPDEINIT_CB_ID :
        /* Legacy weak One Pulse Msp DeInit Callback */
        htmr->OnePulse_MspDeInitCallback   = DAL_TMR_OnePulse_MspDeInit;
        break;

