betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_tmr.c
      case DAL_TMR_ENCODER_MSPINIT_CB_ID :
        /* Legacy weak Encoder Msp Init Callback */
        htmr->Encoder_MspInitCallback      = DAL_TMR_Encoder_MspInit;
        break;

      case DAL_TMR_ENCODER_MSPDEINIT_CB_ID :
        /* Legacy weak Encoder Msp DeInit Callback */
        htmr->Encoder_MspDeInitCallback    = DAL_TMR_Encoder_MspDeInit;
        break;

      case DAL_TMR_HALL_SENSOR_MSPINIT_CB_ID :
        /* Legacy weak Hall Sensor Msp Init Callback */
        htmr->HallSensor_MspInitCallback   = DAL_TMREx_HallSensor_MspInit;
        break;

      case DAL_TMR_HALL_SENSOR_MSPDEINIT_CB_ID :
        /* Legacy weak Hall Sensor Msp DeInit Callback */
        htmr->HallSensor_MspDeInitCallback = DAL_TMREx_HallSensor_MspDeInit;
        break;

      default :
        /* Return error status */
        status = DAL_ERROR;
        break;
    }
  }
  else
  {
    /* Return error status */
    status = DAL_ERROR;
  }

  return status;
}
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @defgroup TMR_Exported_Functions_Group10 TMR Peripheral State functions
  *  @brief   TMR Peripheral State functions
  *
@verbatim
  ==============================================================================
                        ##### Peripheral State functions #####
  ==============================================================================
    [..]
    This subsection permits to get in run-time the status of the peripheral
    and the data flow.

@endverbatim
  * @{
  */

/**
  * @brief  Return the TMR Base handle state.
  * @param  htmr TMR Base handle
  * @retval DAL state
  */
DAL_TMR_StateTypeDef DAL_TMR_Base_GetState(TMR_HandleTypeDef *htmr)
{
  return htmr->State;
}

/**
  * @brief  Return the TMR OC handle state.
  * @param  htmr TMR Output Compare handle
  * @retval DAL state
  */
DAL_TMR_StateTypeDef DAL_TMR_OC_GetState(TMR_HandleTypeDef *htmr)
{
  return htmr->State;
}

/**
  * @brief  Return the TMR PWM handle state.
  * @param  htmr TMR handle
  * @retval DAL state
  */
DAL_TMR_StateTypeDef DAL_TMR_PWM_GetState(TMR_HandleTypeDef *htmr)
{
  return htmr->State;
}

/**
  * @brief  Return the TMR Input Capture handle state.
  * @param  htmr TMR IC handle
  * @retval DAL state
  */
DAL_TMR_StateTypeDef DAL_TMR_IC_GetState(TMR_HandleTypeDef *htmr)
{
  return htmr->State;
}

/**
  * @brief  Return the TMR One Pulse Mode handle state.
  * @param  htmr TMR OPM handle
  * @retval DAL state
  */
DAL_TMR_StateTypeDef DAL_TMR_OnePulse_GetState(TMR_HandleTypeDef *htmr)
{
  return htmr->State;
}

/**
  * @brief  Return the TMR Encoder Mode handle state.
  * @param  htmr TMR Encoder Interface handle
  * @retval DAL state
  */
DAL_TMR_StateTypeDef DAL_TMR_Encoder_GetState(TMR_HandleTypeDef *htmr)
{
  return htmr->State;
}

/**
  * @brief  Return the TMR active channel.
  * @param  htmr TMR handle
  * @retval Active channel
  */
DAL_TMR_ActiveChannel DAL_TMR_GetActiveChannel(TMR_HandleTypeDef *htmr)
{
  return htmr->Channel;
}

/**
  * @brief  Return actual state of the TMR channel.
  * @param  htmr TMR handle
  * @param  Channel TMR Channel
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1
  *            @arg TMR_CHANNEL_2: TMR Channel 2
  *            @arg TMR_CHANNEL_3: TMR Channel 3
  *            @arg TMR_CHANNEL_4: TMR Channel 4
  *            @arg TMR_CHANNEL_5: TMR Channel 5
  *            @arg TMR_CHANNEL_6: TMR Channel 6
  * @retval TMR Channel state
  */
DAL_TMR_ChannelStateTypeDef DAL_TMR_GetChannelState(TMR_HandleTypeDef *htmr,  uint32_t Channel)
{
  DAL_TMR_ChannelStateTypeDef channel_state;

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_CCX_INSTANCE(htmr->Instance, Channel));

  channel_state = TMR_CHANNEL_STATE_GET(htmr, Channel);

  return channel_state;
}

/**
  * @brief  Return actual state of a DMA burst operation.
  * @param  htmr TMR handle
  * @retval DMA burst state
  */
DAL_TMR_DMABurstStateTypeDef DAL_TMR_DMABurstState(TMR_HandleTypeDef *htmr)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_DMABURST_INSTANCE(htmr->Instance));

  return htmr->DMABurstState;
}

/**
  * @}
  */

/**
  * @}
  */

/** @defgroup TMR_Private_Functions TMR Private Functions
  * @{
  */

/**
  * @brief  TMR DMA error callback
  * @param  hdma pointer to DMA handle.
  * @retval None
  */
void TMR_DMAError(DMA_HandleTypeDef *hdma)
{
  TMR_HandleTypeDef *htmr = (TMR_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

  if (hdma == htmr->hdma[TMR_DMA_ID_CC1])
  {
    htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_1;
    TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_READY);
  }
  else if (hdma == htmr->hdma[TMR_DMA_ID_CC2])
  {
    htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_2;
    TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_READY);
  }
  else if (hdma == htmr->hdma[TMR_DMA_ID_CC3])
  {
    htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_3;
    TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_3, DAL_TMR_CHANNEL_STATE_READY);
  }
  else if (hdma == htmr->hdma[TMR_DMA_ID_CC4])
  {
    htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_4;
    TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_4, DAL_TMR_CHANNEL_STATE_READY);
  }
  else
  {
    htmr->State = DAL_TMR_STATE_READY;
  }

#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
  htmr->ErrorCallback(htmr);
#else
  DAL_TMR_ErrorCallback(htmr);
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */

  htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_CLEARED;
}

/**
  * @brief  TMR DMA Delay Pulse complete callback.
  * @param  hdma pointer to DMA handle.
  * @retval None
  */
void TMR_DMADelayPulseCplt(DMA_HandleTypeDef *hdma)
{
  TMR_HandleTypeDef *htmr = (TMR_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

  if (hdma == htmr->hdma[TMR_DMA_ID_CC1])
  {
    htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_1;

    if (hdma->Init.Mode == DMA_NORMAL)
    {
      TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_READY);
    }
  }
  else if (hdma == htmr->hdma[TMR_DMA_ID_CC2])
  {
    htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_2;

    if (hdma->Init.Mode == DMA_NORMAL)
    {
      TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_READY);
    }
  }
  else if (hdma == htmr->hdma[TMR_DMA_ID_CC3])
  {
    htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_3;

    if (hdma->Init.Mode == DMA_NORMAL)
    {
      TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_3, DAL_TMR_CHANNEL_STATE_READY);
    }
  }
  else if (hdma == htmr->hdma[TMR_DMA_ID_CC4])
  {
    htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_4;

    if (hdma->Init.Mode == DMA_NORMAL)
    {
      TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_4, DAL_TMR_CHANNEL_STATE_READY);
    }
  }
  else
  {
    /* nothing to do */
  }

#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
  htmr->PWM_PulseFinishedCallback(htmr);
#else
  DAL_TMR_PWM_PulseFinishedCallback(htmr);
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */

  htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_CLEARED;
}

/**
  * @brief  TMR DMA Delay Pulse half complete callback.
  * @param  hdma pointer to DMA handle.
  * @retval None
  */
void TMR_DMADelayPulseHalfCplt(DMA_HandleTypeDef *hdma)
{
  TMR_HandleTypeDef *htmr = (TMR_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

  if (hdma == htmr->hdma[TMR_DMA_ID_CC1])
  {
    htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_1;
  }
  else if (hdma == htmr->hdma[TMR_DMA_ID_CC2])
  {
    htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_2;
  }
  else if (hdma == htmr->hdma[TMR_DMA_ID_CC3])
  {
    htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_3;
  }
  else if (hdma == htmr->hdma[TMR_DMA_ID_CC4])
  {
    htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_4;
  }
  else
  {
    /* nothing to do */
  }

#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
  htmr->PWM_PulseFinishedHalfCpltCallback(htmr);
#else
  DAL_TMR_PWM_PulseFinishedHalfCpltCallback(htmr);
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */

  htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_CLEARED;
}

/**
  * @brief  TMR DMA Capture complete callback.
  * @param  hdma pointer to DMA handle.
  * @retval None
  */
void TMR_DMACaptureCplt(DMA_HandleTypeDef *hdma)
{
  TMR_HandleTypeDef *htmr = (TMR_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

  if (hdma == htmr->hdma[TMR_DMA_ID_CC1])
  {
    htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_1;

    if (hdma->Init.Mode == DMA_NORMAL)
    {
      TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_READY);
      TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_READY);
    }
  }
  else if (hdma == htmr->hdma[TMR_DMA_ID_CC2])
  {
    htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_2;

    if (hdma->Init.Mode == DMA_NORMAL)
    {
      TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_READY);
      TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_READY);
    }
  }
  else if (hdma == htmr->hdma[TMR_DMA_ID_CC3])
  {
    htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_3;

    if (hdma->Init.Mode == DMA_NORMAL)
    {
      TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_3, DAL_TMR_CHANNEL_STATE_READY);
      TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_3, DAL_TMR_CHANNEL_STATE_READY);
    }
  }
  else if (hdma == htmr->hdma[TMR_DMA_ID_CC4])
  {
    htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_4;

    if (hdma->Init.Mode == DMA_NORMAL)
    {
      TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_4, DAL_TMR_CHANNEL_STATE_READY);
      TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_4, DAL_TMR_CHANNEL_STATE_READY);
    }
  }
  else
  {
    /* nothing to do */
  }

#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
  htmr->IC_CaptureCallback(htmr);
#else
  DAL_TMR_IC_CaptureCallback(htmr);
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */

  htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_CLEARED;
}

/**
  * @brief  TMR DMA Capture half complete callback.
  * @param  hdma pointer to DMA handle.
  * @retval None
  */
void TMR_DMACaptureHalfCplt(DMA_HandleTypeDef *hdma)
{
  TMR_HandleTypeDef *htmr = (TMR_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

  if (hdma == htmr->hdma[TMR_DMA_ID_CC1])
  {
    htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_1;
  }
  else if (hdma == htmr->hdma[TMR_DMA_ID_CC2])
  {
    htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_2;
  }
  else if (hdma == htmr->hdma[TMR_DMA_ID_CC3])
  {
    htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_3;
  }
  else if (hdma == htmr->hdma[TMR_DMA_ID_CC4])
  {
    htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_4;
  }
  else
  {
    /* nothing to do */
  }

#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
  htmr->IC_CaptureHalfCpltCallback(htmr);
#else
  DAL_TMR_IC_CaptureHalfCpltCallback(htmr);
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */

  htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_CLEARED;
}

/**
  * @brief  TMR DMA Period Elapse complete callback.
  * @param  hdma pointer to DMA handle.
  * @retval None
  */
static void TMR_DMAPeriodElapsedCplt(DMA_HandleTypeDef *hdma)
{
  TMR_HandleTypeDef *htmr = (TMR_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

