betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_tmr.c
  if (htmr->hdma[TMR_DMA_ID_UPDATE]->Init.Mode == DMA_NORMAL)
  {
    htmr->State = DAL_TMR_STATE_READY;
  }

#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
  htmr->PeriodElapsedCallback(htmr);
#else
  DAL_TMR_PeriodElapsedCallback(htmr);
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */
}

/**
  * @brief  TMR DMA Period Elapse half complete callback.
  * @param  hdma pointer to DMA handle.
  * @retval None
  */
static void TMR_DMAPeriodElapsedHalfCplt(DMA_HandleTypeDef *hdma)
{
  TMR_HandleTypeDef *htmr = (TMR_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
  htmr->PeriodElapsedHalfCpltCallback(htmr);
#else
  DAL_TMR_PeriodElapsedHalfCpltCallback(htmr);
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */
}

/**
  * @brief  TMR DMA Trigger callback.
  * @param  hdma pointer to DMA handle.
  * @retval None
  */
static void TMR_DMATriggerCplt(DMA_HandleTypeDef *hdma)
{
  TMR_HandleTypeDef *htmr = (TMR_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

  if (htmr->hdma[TMR_DMA_ID_TRIGGER]->Init.Mode == DMA_NORMAL)
  {
    htmr->State = DAL_TMR_STATE_READY;
  }

#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
  htmr->TriggerCallback(htmr);
#else
  DAL_TMR_TriggerCallback(htmr);
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */
}

/**
  * @brief  TMR DMA Trigger half complete callback.
  * @param  hdma pointer to DMA handle.
  * @retval None
  */
static void TMR_DMATriggerHalfCplt(DMA_HandleTypeDef *hdma)
{
  TMR_HandleTypeDef *htmr = (TMR_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
  htmr->TriggerHalfCpltCallback(htmr);
#else
  DAL_TMR_TriggerHalfCpltCallback(htmr);
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */
}

/**
  * @brief  Time Base configuration
  * @param  TMRx TMR peripheral
  * @param  Structure TMR Base configuration structure
  * @retval None
  */
void TMR_Base_SetConfig(TMR_TypeDef *TMRx, TMR_Base_InitTypeDef *Structure)
{
  uint32_t tmpcr1;
  tmpcr1 = TMRx->CTRL1;

  /* Set TMR Time Base Unit parameters ---------------------------------------*/
  if (IS_TMR_COUNTER_MODE_SELECT_INSTANCE(TMRx))
  {
    /* Select the Counter Mode */
    tmpcr1 &= ~(TMR_CTRL1_CNTDIR | TMR_CTRL1_CAMSEL);
    tmpcr1 |= Structure->CounterMode;
  }

  if (IS_TMR_CLOCK_DIVISION_INSTANCE(TMRx))
  {
    /* Set the clock division */
    tmpcr1 &= ~TMR_CTRL1_CLKDIV;
    tmpcr1 |= (uint32_t)Structure->ClockDivision;
  }

  /* Set the auto-reload preload */
  MODIFY_REG(tmpcr1, TMR_CTRL1_ARPEN, Structure->AutoReloadPreload);

  TMRx->CTRL1 = tmpcr1;

  /* Set the Autoreload value */
  TMRx->AUTORLD = (uint32_t)Structure->Period ;

  /* Set the Prescaler value */
  TMRx->PSC = Structure->Prescaler;

  if (IS_TMR_REPETITION_COUNTER_INSTANCE(TMRx))
  {
    /* Set the Repetition Counter value */
    TMRx->REPCNT = Structure->RepetitionCounter;
  }

  /* Generate an update event to reload the Prescaler
     and the repetition counter (only for advanced timer) value immediately */
  TMRx->CEG = TMR_CEG_UEG;

  /* Check if the update flag is set after the Update Generation, if so clear the UIF flag */
  if (DAL_IS_BIT_SET(TMRx->STS, TMR_FLAG_UPDATE))
  {
    /* Clear the update flag */
    CLEAR_BIT(TMRx->STS, TMR_FLAG_UPDATE);
  }
}

/**
  * @brief  Timer Output Compare 1 configuration
  * @param  TMRx to select the TMR peripheral
  * @param  OC_Config The output configuration structure
  * @retval None
  */
static void TMR_OC1_SetConfig(TMR_TypeDef *TMRx, TMR_OC_InitTypeDef *OC_Config)
{
  uint32_t tmpccmrx;
  uint32_t tmpccer;
  uint32_t tmpcr2;

  /* Get the TMRx CCEN register value */
  tmpccer = TMRx->CCEN;

  /* Disable the Channel 1: Reset the CC1EN Bit */
  TMRx->CCEN &= ~TMR_CCEN_CC1EN;

  /* Get the TMRx CTRL2 register value */
  tmpcr2 =  TMRx->CTRL2;

  /* Get the TMRx CCM1 register value */
  tmpccmrx = TMRx->CCM1;

  /* Reset the Output Compare Mode Bits */
  tmpccmrx &= ~TMR_CCM1_OC1MOD;
  tmpccmrx &= ~TMR_CCM1_CC1SEL;
  /* Select the Output Compare Mode */
  tmpccmrx |= OC_Config->OCMode;

  /* Reset the Output Polarity level */
  tmpccer &= ~TMR_CCEN_CC1POL;
  /* Set the Output Compare Polarity */
  tmpccer |= OC_Config->OCPolarity;

  if (IS_TMR_CCXN_INSTANCE(TMRx, TMR_CHANNEL_1))
  {
    /* Check parameters */
    ASSERT_PARAM(IS_TMR_OCN_POLARITY(OC_Config->OCNPolarity));

    /* Reset the Output N Polarity level */
    tmpccer &= ~TMR_CCEN_CC1NPOL;
    /* Set the Output N Polarity */
    tmpccer |= OC_Config->OCNPolarity;
    /* Reset the Output N State */
    tmpccer &= ~TMR_CCEN_CC1NEN;
  }

  if (IS_TMR_BREAK_INSTANCE(TMRx))
  {
    /* Check parameters */
    ASSERT_PARAM(IS_TMR_OCNIDLE_STATE(OC_Config->OCNIdleState));
    ASSERT_PARAM(IS_TMR_OCIDLE_STATE(OC_Config->OCIdleState));

    /* Reset the Output Compare and Output Compare N IDLE State */
    tmpcr2 &= ~TMR_CTRL2_OC1OIS;
    tmpcr2 &= ~TMR_CTRL2_OC1NOIS;
    /* Set the Output Idle state */
    tmpcr2 |= OC_Config->OCIdleState;
    /* Set the Output N Idle state */
    tmpcr2 |= OC_Config->OCNIdleState;
  }

  /* Write to TMRx CTRL2 */
  TMRx->CTRL2 = tmpcr2;

  /* Write to TMRx CCM1 */
  TMRx->CCM1 = tmpccmrx;

  /* Set the Capture Compare Register value */
  TMRx->CC1 = OC_Config->Pulse;

  /* Write to TMRx CCEN */
  TMRx->CCEN = tmpccer;
}

/**
  * @brief  Timer Output Compare 2 configuration
  * @param  TMRx to select the TMR peripheral
  * @param  OC_Config The output configuration structure
  * @retval None
  */
void TMR_OC2_SetConfig(TMR_TypeDef *TMRx, TMR_OC_InitTypeDef *OC_Config)
{
  uint32_t tmpccmrx;
  uint32_t tmpccer;
  uint32_t tmpcr2;

  /* Get the TMRx CCEN register value */
  tmpccer = TMRx->CCEN;

  /* Disable the Channel 2: Reset the CC2EN Bit */
  TMRx->CCEN &= ~TMR_CCEN_CC2EN;

  /* Get the TMRx CTRL2 register value */
  tmpcr2 =  TMRx->CTRL2;

  /* Get the TMRx CCM1 register value */
  tmpccmrx = TMRx->CCM1;

  /* Reset the Output Compare mode and Capture/Compare selection Bits */
  tmpccmrx &= ~TMR_CCM1_OC2MOD;
  tmpccmrx &= ~TMR_CCM1_CC2SEL;

  /* Select the Output Compare Mode */
  tmpccmrx |= (OC_Config->OCMode << 8U);

  /* Reset the Output Polarity level */
  tmpccer &= ~TMR_CCEN_CC2POL;
  /* Set the Output Compare Polarity */
  tmpccer |= (OC_Config->OCPolarity << 4U);

  if (IS_TMR_CCXN_INSTANCE(TMRx, TMR_CHANNEL_2))
  {
    ASSERT_PARAM(IS_TMR_OCN_POLARITY(OC_Config->OCNPolarity));

    /* Reset the Output N Polarity level */
    tmpccer &= ~TMR_CCEN_CC2NPOL;
    /* Set the Output N Polarity */
    tmpccer |= (OC_Config->OCNPolarity << 4U);
    /* Reset the Output N State */
    tmpccer &= ~TMR_CCEN_CC2NEN;

