betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_tmr.c
  }

  if (IS_TMR_BREAK_INSTANCE(TMRx))
  {
    /* Check parameters */
    ASSERT_PARAM(IS_TMR_OCNIDLE_STATE(OC_Config->OCNIdleState));
    ASSERT_PARAM(IS_TMR_OCIDLE_STATE(OC_Config->OCIdleState));

    /* Reset the Output Compare and Output Compare N IDLE State */
    tmpcr2 &= ~TMR_CTRL2_OC2OIS;
    tmpcr2 &= ~TMR_CTRL2_OC2NOIS;
    /* Set the Output Idle state */
    tmpcr2 |= (OC_Config->OCIdleState << 2U);
    /* Set the Output N Idle state */
    tmpcr2 |= (OC_Config->OCNIdleState << 2U);
  }

  /* Write to TMRx CTRL2 */
  TMRx->CTRL2 = tmpcr2;

  /* Write to TMRx CCM1 */
  TMRx->CCM1 = tmpccmrx;

  /* Set the Capture Compare Register value */
  TMRx->CC2 = OC_Config->Pulse;

  /* Write to TMRx CCEN */
  TMRx->CCEN = tmpccer;
}

/**
  * @brief  Timer Output Compare 3 configuration
  * @param  TMRx to select the TMR peripheral
  * @param  OC_Config The output configuration structure
  * @retval None
  */
static void TMR_OC3_SetConfig(TMR_TypeDef *TMRx, TMR_OC_InitTypeDef *OC_Config)
{
  uint32_t tmpccmrx;
  uint32_t tmpccer;
  uint32_t tmpcr2;

  /* Get the TMRx CCEN register value */
  tmpccer = TMRx->CCEN;

  /* Disable the Channel 3: Reset the CC3EN Bit */
  TMRx->CCEN &= ~TMR_CCEN_CC3EN;

  /* Get the TMRx CTRL2 register value */
  tmpcr2 =  TMRx->CTRL2;

  /* Get the TMRx CCM2 register value */
  tmpccmrx = TMRx->CCM2;

  /* Reset the Output Compare mode and Capture/Compare selection Bits */
  tmpccmrx &= ~TMR_CCM2_OC3MOD;
  tmpccmrx &= ~TMR_CCM2_CC3SEL;
  /* Select the Output Compare Mode */
  tmpccmrx |= OC_Config->OCMode;

  /* Reset the Output Polarity level */
  tmpccer &= ~TMR_CCEN_CC3POL;
  /* Set the Output Compare Polarity */
  tmpccer |= (OC_Config->OCPolarity << 8U);

  if (IS_TMR_CCXN_INSTANCE(TMRx, TMR_CHANNEL_3))
  {
    ASSERT_PARAM(IS_TMR_OCN_POLARITY(OC_Config->OCNPolarity));

    /* Reset the Output N Polarity level */
    tmpccer &= ~TMR_CCEN_CC3NPOL;
    /* Set the Output N Polarity */
    tmpccer |= (OC_Config->OCNPolarity << 8U);
    /* Reset the Output N State */
    tmpccer &= ~TMR_CCEN_CC3NEN;
  }

  if (IS_TMR_BREAK_INSTANCE(TMRx))
  {
    /* Check parameters */
    ASSERT_PARAM(IS_TMR_OCNIDLE_STATE(OC_Config->OCNIdleState));
    ASSERT_PARAM(IS_TMR_OCIDLE_STATE(OC_Config->OCIdleState));

    /* Reset the Output Compare and Output Compare N IDLE State */
    tmpcr2 &= ~TMR_CTRL2_OC3OIS;
    tmpcr2 &= ~TMR_CTRL2_OC3NOIS;
    /* Set the Output Idle state */
    tmpcr2 |= (OC_Config->OCIdleState << 4U);
    /* Set the Output N Idle state */
    tmpcr2 |= (OC_Config->OCNIdleState << 4U);
  }

  /* Write to TMRx CTRL2 */
  TMRx->CTRL2 = tmpcr2;

  /* Write to TMRx CCM2 */
  TMRx->CCM2 = tmpccmrx;

  /* Set the Capture Compare Register value */
  TMRx->CC3 = OC_Config->Pulse;

  /* Write to TMRx CCEN */
  TMRx->CCEN = tmpccer;
}

/**
  * @brief  Timer Output Compare 4 configuration
  * @param  TMRx to select the TMR peripheral
  * @param  OC_Config The output configuration structure
  * @retval None
  */
static void TMR_OC4_SetConfig(TMR_TypeDef *TMRx, TMR_OC_InitTypeDef *OC_Config)
{
  uint32_t tmpccmrx;
  uint32_t tmpccer;
  uint32_t tmpcr2;

  /* Get the TMRx CCEN register value */
  tmpccer = TMRx->CCEN;

  /* Disable the Channel 4: Reset the CC4EN Bit */
  TMRx->CCEN &= ~TMR_CCEN_CC4EN;

  /* Get the TMRx CTRL2 register value */
  tmpcr2 =  TMRx->CTRL2;

  /* Get the TMRx CCM2 register value */
  tmpccmrx = TMRx->CCM2;

  /* Reset the Output Compare mode and Capture/Compare selection Bits */
  tmpccmrx &= ~TMR_CCM2_OC4MOD;
  tmpccmrx &= ~TMR_CCM2_CC4SEL;

  /* Select the Output Compare Mode */
  tmpccmrx |= (OC_Config->OCMode << 8U);

  /* Reset the Output Polarity level */
  tmpccer &= ~TMR_CCEN_CC4POL;
  /* Set the Output Compare Polarity */
  tmpccer |= (OC_Config->OCPolarity << 12U);

  if (IS_TMR_BREAK_INSTANCE(TMRx))
  {
    /* Check parameters */
    ASSERT_PARAM(IS_TMR_OCIDLE_STATE(OC_Config->OCIdleState));

    /* Reset the Output Compare IDLE State */
    tmpcr2 &= ~TMR_CTRL2_OC4OIS;

    /* Set the Output Idle state */
    tmpcr2 |= (OC_Config->OCIdleState << 6U);
  }

  /* Write to TMRx CTRL2 */
  TMRx->CTRL2 = tmpcr2;

  /* Write to TMRx CCM2 */
  TMRx->CCM2 = tmpccmrx;

  /* Set the Capture Compare Register value */
  TMRx->CC4 = OC_Config->Pulse;

  /* Write to TMRx CCEN */
  TMRx->CCEN = tmpccer;
}

/**
  * @brief  Slave Timer configuration function
  * @param  htmr TMR handle
  * @param  sSlaveConfig Slave timer configuration
  * @retval None
  */
static DAL_StatusTypeDef TMR_SlaveTimer_SetConfig(TMR_HandleTypeDef *htmr,
                                                  TMR_SlaveConfigTypeDef *sSlaveConfig)
{
  DAL_StatusTypeDef status = DAL_OK;
  uint32_t tmpsmcr;
  uint32_t tmpccmr1;
  uint32_t tmpccer;

  /* Get the TMRx SMCTRL register value */
  tmpsmcr = htmr->Instance->SMCTRL;

  /* Reset the Trigger Selection Bits */
  tmpsmcr &= ~TMR_SMCTRL_TRGSEL;
  /* Set the Input Trigger source */
  tmpsmcr |= sSlaveConfig->InputTrigger;

  /* Reset the slave mode Bits */
  tmpsmcr &= ~TMR_SMCTRL_SMFSEL;
  /* Set the slave mode */
  tmpsmcr |= sSlaveConfig->SlaveMode;

  /* Write to TMRx SMCTRL */
  htmr->Instance->SMCTRL = tmpsmcr;

  /* Configure the trigger prescaler, filter, and polarity */
  switch (sSlaveConfig->InputTrigger)
  {
    case TMR_TS_ETRF:
    {
      /* Check the parameters */
      ASSERT_PARAM(IS_TMR_CLOCKSOURCE_ETRMODE1_INSTANCE(htmr->Instance));
      ASSERT_PARAM(IS_TMR_TRIGGERPRESCALER(sSlaveConfig->TriggerPrescaler));
      ASSERT_PARAM(IS_TMR_TRIGGERPOLARITY(sSlaveConfig->TriggerPolarity));
      ASSERT_PARAM(IS_TMR_TRIGGERFILTER(sSlaveConfig->TriggerFilter));
      /* Configure the ETR Trigger source */
      TMR_ETR_SetConfig(htmr->Instance,
                        sSlaveConfig->TriggerPrescaler,
                        sSlaveConfig->TriggerPolarity,
                        sSlaveConfig->TriggerFilter);
      break;
    }

    case TMR_TS_TI1F_ED:
    {
      /* Check the parameters */
      ASSERT_PARAM(IS_TMR_CC1_INSTANCE(htmr->Instance));
      ASSERT_PARAM(IS_TMR_TRIGGERFILTER(sSlaveConfig->TriggerFilter));

      if (sSlaveConfig->SlaveMode == TMR_SLAVEMODE_GATED)
      {
        return DAL_ERROR;
      }

      /* Disable the Channel 1: Reset the CC1EN Bit */
      tmpccer = htmr->Instance->CCEN;
      htmr->Instance->CCEN &= ~TMR_CCEN_CC1EN;
      tmpccmr1 = htmr->Instance->CCM1;

      /* Set the filter */
      tmpccmr1 &= ~TMR_CCM1_IC1F;
      tmpccmr1 |= ((sSlaveConfig->TriggerFilter) << 4U);

      /* Write to TMRx CCM1 and CCEN registers */
      htmr->Instance->CCM1 = tmpccmr1;
      htmr->Instance->CCEN = tmpccer;
      break;
    }

    case TMR_TS_TI1FP1:
    {
      /* Check the parameters */
      ASSERT_PARAM(IS_TMR_CC1_INSTANCE(htmr->Instance));
      ASSERT_PARAM(IS_TMR_TRIGGERPOLARITY(sSlaveConfig->TriggerPolarity));
      ASSERT_PARAM(IS_TMR_TRIGGERFILTER(sSlaveConfig->TriggerFilter));

