betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_tmr.c
      /* Configure TI1 Filter and Polarity */
      TMR_TI1_ConfigInputStage(htmr->Instance,
                               sSlaveConfig->TriggerPolarity,
                               sSlaveConfig->TriggerFilter);
      break;
    }

    case TMR_TS_TI2FP2:
    {
      /* Check the parameters */
      ASSERT_PARAM(IS_TMR_CC2_INSTANCE(htmr->Instance));
      ASSERT_PARAM(IS_TMR_TRIGGERPOLARITY(sSlaveConfig->TriggerPolarity));
      ASSERT_PARAM(IS_TMR_TRIGGERFILTER(sSlaveConfig->TriggerFilter));

      /* Configure TI2 Filter and Polarity */
      TMR_TI2_ConfigInputStage(htmr->Instance,
                               sSlaveConfig->TriggerPolarity,
                               sSlaveConfig->TriggerFilter);
      break;
    }

    case TMR_TS_ITR0:
    case TMR_TS_ITR1:
    case TMR_TS_ITR2:
    case TMR_TS_ITR3:
    {
      /* Check the parameter */
      ASSERT_PARAM(IS_TMR_CC2_INSTANCE(htmr->Instance));
      break;
    }

    default:
      status = DAL_ERROR;
      break;
  }

  return status;
}

/**
  * @brief  Configure the TI1 as Input.
  * @param  TMRx to select the TMR peripheral.
  * @param  TMR_ICPolarity The Input Polarity.
  *          This parameter can be one of the following values:
  *            @arg TMR_ICPOLARITY_RISING
  *            @arg TMR_ICPOLARITY_FALLING
  *            @arg TMR_ICPOLARITY_BOTHEDGE
  * @param  TMR_ICSelection specifies the input to be used.
  *          This parameter can be one of the following values:
  *            @arg TMR_ICSELECTION_DIRECTTI: TMR Input 1 is selected to be connected to IC1.
  *            @arg TMR_ICSELECTION_INDIRECTTI: TMR Input 1 is selected to be connected to IC2.
  *            @arg TMR_ICSELECTION_TRC: TMR Input 1 is selected to be connected to TRC.
  * @param  TMR_ICFilter Specifies the Input Capture Filter.
  *          This parameter must be a value between 0x00 and 0x0F.
  * @retval None
  * @note TMR_ICFilter and TMR_ICPolarity are not used in INDIRECT mode as TI2FP1
  *       (on channel2 path) is used as the input signal. Therefore CCMR1 must be
  *        protected against un-initialized filter and polarity values.
  */
void TMR_TI1_SetConfig(TMR_TypeDef *TMRx, uint32_t TMR_ICPolarity, uint32_t TMR_ICSelection,
                       uint32_t TMR_ICFilter)
{
  uint32_t tmpccmr1;
  uint32_t tmpccer;

  /* Disable the Channel 1: Reset the CC1EN Bit */
  tmpccer = TMRx->CCEN;
  TMRx->CCEN &= ~TMR_CCEN_CC1EN;
  tmpccmr1 = TMRx->CCM1;

  /* Select the Input */
  if (IS_TMR_CC2_INSTANCE(TMRx) != RESET)
  {
    tmpccmr1 &= ~TMR_CCM1_CC1SEL;
    tmpccmr1 |= TMR_ICSelection;
  }
  else
  {
    tmpccmr1 |= TMR_CCM1_CC1SEL_0;
  }

  /* Set the filter */
  tmpccmr1 &= ~TMR_CCM1_IC1F;
  tmpccmr1 |= ((TMR_ICFilter << 4U) & TMR_CCM1_IC1F);

  /* Select the Polarity and set the CC1EN Bit */
  tmpccer &= ~(TMR_CCEN_CC1POL | TMR_CCEN_CC1NPOL);
  tmpccer |= (TMR_ICPolarity & (TMR_CCEN_CC1POL | TMR_CCEN_CC1NPOL));

  /* Write to TMRx CCM1 and CCEN registers */
  TMRx->CCM1 = tmpccmr1;
  TMRx->CCEN = tmpccer;
}

/**
  * @brief  Configure the Polarity and Filter for TI1.
  * @param  TMRx to select the TMR peripheral.
  * @param  TMR_ICPolarity The Input Polarity.
  *          This parameter can be one of the following values:
  *            @arg TMR_ICPOLARITY_RISING
  *            @arg TMR_ICPOLARITY_FALLING
  *            @arg TMR_ICPOLARITY_BOTHEDGE
  * @param  TMR_ICFilter Specifies the Input Capture Filter.
  *          This parameter must be a value between 0x00 and 0x0F.
  * @retval None
  */
static void TMR_TI1_ConfigInputStage(TMR_TypeDef *TMRx, uint32_t TMR_ICPolarity, uint32_t TMR_ICFilter)
{
  uint32_t tmpccmr1;
  uint32_t tmpccer;

  /* Disable the Channel 1: Reset the CC1EN Bit */
  tmpccer = TMRx->CCEN;
  TMRx->CCEN &= ~TMR_CCEN_CC1EN;
  tmpccmr1 = TMRx->CCM1;

  /* Set the filter */
  tmpccmr1 &= ~TMR_CCM1_IC1F;
  tmpccmr1 |= (TMR_ICFilter << 4U);

  /* Select the Polarity and set the CC1EN Bit */
  tmpccer &= ~(TMR_CCEN_CC1POL | TMR_CCEN_CC1NPOL);
  tmpccer |= TMR_ICPolarity;

  /* Write to TMRx CCM1 and CCEN registers */
  TMRx->CCM1 = tmpccmr1;
  TMRx->CCEN = tmpccer;
}

/**
  * @brief  Configure the TI2 as Input.
  * @param  TMRx to select the TMR peripheral
  * @param  TMR_ICPolarity The Input Polarity.
  *          This parameter can be one of the following values:
  *            @arg TMR_ICPOLARITY_RISING
  *            @arg TMR_ICPOLARITY_FALLING
  *            @arg TMR_ICPOLARITY_BOTHEDGE
  * @param  TMR_ICSelection specifies the input to be used.
  *          This parameter can be one of the following values:
  *            @arg TMR_ICSELECTION_DIRECTTI: TMR Input 2 is selected to be connected to IC2.
  *            @arg TMR_ICSELECTION_INDIRECTTI: TMR Input 2 is selected to be connected to IC1.
  *            @arg TMR_ICSELECTION_TRC: TMR Input 2 is selected to be connected to TRC.
  * @param  TMR_ICFilter Specifies the Input Capture Filter.
  *          This parameter must be a value between 0x00 and 0x0F.
  * @retval None
  * @note TMR_ICFilter and TMR_ICPolarity are not used in INDIRECT mode as TI1FP2
  *       (on channel1 path) is used as the input signal. Therefore CCMR1 must be
  *        protected against un-initialized filter and polarity values.
  */
static void TMR_TI2_SetConfig(TMR_TypeDef *TMRx, uint32_t TMR_ICPolarity, uint32_t TMR_ICSelection,
                              uint32_t TMR_ICFilter)
{
  uint32_t tmpccmr1;
  uint32_t tmpccer;

  /* Disable the Channel 2: Reset the CC2EN Bit */
  tmpccer = TMRx->CCEN;
  TMRx->CCEN &= ~TMR_CCEN_CC2EN;
  tmpccmr1 = TMRx->CCM1;

  /* Select the Input */
  tmpccmr1 &= ~TMR_CCM1_CC2SEL;
  tmpccmr1 |= (TMR_ICSelection << 8U);

  /* Set the filter */
  tmpccmr1 &= ~TMR_CCM1_IC2F;
  tmpccmr1 |= ((TMR_ICFilter << 12U) & TMR_CCM1_IC2F);

  /* Select the Polarity and set the CC2EN Bit */
  tmpccer &= ~(TMR_CCEN_CC2POL | TMR_CCEN_CC2NPOL);
  tmpccer |= ((TMR_ICPolarity << 4U) & (TMR_CCEN_CC2POL | TMR_CCEN_CC2NPOL));

  /* Write to TMRx CCM1 and CCEN registers */
  TMRx->CCM1 = tmpccmr1 ;
  TMRx->CCEN = tmpccer;
}

/**
  * @brief  Configure the Polarity and Filter for TI2.
  * @param  TMRx to select the TMR peripheral.
  * @param  TMR_ICPolarity The Input Polarity.
  *          This parameter can be one of the following values:
  *            @arg TMR_ICPOLARITY_RISING
  *            @arg TMR_ICPOLARITY_FALLING
  *            @arg TMR_ICPOLARITY_BOTHEDGE
  * @param  TMR_ICFilter Specifies the Input Capture Filter.
  *          This parameter must be a value between 0x00 and 0x0F.
  * @retval None
  */
static void TMR_TI2_ConfigInputStage(TMR_TypeDef *TMRx, uint32_t TMR_ICPolarity, uint32_t TMR_ICFilter)
{
  uint32_t tmpccmr1;
  uint32_t tmpccer;

  /* Disable the Channel 2: Reset the CC2EN Bit */
  tmpccer = TMRx->CCEN;
  TMRx->CCEN &= ~TMR_CCEN_CC2EN;
  tmpccmr1 = TMRx->CCM1;

  /* Set the filter */
  tmpccmr1 &= ~TMR_CCM1_IC2F;
  tmpccmr1 |= (TMR_ICFilter << 12U);

  /* Select the Polarity and set the CC2EN Bit */
  tmpccer &= ~(TMR_CCEN_CC2POL | TMR_CCEN_CC2NPOL);
  tmpccer |= (TMR_ICPolarity << 4U);

  /* Write to TMRx CCM1 and CCEN registers */
  TMRx->CCM1 = tmpccmr1 ;
  TMRx->CCEN = tmpccer;
}

/**
  * @brief  Configure the TI3 as Input.
  * @param  TMRx to select the TMR peripheral
  * @param  TMR_ICPolarity The Input Polarity.
  *          This parameter can be one of the following values:
  *            @arg TMR_ICPOLARITY_RISING
  *            @arg TMR_ICPOLARITY_FALLING
  *            @arg TMR_ICPOLARITY_BOTHEDGE
  * @param  TMR_ICSelection specifies the input to be used.
  *          This parameter can be one of the following values:
  *            @arg TMR_ICSELECTION_DIRECTTI: TMR Input 3 is selected to be connected to IC3.
  *            @arg TMR_ICSELECTION_INDIRECTTI: TMR Input 3 is selected to be connected to IC4.
  *            @arg TMR_ICSELECTION_TRC: TMR Input 3 is selected to be connected to TRC.
  * @param  TMR_ICFilter Specifies the Input Capture Filter.
  *          This parameter must be a value between 0x00 and 0x0F.
  * @retval None
  * @note TMR_ICFilter and TMR_ICPolarity are not used in INDIRECT mode as TI3FP4
  *       (on channel1 path) is used as the input signal. Therefore CCMR2 must be
  *        protected against un-initialized filter and polarity values.
  */
static void TMR_TI3_SetConfig(TMR_TypeDef *TMRx, uint32_t TMR_ICPolarity, uint32_t TMR_ICSelection,
                              uint32_t TMR_ICFilter)
{
  uint32_t tmpccmr2;
  uint32_t tmpccer;

  /* Disable the Channel 3: Reset the CC3EN Bit */
  tmpccer = TMRx->CCEN;
  TMRx->CCEN &= ~TMR_CCEN_CC3EN;
  tmpccmr2 = TMRx->CCM2;

  /* Select the Input */
  tmpccmr2 &= ~TMR_CCM2_CC3SEL;
  tmpccmr2 |= TMR_ICSelection;

  /* Set the filter */
  tmpccmr2 &= ~TMR_CCM2_IC3F;
  tmpccmr2 |= ((TMR_ICFilter << 4U) & TMR_CCM2_IC3F);

