betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_tmr.c
  /* Select the Polarity and set the CC3EN Bit */
  tmpccer &= ~(TMR_CCEN_CC3POL | TMR_CCEN_CC3NPOL);
  tmpccer |= ((TMR_ICPolarity << 8U) & (TMR_CCEN_CC3POL | TMR_CCEN_CC3NPOL));

  /* Write to TMRx CCM2 and CCEN registers */
  TMRx->CCM2 = tmpccmr2;
  TMRx->CCEN = tmpccer;
}

/**
  * @brief  Configure the TI4 as Input.
  * @param  TMRx to select the TMR peripheral
  * @param  TMR_ICPolarity The Input Polarity.
  *          This parameter can be one of the following values:
  *            @arg TMR_ICPOLARITY_RISING
  *            @arg TMR_ICPOLARITY_FALLING
  *            @arg TMR_ICPOLARITY_BOTHEDGE
  * @param  TMR_ICSelection specifies the input to be used.
  *          This parameter can be one of the following values:
  *            @arg TMR_ICSELECTION_DIRECTTI: TMR Input 4 is selected to be connected to IC4.
  *            @arg TMR_ICSELECTION_INDIRECTTI: TMR Input 4 is selected to be connected to IC3.
  *            @arg TMR_ICSELECTION_TRC: TMR Input 4 is selected to be connected to TRC.
  * @param  TMR_ICFilter Specifies the Input Capture Filter.
  *          This parameter must be a value between 0x00 and 0x0F.
  * @note TMR_ICFilter and TMR_ICPolarity are not used in INDIRECT mode as TI4FP3
  *       (on channel1 path) is used as the input signal. Therefore CCMR2 must be
  *        protected against un-initialized filter and polarity values.
  * @retval None
  */
static void TMR_TI4_SetConfig(TMR_TypeDef *TMRx, uint32_t TMR_ICPolarity, uint32_t TMR_ICSelection,
                              uint32_t TMR_ICFilter)
{
  uint32_t tmpccmr2;
  uint32_t tmpccer;

  /* Disable the Channel 4: Reset the CC4EN Bit */
  tmpccer = TMRx->CCEN;
  TMRx->CCEN &= ~TMR_CCEN_CC4EN;
  tmpccmr2 = TMRx->CCM2;

  /* Select the Input */
  tmpccmr2 &= ~TMR_CCM2_CC4SEL;
  tmpccmr2 |= (TMR_ICSelection << 8U);

  /* Set the filter */
  tmpccmr2 &= ~TMR_CCM2_IC4F;
  tmpccmr2 |= ((TMR_ICFilter << 12U) & TMR_CCM2_IC4F);

  /* Select the Polarity and set the CC4EN Bit */
  tmpccer &= ~(TMR_CCEN_CC4POL | TMR_CCEN_CC4NPOL);
  tmpccer |= ((TMR_ICPolarity << 12U) & (TMR_CCEN_CC4POL | TMR_CCEN_CC4NPOL));

  /* Write to TMRx CCM2 and CCEN registers */
  TMRx->CCM2 = tmpccmr2;
  TMRx->CCEN = tmpccer ;
}

/**
  * @brief  Selects the Input Trigger source
  * @param  TMRx to select the TMR peripheral
  * @param  InputTriggerSource The Input Trigger source.
  *          This parameter can be one of the following values:
  *            @arg TMR_TS_ITR0: Internal Trigger 0
  *            @arg TMR_TS_ITR1: Internal Trigger 1
  *            @arg TMR_TS_ITR2: Internal Trigger 2
  *            @arg TMR_TS_ITR3: Internal Trigger 3
  *            @arg TMR_TS_TI1F_ED: TI1 Edge Detector
  *            @arg TMR_TS_TI1FP1: Filtered Timer Input 1
  *            @arg TMR_TS_TI2FP2: Filtered Timer Input 2
  *            @arg TMR_TS_ETRF: External Trigger input
  * @retval None
  */
static void TMR_ITRx_SetConfig(TMR_TypeDef *TMRx, uint32_t InputTriggerSource)
{
  uint32_t tmpsmcr;

  /* Get the TMRx SMCTRL register value */
  tmpsmcr = TMRx->SMCTRL;
  /* Reset the TS Bits */
  tmpsmcr &= ~TMR_SMCTRL_TRGSEL;
  /* Set the Input Trigger source and the slave mode*/
  tmpsmcr |= (InputTriggerSource | TMR_SLAVEMODE_EXTERNAL1);
  /* Write to TMRx SMCTRL */
  TMRx->SMCTRL = tmpsmcr;
}
/**
  * @brief  Configures the TMRx External Trigger (ETR).
  * @param  TMRx to select the TMR peripheral
  * @param  TMR_ExtTRGPrescaler The external Trigger Prescaler.
  *          This parameter can be one of the following values:
  *            @arg TMR_ETRPRESCALER_DIV1: ETRP Prescaler OFF.
  *            @arg TMR_ETRPRESCALER_DIV2: ETRP frequency divided by 2.
  *            @arg TMR_ETRPRESCALER_DIV4: ETRP frequency divided by 4.
  *            @arg TMR_ETRPRESCALER_DIV8: ETRP frequency divided by 8.
  * @param  TMR_ExtTRGPolarity The external Trigger Polarity.
  *          This parameter can be one of the following values:
  *            @arg TMR_ETRPOLARITY_INVERTED: active low or falling edge active.
  *            @arg TMR_ETRPOLARITY_NONINVERTED: active high or rising edge active.
  * @param  ExtTRGFilter External Trigger Filter.
  *          This parameter must be a value between 0x00 and 0x0F
  * @retval None
  */
void TMR_ETR_SetConfig(TMR_TypeDef *TMRx, uint32_t TMR_ExtTRGPrescaler,
                       uint32_t TMR_ExtTRGPolarity, uint32_t ExtTRGFilter)
{
  uint32_t tmpsmcr;

  tmpsmcr = TMRx->SMCTRL;

  /* Reset the ETR Bits */
  tmpsmcr &= ~(TMR_SMCTRL_ETFCFG | TMR_SMCTRL_ETPCFG | TMR_SMCTRL_ECEN | TMR_SMCTRL_ETPOL);

  /* Set the Prescaler, the Filter value and the Polarity */
  tmpsmcr |= (uint32_t)(TMR_ExtTRGPrescaler | (TMR_ExtTRGPolarity | (ExtTRGFilter << 8U)));

  /* Write to TMRx SMCTRL */
  TMRx->SMCTRL = tmpsmcr;
}

/**
  * @brief  Enables or disables the TMR Capture Compare Channel x.
  * @param  TMRx to select the TMR peripheral
  * @param  Channel specifies the TMR Channel
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1
  *            @arg TMR_CHANNEL_2: TMR Channel 2
  *            @arg TMR_CHANNEL_3: TMR Channel 3
  *            @arg TMR_CHANNEL_4: TMR Channel 4
  * @param  ChannelState specifies the TMR Channel CCxE bit new state.
  *          This parameter can be: TMR_CCx_ENABLE or TMR_CCx_DISABLE.
  * @retval None
  */
void TMR_CCxChannelCmd(TMR_TypeDef *TMRx, uint32_t Channel, uint32_t ChannelState)
{
  uint32_t tmp;

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_CC1_INSTANCE(TMRx));
  ASSERT_PARAM(IS_TMR_CHANNELS(Channel));

  tmp = TMR_CCEN_CC1EN << (Channel & 0x1FU); /* 0x1FU = 31 bits max shift */

  /* Reset the CCxEN Bit */
  TMRx->CCEN &= ~tmp;

  /* Set or reset the CCxEN Bit */
  TMRx->CCEN |= (uint32_t)(ChannelState << (Channel & 0x1FU)); /* 0x1FU = 31 bits max shift */
}

#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
/**
  * @brief  Reset interrupt callbacks to the legacy weak callbacks.
  * @param  htmr pointer to a TMR_HandleTypeDef structure that contains
  *                the configuration information for TMR module.
  * @retval None
  */
void TMR_ResetCallback(TMR_HandleTypeDef *htmr)
{
  /* Reset the TMR callback to the legacy weak callbacks */
  htmr->PeriodElapsedCallback             = DAL_TMR_PeriodElapsedCallback;
  htmr->PeriodElapsedHalfCpltCallback     = DAL_TMR_PeriodElapsedHalfCpltCallback;
  htmr->TriggerCallback                   = DAL_TMR_TriggerCallback;
  htmr->TriggerHalfCpltCallback           = DAL_TMR_TriggerHalfCpltCallback;
  htmr->IC_CaptureCallback                = DAL_TMR_IC_CaptureCallback;
  htmr->IC_CaptureHalfCpltCallback        = DAL_TMR_IC_CaptureHalfCpltCallback;
  htmr->OC_DelayElapsedCallback           = DAL_TMR_OC_DelayElapsedCallback;
  htmr->PWM_PulseFinishedCallback         = DAL_TMR_PWM_PulseFinishedCallback;
  htmr->PWM_PulseFinishedHalfCpltCallback = DAL_TMR_PWM_PulseFinishedHalfCpltCallback;
  htmr->ErrorCallback                     = DAL_TMR_ErrorCallback;
  htmr->CommutationCallback               = DAL_TMREx_CommutCallback;
  htmr->CommutationHalfCpltCallback       = DAL_TMREx_CommutHalfCpltCallback;
  htmr->BreakCallback                     = DAL_TMREx_BreakCallback;
}
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */

/**
  * @}
  */

#endif /* DAL_TMR_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */
